{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Review\Data\Final\regressions_price_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}28 Apr 2023, 13:07:07
{txt}
{com}. use regressions_price.dta
{txt}
{com}. 
. 
. *fixed effects
. xi i.month*i.year i.month i.year i.ymd i.yq i.quarter
{txt}i.month{col 19}_Imonth_1-12{col 39}(naturally coded; _Imonth_1 omitted)
i.year{col 19}_Iyear_2017-2020{col 39}(naturally coded; _Iyear_2017 omitted)
i.month*i.year{col 19}_ImonXyea_#_#{col 39}(coded as above)
i.ymd{col 19}_Iymd_1-1372{col 39}(naturally coded; _Iymd_1 omitted)
i.yq{col 19}_Iyq_1-16{col 39}(naturally coded; _Iyq_1 omitted)
i.quarter{col 19}_Iquarter_1-4{col 39}(naturally coded; _Iquarter_1 omitted)

{com}. *xi i.yq
. global fe = "_Iyq* _Ihour*"
{txt}
{com}. global fe2 = "_Iyq*"
{txt}
{com}. global fe3 = "_Iyear*"
{txt}
{com}. global fe4 = "_Iyear* _Imonth*"
{txt}
{com}. global fe5 = "_Iyear*  _Ihour*"
{txt}
{com}. global fe6 = "_Imonth*  _Ihour*"
{txt}
{com}. 
. *Lags Controls
. sort hour year month day 
{txt}
{com}. foreach var in solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice  {c -(}
{txt}  2{com}. by hour: gen lag_`var'=`var'[_n-1]
{txt}  3{com}. by hour: gen lag2_`var'=`var'[_n-2]
{txt}  4{com}. by hour: gen lag3_`var'=`var'[_n-3]
{txt}  5{com}. by hour: gen lag4_`var'=`var'[_n-4]
{txt}  6{com}. by hour: gen lag5_`var'=`var'[_n-5]     
{txt}  7{com}. {c )-}
{txt}(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(15 missing values generated)
(29 missing values generated)
(43 missing values generated)
(57 missing values generated)
(71 missing values generated)
(15 missing values generated)
(29 missing values generated)
(43 missing values generated)
(57 missing values generated)
(71 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)

{com}. 
. global lag_controls = "lag_*"
{txt}
{com}. global lags_controls = "lag*"
{txt}
{com}. 
. *Lags Dependent and Explanatory Variables
. sort hour year month day 
{txt}
{com}. foreach var in diff_p_id_da q_total_mg_id mg_price_id_max {c -(}
{txt}  2{com}. by hour: gen `var'_lag=`var'[_n-1]
{txt}  3{com}. by hour: gen `var'_lag2=`var'[_n-2]
{txt}  4{com}. by hour: gen `var'_lag3=`var'[_n-3]
{txt}  5{com}. by hour: gen `var'_lag4=`var'[_n-4]
{txt}  6{com}. by hour: gen `var'_lag5=`var'[_n-5]     
{txt}  7{com}. {c )-}
{txt}(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)

{com}. 
. global expl_lag = "diff_p_id_da_lag  q_total_mg_id_lag"
{txt}
{com}. global expl_lags = "diff_p_id_da_lag*  q_total_mg_id_lag*"
{txt}
{com}. 
. *Lags instruments
. global instr_lag="lag_load_ACT lag_solar_share lag_wind_share lag_hydro_share lag_co2price lag_gasprice"
{txt}
{com}. 
. *First differences
. sort date_hour
{txt}
{com}. foreach var in pbid_max mg_price_id_max solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice {c -(}
{txt}  2{com}.         gen d`var'=`var'-`var'[_n-1]
{txt}  3{com}. {c )-}
{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(3 missing values generated)
(3 missing values generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

{com}. 
. *********1) When to submit
. ***(1) IV PF
. qui ivregress 2sls pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend) solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe2, robust 
{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Review\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 1st_step_results.doc, replace ctitle(IV PF) addstat("Chi2", e(chi2))
. 
. ***(2) IV 1 Lag
. qui ivregress 2sls pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend) $lag_controls $fe2, robust
{txt}
{com}. *outreg2 using 1st_step_results.doc, append ctitle(IV 1 Lag) addstat("Chi2", e(chi2))
. 
. ***(3) IV Probit PF
. qui ivprobit pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend)  solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe2
{txt}
{com}. outreg2 using 1st_step_results.doc, append ctitle(IV Probit PF) addstat("Chi2", e(chi2))
{txt}{stata `"shellout using `"1st_step_results.doc"'"':1st_step_results.doc}
{browse `"C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Review\Data\Final\RegressionResults"' :dir}{com} : {txt}{stata `"seeout using "1st_step_results.txt""':seeout}

{com}. *Average marginal effects (takes long to be executed!)
. margins, dydx(diff_p_id_da q_total_mg_id) pred(pr)
{res}
{txt}{col 1}Average marginal effects{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:16,460}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Average structural function probabilities, predict(pr)}{p_end}
{p2col:dy/dx wrt:}{res:diff_p_id_da q_total_mg_id}{p_end}
{p2colreset}{...}

{res}{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27} Delta-method
{col 15}{c |}      dy/dx{col 27}   std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}diff_p_id_da {c |}{col 15}{res}{space 2} .0904703{col 27}{space 2} .0164777{col 38}{space 1}    5.49{col 47}{space 3}0.000{col 55}{space 4} .0581747{col 68}{space 3} .1227659
{txt}q_total_mg_id {c |}{col 15}{res}{space 2} .2989101{col 27}{space 2} .0169201{col 38}{space 1}   17.67{col 47}{space 3}0.000{col 55}{space 4} .2657473{col 68}{space 3} .3320728
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. ***(4) IV Probit 1 Lag
. qui ivprobit pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend) $lag_controls $fe2
{txt}
{com}. *outreg2 using 1st_step_results.doc, append ctitle(IV Probit 1 Lag)  addstat("Chi2", e(chi2))
. *Average marginal effects (takes long to be executed!)
. margins, dydx(diff_p_id_da q_total_mg_id) pred(pr)
{res}{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. end
{err}command {bf}end{sf} is unrecognized
{txt}{search r(199), local:r(199);}

{com}. exit, clear
