{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\regressions_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 Nov 2022, 13:02:39
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\JOHANNS\AppData\Local\Temp\STD5f8_000000.tmp"
{txt}
{com}. use regressions.dta
{txt}
{com}. tsset date_hour
{res}
{p 0 15 2}{txt:Time variable: }{res:date_hour}{txt:, }{res:{bind:01jan2017 08:59:22}}{txt: to }{res:{bind:24dec2020 18:00:57}}{txt:, but with gaps}{p_end}
{txt}{col 9}Delta: {res}.001 seconds
{txt}
{com}. 
. *fixed effects
. xi i.hour  i.month*i.year i.month i.year i.ymd i.yq i.quarter
{txt}i.hour{col 19}_Ihour_8-21{col 39}(naturally coded; _Ihour_8 omitted)
i.month{col 19}_Imonth_1-12{col 39}(naturally coded; _Imonth_1 omitted)
i.year{col 19}_Iyear_2017-2020{col 39}(naturally coded; _Iyear_2017 omitted)
i.month*i.year{col 19}_ImonXyea_#_#{col 39}(coded as above)
i.ymd{col 19}_Iymd_1-1372{col 39}(naturally coded; _Iymd_1 omitted)
i.yq{col 19}_Iyq_1-16{col 39}(naturally coded; _Iyq_1 omitted)
i.quarter{col 19}_Iquarter_1-4{col 39}(naturally coded; _Iquarter_1 omitted)

{com}. global fe = "_Iyq* _Ihour*"
{txt}
{com}. global fe2 = "_Iyq*"
{txt}
{com}. global fe3 = "_Iyear*"
{txt}
{com}. global fe4 = "_Iyear* _Imonth*"
{txt}
{com}. global fe5 = "_Iyear*  _Ihour*"
{txt}
{com}. global fe6 = "_Iyear* _Imonth*  _Ihour*"
{txt}
{com}. 
. *Lags Controls
. sort hour year month day 
{txt}
{com}. foreach var in solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice  {c -(}
{txt}  2{com}. by hour: gen lag_`var'=`var'[_n-1]
{txt}  3{com}. by hour: gen lag2_`var'=`var'[_n-2]
{txt}  4{com}. by hour: gen lag3_`var'=`var'[_n-3]
{txt}  5{com}. by hour: gen lag4_`var'=`var'[_n-4]
{txt}  6{com}. by hour: gen lag5_`var'=`var'[_n-5]     
{txt}  7{com}. {c )-}
{txt}(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(15 missing values generated)
(29 missing values generated)
(43 missing values generated)
(57 missing values generated)
(71 missing values generated)
(15 missing values generated)
(29 missing values generated)
(43 missing values generated)
(57 missing values generated)
(71 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)

{com}. 
. global lag_controls = "lag_*"
{txt}
{com}. global lags_controls = "lag*"
{txt}
{com}. 
. *Lags Dependent and Explanatory Variables
. sort hour year month day 
{txt}
{com}. foreach var in diff_p_id_da q_total_mg_id mg_price_id_max {c -(}
{txt}  2{com}. by hour: gen `var'_lag=`var'[_n-1]
{txt}  3{com}. by hour: gen `var'_lag2=`var'[_n-2]
{txt}  4{com}. by hour: gen `var'_lag3=`var'[_n-3]
{txt}  5{com}. by hour: gen `var'_lag4=`var'[_n-4]
{txt}  6{com}. by hour: gen `var'_lag5=`var'[_n-5]     
{txt}  7{com}. {c )-}
{txt}(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)
(14 missing values generated)
(28 missing values generated)
(42 missing values generated)
(56 missing values generated)
(70 missing values generated)

{com}. 
. global expl_lag = "diff_p_id_da_lag  q_total_mg_id_lag"
{txt}
{com}. global expl_lags = "diff_p_id_da_lag*  q_total_mg_id_lag*"
{txt}
{com}. 
. *Lags instruments
. global instr_lag="lag_load_ACT lag_solar_share lag_wind_share lag_hydro_share lag_co2price lag_gasprice"
{txt}
{com}. 
. *First differences
. sort date_hour
{txt}
{com}. foreach var in pbid_max mg_price_id_max solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice {c -(}
{txt}  2{com}.         gen d`var'=`var'-`var'[_n-1]
{txt}  3{com}. {c )-}
{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(3 missing values generated)
(3 missing values generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

{com}. 
. *********1) When to submit
. ***(1) IV PF
. ivregress 2sls pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend) solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe2, robust 
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}    16,460
{txt}{col 1}{col 51}Wald chi2({res}28{txt}){col 67}= {res}   3595.04
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}         .
{txt}{col 51}Root MSE{col 67}=    {res} .53547

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}    pbid_dummy{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}diff_p_id_da {c |}{col 16}{res}{space 2} .1054574{col 28}{space 2} .0192119{col 39}{space 1}    5.49{col 48}{space 3}0.000{col 56}{space 4} .0678027{col 69}{space 3} .1431121
{txt}{space 1}q_total_mg_id {c |}{col 16}{res}{space 2} .3279764{col 28}{space 2} .0208191{col 39}{space 1}   15.75{col 48}{space 3}0.000{col 56}{space 4} .2871718{col 69}{space 3} .3687811
{txt}{space 3}solar_share {c |}{col 16}{res}{space 2} -.012266{col 28}{space 2} .0015287{col 39}{space 1}   -8.02{col 48}{space 3}0.000{col 56}{space 4}-.0152622{col 69}{space 3}-.0092699
{txt}{space 4}wind_share {c |}{col 16}{res}{space 2}-.0118498{col 28}{space 2}  .001069{col 39}{space 1}  -11.09{col 48}{space 3}0.000{col 56}{space 4}-.0139449{col 69}{space 3}-.0097546
{txt}{space 3}hydro_share {c |}{col 16}{res}{space 2}-.0253143{col 28}{space 2} .0022262{col 39}{space 1}  -11.37{col 48}{space 3}0.000{col 56}{space 4}-.0296775{col 69}{space 3}-.0209511
{txt}{space 5}gas_share {c |}{col 16}{res}{space 2}-.0138548{col 28}{space 2} .0014374{col 39}{space 1}   -9.64{col 48}{space 3}0.000{col 56}{space 4} -.016672{col 69}{space 3}-.0110375
{txt}{space 4}coal_share {c |}{col 16}{res}{space 2}-.0035983{col 28}{space 2} .0017285{col 39}{space 1}   -2.08{col 48}{space 3}0.037{col 56}{space 4}-.0069861{col 69}{space 3}-.0002105
{txt}{space 6}load_ACT {c |}{col 16}{res}{space 2}-.0217757{col 28}{space 2} .0025685{col 39}{space 1}   -8.48{col 48}{space 3}0.000{col 56}{space 4}-.0268098{col 69}{space 3}-.0167416
{txt}solar_fc_error {c |}{col 16}{res}{space 2} .0394037{col 28}{space 2} .0234189{col 39}{space 1}    1.68{col 48}{space 3}0.092{col 56}{space 4}-.0064964{col 69}{space 3} .0853038
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2}-.4668962{col 28}{space 2}  .067037{col 39}{space 1}   -6.96{col 48}{space 3}0.000{col 56}{space 4}-.5982864{col 69}{space 3}-.3355061
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2}-1.459452{col 28}{space 2} .2906553{col 39}{space 1}   -5.02{col 48}{space 3}0.000{col 56}{space 4}-2.029126{col 69}{space 3}-.8897777
{txt}{space 6}co2price {c |}{col 16}{res}{space 2} .0180865{col 28}{space 2} .0028515{col 39}{space 1}    6.34{col 48}{space 3}0.000{col 56}{space 4} .0124975{col 69}{space 3} .0236754
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2}-.0127558{col 28}{space 2} .0030394{col 39}{space 1}   -4.20{col 48}{space 3}0.000{col 56}{space 4}-.0187128{col 69}{space 3}-.0067988
{txt}{space 8}_Iyq_2 {c |}{col 16}{res}{space 2}-.0185607{col 28}{space 2}  .027192{col 39}{space 1}   -0.68{col 48}{space 3}0.495{col 56}{space 4}-.0718561{col 69}{space 3} .0347347
{txt}{space 8}_Iyq_3 {c |}{col 16}{res}{space 2} .0294727{col 28}{space 2} .0293383{col 39}{space 1}    1.00{col 48}{space 3}0.315{col 56}{space 4}-.0280294{col 69}{space 3} .0869748
{txt}{space 8}_Iyq_4 {c |}{col 16}{res}{space 2}-.2051435{col 28}{space 2} .0317933{col 39}{space 1}   -6.45{col 48}{space 3}0.000{col 56}{space 4}-.2674571{col 69}{space 3}-.1428298
{txt}{space 8}_Iyq_5 {c |}{col 16}{res}{space 2} .0149978{col 28}{space 2} .0326038{col 39}{space 1}    0.46{col 48}{space 3}0.646{col 56}{space 4}-.0489045{col 69}{space 3} .0789001
{txt}{space 8}_Iyq_6 {c |}{col 16}{res}{space 2} .0371192{col 28}{space 2} .0529942{col 39}{space 1}    0.70{col 48}{space 3}0.484{col 56}{space 4}-.0667476{col 69}{space 3}  .140986
{txt}{space 8}_Iyq_7 {c |}{col 16}{res}{space 2}-.2838541{col 28}{space 2} .0581545{col 39}{space 1}   -4.88{col 48}{space 3}0.000{col 56}{space 4}-.3978349{col 69}{space 3}-.1698733
{txt}{space 8}_Iyq_8 {c |}{col 16}{res}{space 2}-.1911377{col 28}{space 2} .0673782{col 39}{space 1}   -2.84{col 48}{space 3}0.005{col 56}{space 4}-.3231966{col 69}{space 3}-.0590788
{txt}{space 8}_Iyq_9 {c |}{col 16}{res}{space 2} -.170203{col 28}{space 2} .0602301{col 39}{space 1}   -2.83{col 48}{space 3}0.005{col 56}{space 4}-.2882518{col 69}{space 3}-.0521542
{txt}{space 7}_Iyq_10 {c |}{col 16}{res}{space 2} -.296503{col 28}{space 2} .0692187{col 39}{space 1}   -4.28{col 48}{space 3}0.000{col 56}{space 4}-.4321691{col 69}{space 3}-.1608369
{txt}{space 7}_Iyq_11 {c |}{col 16}{res}{space 2}-.3906835{col 28}{space 2} .0804852{col 39}{space 1}   -4.85{col 48}{space 3}0.000{col 56}{space 4}-.5484316{col 69}{space 3}-.2329354
{txt}{space 7}_Iyq_12 {c |}{col 16}{res}{space 2}-.1341969{col 28}{space 2}  .072194{col 39}{space 1}   -1.86{col 48}{space 3}0.063{col 56}{space 4}-.2756945{col 69}{space 3} .0073008
{txt}{space 7}_Iyq_13 {c |}{col 16}{res}{space 2}-.2365669{col 28}{space 2} .0691319{col 39}{space 1}   -3.42{col 48}{space 3}0.001{col 56}{space 4} -.372063{col 69}{space 3}-.1010708
{txt}{space 7}_Iyq_14 {c |}{col 16}{res}{space 2} -.158594{col 28}{space 2} .0696305{col 39}{space 1}   -2.28{col 48}{space 3}0.023{col 56}{space 4}-.2950672{col 69}{space 3}-.0221208
{txt}{space 7}_Iyq_15 {c |}{col 16}{res}{space 2}-.6221822{col 28}{space 2} .0822226{col 39}{space 1}   -7.57{col 48}{space 3}0.000{col 56}{space 4}-.7833355{col 69}{space 3}-.4610288
{txt}{space 7}_Iyq_16 {c |}{col 16}{res}{space 2}-.7794715{col 28}{space 2} .0778549{col 39}{space 1}  -10.01{col 48}{space 3}0.000{col 56}{space 4}-.9320644{col 69}{space 3}-.6268786
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1.001723{col 28}{space 2} .0777002{col 39}{space 1}   12.89{col 48}{space 3}0.000{col 56}{space 4} .8494337{col 69}{space 3} 1.154013
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 94}Instrumented: {res:diff_p_id_da q_total_mg_id}{p_end}
{p 0 14 94}{space 1}Instruments: {res:solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice _Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 afternoon weekend}{p_end}

{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 1st_step_results.doc, replace ctitle(IV PF) addstat("Chi2", e(chi2))
. 
. ***(2) IV 1 Lag
. ivregress 2sls pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend) $lag_controls $fe2, robust
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}    16,446
{txt}{col 1}{col 51}Wald chi2({res}28{txt}){col 67}= {res}   1276.03
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}         .
{txt}{col 51}Root MSE{col 67}=    {res} .92643

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}        pbid_dummy{col 20}{c |} Coefficient{col 32}  std. err.{col 44}      z{col 52}   P>|z|{col 60}     [95% con{col 73}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}diff_p_id_da {c |}{col 20}{res}{space 2} .2967077{col 32}{space 2} .0320075{col 43}{space 1}    9.27{col 52}{space 3}0.000{col 60}{space 4} .2339742{col 73}{space 3} .3594412
{txt}{space 5}q_total_mg_id {c |}{col 20}{res}{space 2} .2268545{col 32}{space 2} .0200381{col 43}{space 1}   11.32{col 52}{space 3}0.000{col 60}{space 4} .1875805{col 73}{space 3} .2661285
{txt}{space 3}lag_solar_share {c |}{col 20}{res}{space 2}-.0181854{col 32}{space 2} .0020505{col 43}{space 1}   -8.87{col 52}{space 3}0.000{col 60}{space 4}-.0222043{col 73}{space 3}-.0141664
{txt}{space 4}lag_wind_share {c |}{col 20}{res}{space 2}-.0134535{col 32}{space 2} .0017431{col 43}{space 1}   -7.72{col 52}{space 3}0.000{col 60}{space 4}  -.01687{col 73}{space 3}-.0100371
{txt}{space 3}lag_hydro_share {c |}{col 20}{res}{space 2}-.0148614{col 32}{space 2} .0025978{col 43}{space 1}   -5.72{col 52}{space 3}0.000{col 60}{space 4} -.019953{col 73}{space 3}-.0097699
{txt}{space 5}lag_gas_share {c |}{col 20}{res}{space 2}-.0084507{col 32}{space 2} .0021711{col 43}{space 1}   -3.89{col 52}{space 3}0.000{col 60}{space 4} -.012706{col 73}{space 3}-.0041955
{txt}{space 4}lag_coal_share {c |}{col 20}{res}{space 2} .0084821{col 32}{space 2} .0028838{col 43}{space 1}    2.94{col 52}{space 3}0.003{col 60}{space 4} .0028299{col 73}{space 3} .0141343
{txt}{space 6}lag_load_ACT {c |}{col 20}{res}{space 2}-.0124361{col 32}{space 2} .0026831{col 43}{space 1}   -4.63{col 52}{space 3}0.000{col 60}{space 4}-.0176949{col 73}{space 3}-.0071773
{txt}lag_solar_fc_error {c |}{col 20}{res}{space 2} -.009785{col 32}{space 2}  .041127{col 43}{space 1}   -0.24{col 52}{space 3}0.812{col 60}{space 4}-.0903925{col 73}{space 3} .0708225
{txt}{space 1}lag_wind_fc_error {c |}{col 20}{res}{space 2}-.1594934{col 32}{space 2} .0807551{col 43}{space 1}   -1.98{col 52}{space 3}0.048{col 60}{space 4}-.3177705{col 73}{space 3}-.0012163
{txt}{space 1}lag_load_fc_error {c |}{col 20}{res}{space 2} 3.628121{col 32}{space 2}  .680304{col 43}{space 1}    5.33{col 52}{space 3}0.000{col 60}{space 4} 2.294749{col 73}{space 3} 4.961492
{txt}{space 6}lag_co2price {c |}{col 20}{res}{space 2} .0193764{col 32}{space 2} .0047144{col 43}{space 1}    4.11{col 52}{space 3}0.000{col 60}{space 4} .0101363{col 73}{space 3} .0286164
{txt}{space 6}lag_gasprice {c |}{col 20}{res}{space 2}-.0363422{col 32}{space 2} .0050395{col 43}{space 1}   -7.21{col 52}{space 3}0.000{col 60}{space 4}-.0462194{col 73}{space 3} -.026465
{txt}{space 12}_Iyq_2 {c |}{col 20}{res}{space 2}-.0011181{col 32}{space 2} .0524947{col 43}{space 1}   -0.02{col 52}{space 3}0.983{col 60}{space 4}-.1040059{col 73}{space 3} .1017697
{txt}{space 12}_Iyq_3 {c |}{col 20}{res}{space 2} .2110774{col 32}{space 2}  .059598{col 43}{space 1}    3.54{col 52}{space 3}0.000{col 60}{space 4} .0942674{col 73}{space 3} .3278873
{txt}{space 12}_Iyq_4 {c |}{col 20}{res}{space 2}-.1458929{col 32}{space 2} .0596515{col 43}{space 1}   -2.45{col 52}{space 3}0.014{col 60}{space 4}-.2628078{col 73}{space 3} -.028978
{txt}{space 12}_Iyq_5 {c |}{col 20}{res}{space 2} .0091245{col 32}{space 2} .0605502{col 43}{space 1}    0.15{col 52}{space 3}0.880{col 60}{space 4}-.1095518{col 73}{space 3} .1278007
{txt}{space 12}_Iyq_6 {c |}{col 20}{res}{space 2} .1955004{col 32}{space 2} .0751079{col 43}{space 1}    2.60{col 52}{space 3}0.009{col 60}{space 4} .0482916{col 73}{space 3} .3427092
{txt}{space 12}_Iyq_7 {c |}{col 20}{res}{space 2} .0413135{col 32}{space 2} .0819686{col 43}{space 1}    0.50{col 52}{space 3}0.614{col 60}{space 4}-.1193421{col 73}{space 3} .2019691
{txt}{space 12}_Iyq_8 {c |}{col 20}{res}{space 2} .2267172{col 32}{space 2} .1019914{col 43}{space 1}    2.22{col 52}{space 3}0.026{col 60}{space 4} .0268177{col 73}{space 3} .4266166
{txt}{space 12}_Iyq_9 {c |}{col 20}{res}{space 2} .0628687{col 32}{space 2} .1012136{col 43}{space 1}    0.62{col 52}{space 3}0.535{col 60}{space 4}-.1355063{col 73}{space 3} .2612437
{txt}{space 11}_Iyq_10 {c |}{col 20}{res}{space 2}-.2232487{col 32}{space 2} .1183582{col 43}{space 1}   -1.89{col 52}{space 3}0.059{col 60}{space 4}-.4552265{col 73}{space 3} .0087292
{txt}{space 11}_Iyq_11 {c |}{col 20}{res}{space 2}-.4825022{col 32}{space 2} .1328281{col 43}{space 1}   -3.63{col 52}{space 3}0.000{col 60}{space 4}-.7428405{col 73}{space 3} -.222164
{txt}{space 11}_Iyq_12 {c |}{col 20}{res}{space 2}-.1488749{col 32}{space 2} .1238896{col 43}{space 1}   -1.20{col 52}{space 3}0.229{col 60}{space 4}-.3916941{col 73}{space 3} .0939443
{txt}{space 11}_Iyq_13 {c |}{col 20}{res}{space 2}-.3746293{col 32}{space 2} .1178572{col 43}{space 1}   -3.18{col 52}{space 3}0.001{col 60}{space 4}-.6056251{col 73}{space 3}-.1436334
{txt}{space 11}_Iyq_14 {c |}{col 20}{res}{space 2}-.2760294{col 32}{space 2} .1223098{col 43}{space 1}   -2.26{col 52}{space 3}0.024{col 60}{space 4}-.5157522{col 73}{space 3}-.0363065
{txt}{space 11}_Iyq_15 {c |}{col 20}{res}{space 2}-.7131655{col 32}{space 2} .1391917{col 43}{space 1}   -5.12{col 52}{space 3}0.000{col 60}{space 4}-.9859763{col 73}{space 3}-.4403547
{txt}{space 11}_Iyq_16 {c |}{col 20}{res}{space 2}-.5934045{col 32}{space 2} .1316819{col 43}{space 1}   -4.51{col 52}{space 3}0.000{col 60}{space 4}-.8514963{col 73}{space 3}-.3353126
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} .8873139{col 32}{space 2} .1366118{col 43}{space 1}    6.50{col 52}{space 3}0.000{col 60}{space 4} .6195597{col 73}{space 3} 1.155068
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 90}Instrumented: {res:diff_p_id_da q_total_mg_id}{p_end}
{p 0 14 90}{space 1}Instruments: {res:lag_solar_share lag_wind_share lag_hydro_share lag_gas_share lag_coal_share lag_load_ACT lag_solar_fc_error lag_wind_fc_error lag_load_fc_error lag_co2price lag_gasprice _Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 afternoon weekend}{p_end}

{com}. *outreg2 using 1st_step_results.doc, append ctitle(IV 1 Lag) addstat("Chi2", e(chi2))
. 
. ***(3) IV Probit PF
. ivprobit pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend)  solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe2
{res}
{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-8575.4282}  
Iteration 1:{space 3}log likelihood = {res:-6038.8506}  
Iteration 2:{space 3}log likelihood = {res:-5988.5665}  
Iteration 3:{space 3}log likelihood = {res:-5988.5133}  
Iteration 4:{space 3}log likelihood = {res:-5988.5133}  
{res}
{txt}Fitting full model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:  -65438.7}  
Iteration 1:{space 3}log likelihood = {res:-65438.674}  
Iteration 2:{space 3}log likelihood = {res:-65438.674}  

{col 1}Probit model with endogenous regressors{col 55}{lalign 13:Number of obs}{col 68} = {res}{ralign 8:16,460}
{txt}{col 55}{lalign 13:Wald chi2({res:28})}{col 68} = {res}{ralign 8:11720.31}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-65438.674}{txt}{col 55}{lalign 13:Prob > chi2}{col 68} = {res}{ralign 8:0.0000}

{txt}{hline 37}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 38}{c |} Coefficient{col 50}  Std. err.{col 62}      z{col 70}   P>|z|{col 78}     [95% con{col 91}f. interval]
{hline 37}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 24}diff_p_id_da {c |}{col 38}{res}{space 2} .2172195{col 50}{space 2} .0274907{col 61}{space 1}    7.90{col 70}{space 3}0.000{col 78}{space 4} .1633387{col 91}{space 3} .2711003
{txt}{space 23}q_total_mg_id {c |}{col 38}{res}{space 2} .7176844{col 50}{space 2} .0654746{col 61}{space 1}   10.96{col 70}{space 3}0.000{col 78}{space 4} .5893566{col 91}{space 3} .8460122
{txt}{space 25}solar_share {c |}{col 38}{res}{space 2}-.0240573{col 50}{space 2} .0022437{col 61}{space 1}  -10.72{col 70}{space 3}0.000{col 78}{space 4}-.0284548{col 91}{space 3}-.0196598
{txt}{space 26}wind_share {c |}{col 38}{res}{space 2}-.0245763{col 50}{space 2} .0015741{col 61}{space 1}  -15.61{col 70}{space 3}0.000{col 78}{space 4}-.0276615{col 91}{space 3}-.0214911
{txt}{space 25}hydro_share {c |}{col 38}{res}{space 2}-.0542578{col 50}{space 2} .0028651{col 61}{space 1}  -18.94{col 70}{space 3}0.000{col 78}{space 4}-.0598733{col 91}{space 3}-.0486424
{txt}{space 27}gas_share {c |}{col 38}{res}{space 2} -.029217{col 50}{space 2} .0029997{col 61}{space 1}   -9.74{col 70}{space 3}0.000{col 78}{space 4}-.0350963{col 91}{space 3}-.0233378
{txt}{space 26}coal_share {c |}{col 38}{res}{space 2}-.0050304{col 50}{space 2} .0038639{col 61}{space 1}   -1.30{col 70}{space 3}0.193{col 78}{space 4}-.0126034{col 91}{space 3} .0025426
{txt}{space 28}load_ACT {c |}{col 38}{res}{space 2}-.0461843{col 50}{space 2} .0063237{col 61}{space 1}   -7.30{col 70}{space 3}0.000{col 78}{space 4}-.0585785{col 91}{space 3}-.0337901
{txt}{space 22}solar_fc_error {c |}{col 38}{res}{space 2} .0784521{col 50}{space 2}  .050601{col 61}{space 1}    1.55{col 70}{space 3}0.121{col 78}{space 4} -.020724{col 91}{space 3} .1776283
{txt}{space 23}wind_fc_error {c |}{col 38}{res}{space 2}-.9599417{col 50}{space 2} .1126947{col 61}{space 1}   -8.52{col 70}{space 3}0.000{col 78}{space 4}-1.180819{col 91}{space 3}-.7390642
{txt}{space 23}load_fc_error {c |}{col 38}{res}{space 2}-3.395262{col 50}{space 2} .7229371{col 61}{space 1}   -4.70{col 70}{space 3}0.000{col 78}{space 4}-4.812192{col 91}{space 3}-1.978331
{txt}{space 28}co2price {c |}{col 38}{res}{space 2} .0382867{col 50}{space 2}  .006326{col 61}{space 1}    6.05{col 70}{space 3}0.000{col 78}{space 4} .0258879{col 91}{space 3} .0506855
{txt}{space 28}gasprice {c |}{col 38}{res}{space 2} -.028379{col 50}{space 2} .0053412{col 61}{space 1}   -5.31{col 70}{space 3}0.000{col 78}{space 4}-.0388476{col 91}{space 3}-.0179105
{txt}{space 30}_Iyq_2 {c |}{col 38}{res}{space 2}-.0781117{col 50}{space 2} .0593366{col 61}{space 1}   -1.32{col 70}{space 3}0.188{col 78}{space 4}-.1944093{col 91}{space 3} .0381859
{txt}{space 30}_Iyq_3 {c |}{col 38}{res}{space 2} .0368484{col 50}{space 2} .0669487{col 61}{space 1}    0.55{col 70}{space 3}0.582{col 78}{space 4}-.0943687{col 91}{space 3} .1680655
{txt}{space 30}_Iyq_4 {c |}{col 38}{res}{space 2}-.4881327{col 50}{space 2} .0695649{col 61}{space 1}   -7.02{col 70}{space 3}0.000{col 78}{space 4}-.6244773{col 91}{space 3} -.351788
{txt}{space 30}_Iyq_5 {c |}{col 38}{res}{space 2}   .01217{col 50}{space 2} .0666694{col 61}{space 1}    0.18{col 70}{space 3}0.855{col 78}{space 4}-.1184997{col 91}{space 3} .1428397
{txt}{space 30}_Iyq_6 {c |}{col 38}{res}{space 2} .0952378{col 50}{space 2} .1070309{col 61}{space 1}    0.89{col 70}{space 3}0.374{col 78}{space 4}-.1145389{col 91}{space 3} .3050145
{txt}{space 30}_Iyq_7 {c |}{col 38}{res}{space 2} -.602859{col 50}{space 2} .1457827{col 61}{space 1}   -4.14{col 70}{space 3}0.000{col 78}{space 4}-.8885877{col 91}{space 3}-.3171302
{txt}{space 30}_Iyq_8 {c |}{col 38}{res}{space 2}-.4127133{col 50}{space 2} .1593317{col 61}{space 1}   -2.59{col 70}{space 3}0.010{col 78}{space 4}-.7249976{col 91}{space 3} -.100429
{txt}{space 30}_Iyq_9 {c |}{col 38}{res}{space 2}-.3869737{col 50}{space 2} .1392815{col 61}{space 1}   -2.78{col 70}{space 3}0.005{col 78}{space 4}-.6599605{col 91}{space 3}-.1139869
{txt}{space 29}_Iyq_10 {c |}{col 38}{res}{space 2}-.6286586{col 50}{space 2} .1548799{col 61}{space 1}   -4.06{col 70}{space 3}0.000{col 78}{space 4}-.9322177{col 91}{space 3}-.3250995
{txt}{space 29}_Iyq_11 {c |}{col 38}{res}{space 2}-.8124713{col 50}{space 2} .1681259{col 61}{space 1}   -4.83{col 70}{space 3}0.000{col 78}{space 4}-1.141992{col 91}{space 3}-.4829505
{txt}{space 29}_Iyq_12 {c |}{col 38}{res}{space 2}-.3033779{col 50}{space 2} .1543924{col 61}{space 1}   -1.96{col 70}{space 3}0.049{col 78}{space 4}-.6059814{col 91}{space 3}-.0007744
{txt}{space 29}_Iyq_13 {c |}{col 38}{res}{space 2}-.4914072{col 50}{space 2}  .142317{col 61}{space 1}   -3.45{col 70}{space 3}0.001{col 78}{space 4}-.7703434{col 91}{space 3}-.2124711
{txt}{space 29}_Iyq_14 {c |}{col 38}{res}{space 2}-.3765772{col 50}{space 2} .1419503{col 61}{space 1}   -2.65{col 70}{space 3}0.008{col 78}{space 4}-.6547947{col 91}{space 3}-.0983596
{txt}{space 29}_Iyq_15 {c |}{col 38}{res}{space 2}-1.082591{col 50}{space 2} .1818147{col 61}{space 1}   -5.95{col 70}{space 3}0.000{col 78}{space 4}-1.438941{col 91}{space 3}-.7262406
{txt}{space 29}_Iyq_16 {c |}{col 38}{res}{space 2}-1.327222{col 50}{space 2} .2038899{col 61}{space 1}   -6.51{col 70}{space 3}0.000{col 78}{space 4}-1.726838{col 91}{space 3}-.9276047
{txt}{space 31}_cons {c |}{col 38}{res}{space 2}   .81982{col 50}{space 2}  .141357{col 61}{space 1}    5.80{col 70}{space 3}0.000{col 78}{space 4} .5427654{col 91}{space 3} 1.096875
{txt}{hline 37}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    corr(e.diff_p_id_da,e.pbid_dummy){c |}{col 38}{res}{space 2}-.6162251{col 50}{space 2} .0743698{col 78}{space 4}-.7415414{col 91}{space 3}-.4493592
{txt}   corr(e.q_total_mg_id,e.pbid_dummy){c |}{col 38}{res}{space 2}-.6500444{col 50}{space 2} .0507721{col 78}{space 4}-.7387432{col 91}{space 3}-.5392122
{txt} corr(e.q_total_mg_id,e.diff_p_id_da){c |}{col 38}{res}{space 2} .0470705{col 50}{space 2} .0077772{col 78}{space 4} .0318177{col 91}{space 3} .0623013
{txt}                   sd(e.diff_p_id_da){c |}{col 38}{res}{space 2} 2.765228{col 50}{space 2} .0152406{col 78}{space 4} 2.735517{col 91}{space 3} 2.795261
{txt}                  sd(e.q_total_mg_id){c |}{col 38}{res}{space 2} .7849816{col 50}{space 2} .0043264{col 78}{space 4} .7765475{col 91}{space 3} .7935072
{txt}{hline 37}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test of exogeneity: chi2({res}2{txt}) = {res}4485.41{txt}{col 59}Prob > chi2 = {res}0.0000
{txt}{p 0 14 72}Instrumented: {res:diff_p_id_da q_total_mg_id}{p_end}
{p 0 14 72}{space 1}Instruments: {res:solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice _Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 afternoon weekend}{p_end}

{com}. outreg2 using 1st_step_results.doc, append ctitle(IV Probit PF) addstat("Chi2", e(chi2))
{txt}{stata `"shellout using `"1st_step_results.doc"'"':1st_step_results.doc}
{browse `"C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults"' :dir}{com} : {txt}{stata `"seeout using "1st_step_results.txt""':seeout}

{com}. *Average marginal effects (takes long to be executed!)
. margins, dydx(diff_p_id_da q_total_mg_id) pred(pr)
{res}
{txt}{col 1}Average marginal effects{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:16,460}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Average structural function probabilities, predict(pr)}{p_end}
{p2col:dy/dx wrt:}{res:diff_p_id_da q_total_mg_id}{p_end}
{p2colreset}{...}

{res}{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27} Delta-method
{col 15}{c |}      dy/dx{col 27}   std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}diff_p_id_da {c |}{col 15}{res}{space 2} .0904703{col 27}{space 2} .0164777{col 38}{space 1}    5.49{col 47}{space 3}0.000{col 55}{space 4} .0581747{col 68}{space 3} .1227659
{txt}q_total_mg_id {c |}{col 15}{res}{space 2} .2989101{col 27}{space 2} .0169201{col 38}{space 1}   17.67{col 47}{space 3}0.000{col 55}{space 4} .2657473{col 68}{space 3} .3320728
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. ***(4) IV Probit 1 Lag
. ivprobit pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend) $lag_controls $fe2
{res}
{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-8559.0953}  
Iteration 1:{space 3}log likelihood = {res:-5945.5622}  
Iteration 2:{space 3}log likelihood = {res:-5893.1697}  
Iteration 3:{space 3}log likelihood = {res: -5893.111}  
Iteration 4:{space 3}log likelihood = {res: -5893.111}  
{res}
{txt}Fitting full model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-66023.596}  
Iteration 1:{space 3}log likelihood = {res: -66023.57}  
Iteration 2:{space 3}log likelihood = {res: -66023.57}  

{col 1}Probit model with endogenous regressors{col 55}{lalign 13:Number of obs}{col 68} = {res}{ralign 8:16,446}
{txt}{col 55}{lalign 13:Wald chi2({res:28})}{col 68} = {res}{ralign 8:22994.86}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-66023.57}{txt}{col 55}{lalign 13:Prob > chi2}{col 68} = {res}{ralign 8:0.0000}

{txt}{hline 37}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 38}{c |} Coefficient{col 50}  Std. err.{col 62}      z{col 70}   P>|z|{col 78}     [95% con{col 91}f. interval]
{hline 37}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 24}diff_p_id_da {c |}{col 38}{res}{space 2} .3328571{col 50}{space 2} .0049719{col 61}{space 1}   66.95{col 70}{space 3}0.000{col 78}{space 4} .3231124{col 91}{space 3} .3426019
{txt}{space 23}q_total_mg_id {c |}{col 38}{res}{space 2} .2634845{col 50}{space 2} .0280681{col 61}{space 1}    9.39{col 70}{space 3}0.000{col 78}{space 4} .2084719{col 91}{space 3}  .318497
{txt}{space 21}lag_solar_share {c |}{col 38}{res}{space 2}-.0196858{col 50}{space 2} .0018313{col 61}{space 1}  -10.75{col 70}{space 3}0.000{col 78}{space 4}-.0232751{col 91}{space 3}-.0160965
{txt}{space 22}lag_wind_share {c |}{col 38}{res}{space 2}-.0149918{col 50}{space 2} .0013742{col 61}{space 1}  -10.91{col 70}{space 3}0.000{col 78}{space 4}-.0176852{col 91}{space 3}-.0122984
{txt}{space 21}lag_hydro_share {c |}{col 38}{res}{space 2}-.0169417{col 50}{space 2} .0026497{col 61}{space 1}   -6.39{col 70}{space 3}0.000{col 78}{space 4} -.022135{col 91}{space 3}-.0117484
{txt}{space 23}lag_gas_share {c |}{col 38}{res}{space 2}-.0093715{col 50}{space 2} .0021206{col 61}{space 1}   -4.42{col 70}{space 3}0.000{col 78}{space 4}-.0135278{col 91}{space 3}-.0052152
{txt}{space 22}lag_coal_share {c |}{col 38}{res}{space 2} .0118207{col 50}{space 2} .0030364{col 61}{space 1}    3.89{col 70}{space 3}0.000{col 78}{space 4} .0058694{col 91}{space 3}  .017772
{txt}{space 24}lag_load_ACT {c |}{col 38}{res}{space 2}  -.01325{col 50}{space 2} .0026965{col 61}{space 1}   -4.91{col 70}{space 3}0.000{col 78}{space 4}-.0185352{col 91}{space 3}-.0079649
{txt}{space 18}lag_solar_fc_error {c |}{col 38}{res}{space 2}-.0138096{col 50}{space 2} .0456045{col 61}{space 1}   -0.30{col 70}{space 3}0.762{col 78}{space 4}-.1031929{col 91}{space 3} .0755736
{txt}{space 19}lag_wind_fc_error {c |}{col 38}{res}{space 2}-.1877731{col 50}{space 2} .0942489{col 61}{space 1}   -1.99{col 70}{space 3}0.046{col 78}{space 4}-.3724976{col 91}{space 3}-.0030486
{txt}{space 19}lag_load_fc_error {c |}{col 38}{res}{space 2} 4.114244{col 50}{space 2} .4968978{col 61}{space 1}    8.28{col 70}{space 3}0.000{col 78}{space 4} 3.140343{col 91}{space 3} 5.088146
{txt}{space 24}lag_co2price {c |}{col 38}{res}{space 2} .0214398{col 50}{space 2} .0055877{col 61}{space 1}    3.84{col 70}{space 3}0.000{col 78}{space 4} .0104881{col 91}{space 3} .0323914
{txt}{space 24}lag_gasprice {c |}{col 38}{res}{space 2}-.0423571{col 50}{space 2}  .003474{col 61}{space 1}  -12.19{col 70}{space 3}0.000{col 78}{space 4}-.0491661{col 91}{space 3}-.0355482
{txt}{space 30}_Iyq_2 {c |}{col 38}{res}{space 2}-.0297625{col 50}{space 2} .0520472{col 61}{space 1}   -0.57{col 70}{space 3}0.567{col 78}{space 4}-.1317732{col 91}{space 3} .0722483
{txt}{space 30}_Iyq_3 {c |}{col 38}{res}{space 2} .2106004{col 50}{space 2} .0581234{col 61}{space 1}    3.62{col 70}{space 3}0.000{col 78}{space 4} .0966806{col 91}{space 3} .3245202
{txt}{space 30}_Iyq_4 {c |}{col 38}{res}{space 2}-.2043568{col 50}{space 2} .0608659{col 61}{space 1}   -3.36{col 70}{space 3}0.001{col 78}{space 4}-.3236518{col 91}{space 3}-.0850619
{txt}{space 30}_Iyq_5 {c |}{col 38}{res}{space 2}-.0050287{col 50}{space 2} .0578713{col 61}{space 1}   -0.09{col 70}{space 3}0.931{col 78}{space 4}-.1184543{col 91}{space 3}  .108397
{txt}{space 30}_Iyq_6 {c |}{col 38}{res}{space 2} .2286619{col 50}{space 2} .0740701{col 61}{space 1}    3.09{col 70}{space 3}0.002{col 78}{space 4} .0834872{col 91}{space 3} .3738366
{txt}{space 30}_Iyq_7 {c |}{col 38}{res}{space 2} .0446533{col 50}{space 2} .0936523{col 61}{space 1}    0.48{col 70}{space 3}0.634{col 78}{space 4}-.1389019{col 91}{space 3} .2282085
{txt}{space 30}_Iyq_8 {c |}{col 38}{res}{space 2} .2534197{col 50}{space 2} .1049954{col 61}{space 1}    2.41{col 70}{space 3}0.016{col 78}{space 4} .0476325{col 91}{space 3} .4592068
{txt}{space 30}_Iyq_9 {c |}{col 38}{res}{space 2} .0613011{col 50}{space 2} .1121255{col 61}{space 1}    0.55{col 70}{space 3}0.585{col 78}{space 4}-.1584608{col 91}{space 3}  .281063
{txt}{space 29}_Iyq_10 {c |}{col 38}{res}{space 2}-.2432553{col 50}{space 2} .1349552{col 61}{space 1}   -1.80{col 70}{space 3}0.071{col 78}{space 4}-.5077627{col 91}{space 3} .0212522
{txt}{space 29}_Iyq_11 {c |}{col 38}{res}{space 2}-.5324005{col 50}{space 2} .1543081{col 61}{space 1}   -3.45{col 70}{space 3}0.001{col 78}{space 4}-.8348387{col 91}{space 3}-.2299622
{txt}{space 29}_Iyq_12 {c |}{col 38}{res}{space 2}-.1742755{col 50}{space 2} .1381745{col 61}{space 1}   -1.26{col 70}{space 3}0.207{col 78}{space 4}-.4450925{col 91}{space 3} .0965416
{txt}{space 29}_Iyq_13 {c |}{col 38}{res}{space 2}-.4159064{col 50}{space 2} .1294189{col 61}{space 1}   -3.21{col 70}{space 3}0.001{col 78}{space 4}-.6695628{col 91}{space 3}  -.16225
{txt}{space 29}_Iyq_14 {c |}{col 38}{res}{space 2}-.3306808{col 50}{space 2} .1267818{col 61}{space 1}   -2.61{col 70}{space 3}0.009{col 78}{space 4}-.5791686{col 91}{space 3} -.082193
{txt}{space 29}_Iyq_15 {c |}{col 38}{res}{space 2}-.6697565{col 50}{space 2} .1655896{col 61}{space 1}   -4.04{col 70}{space 3}0.000{col 78}{space 4}-.9943062{col 91}{space 3}-.3452069
{txt}{space 29}_Iyq_16 {c |}{col 38}{res}{space 2}-.4835239{col 50}{space 2} .1652071{col 61}{space 1}   -2.93{col 70}{space 3}0.003{col 78}{space 4}-.8073238{col 91}{space 3} -.159724
{txt}{space 31}_cons {c |}{col 38}{res}{space 2} .3063962{col 50}{space 2} .1276003{col 61}{space 1}    2.40{col 70}{space 3}0.016{col 78}{space 4} .0563041{col 91}{space 3} .5564882
{txt}{hline 37}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    corr(e.diff_p_id_da,e.pbid_dummy){c |}{col 38}{res}{space 2}-.9363085{col 50}{space 2} .0117796{col 78}{space 4}-.9557599{col 91}{space 3}-.9087039
{txt}   corr(e.q_total_mg_id,e.pbid_dummy){c |}{col 38}{res}{space 2}-.2969284{col 50}{space 2} .0253365{col 78}{space 4}-.3457493{col 91}{space 3}-.2465043
{txt} corr(e.q_total_mg_id,e.diff_p_id_da){c |}{col 38}{res}{space 2} .0546216{col 50}{space 2} .0077745{col 78}{space 4} .0393723{col 91}{space 3} .0698454
{txt}                   sd(e.diff_p_id_da){c |}{col 38}{res}{space 2} 2.786463{col 50}{space 2} .0153641{col 78}{space 4} 2.756512{col 91}{space 3} 2.816739
{txt}                  sd(e.q_total_mg_id){c |}{col 38}{res}{space 2} .8147125{col 50}{space 2} .0044922{col 78}{space 4} .8059554{col 91}{space 3} .8235648
{txt}{hline 37}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test of exogeneity: chi2({res}2{txt}) = {res}3947.11{txt}{col 59}Prob > chi2 = {res}0.0000
{txt}{p 0 14 72}Instrumented: {res:diff_p_id_da q_total_mg_id}{p_end}
{p 0 14 72}{space 1}Instruments: {res:lag_solar_share lag_wind_share lag_hydro_share lag_gas_share lag_coal_share lag_load_ACT lag_solar_fc_error lag_wind_fc_error lag_load_fc_error lag_co2price lag_gasprice _Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 afternoon weekend}{p_end}

{com}. *outreg2 using 1st_step_results.doc, append ctitle(IV Probit 1 Lag)  addstat("Chi2", e(chi2))
. *Average marginal effects (takes long to be executed!)
. margins, dydx(diff_p_id_da q_total_mg_id) pred(pr)
{res}
{txt}{col 1}Average marginal effects{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:16,446}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Average structural function probabilities, predict(pr)}{p_end}
{p2col:dy/dx wrt:}{res:diff_p_id_da q_total_mg_id}{p_end}
{p2colreset}{...}

{res}{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27} Delta-method
{col 15}{c |}      dy/dx{col 27}   std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}diff_p_id_da {c |}{col 15}{res}{space 2} .2634309{col 27}{space 2} .0269608{col 38}{space 1}    9.77{col 47}{space 3}0.000{col 55}{space 4} .2105888{col 68}{space 3} .3162731
{txt}q_total_mg_id {c |}{col 15}{res}{space 2} .2085278{col 27}{space 2}  .016577{col 38}{space 1}   12.58{col 47}{space 3}0.000{col 55}{space 4} .1760374{col 68}{space 3} .2410182
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. ***Durbin-Wu-Hausman test 
. reg diff_p_id_da weekend afternoon solar_share wind_share hydro_share load_ACT solar_fc_error wind_fc_error load_fc_error gas_share coal_share co2price gasprice $fe, robust
{txt}{p 0 6 2}note: {bf:_Ihour_21} omitted because of collinearity.{p_end}

Linear regression                               Number of obs     = {res}    16,460
                                                {txt}F(40, 16419)      =  {res}    27.48
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0848
                                                {txt}Root MSE          =    {res} 2.7642

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}  diff_p_id_da{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}weekend {c |}{col 16}{res}{space 2} .6378754{col 28}{space 2}  .076712{col 39}{space 1}    8.32{col 48}{space 3}0.000{col 56}{space 4} .4875115{col 69}{space 3} .7882393
{txt}{space 5}afternoon {c |}{col 16}{res}{space 2} .4423228{col 28}{space 2} .1762195{col 39}{space 1}    2.51{col 48}{space 3}0.012{col 56}{space 4} .0969135{col 69}{space 3} .7877321
{txt}{space 3}solar_share {c |}{col 16}{res}{space 2} .0396729{col 28}{space 2} .0068814{col 39}{space 1}    5.77{col 48}{space 3}0.000{col 56}{space 4} .0261845{col 69}{space 3} .0531612
{txt}{space 4}wind_share {c |}{col 16}{res}{space 2}  .037254{col 28}{space 2} .0042804{col 39}{space 1}    8.70{col 48}{space 3}0.000{col 56}{space 4} .0288639{col 69}{space 3}  .045644
{txt}{space 3}hydro_share {c |}{col 16}{res}{space 2} .0954234{col 28}{space 2} .0075738{col 39}{space 1}   12.60{col 48}{space 3}0.000{col 56}{space 4}  .080578{col 69}{space 3} .1102688
{txt}{space 6}load_ACT {c |}{col 16}{res}{space 2} .0452185{col 28}{space 2} .0103862{col 39}{space 1}    4.35{col 48}{space 3}0.000{col 56}{space 4} .0248605{col 69}{space 3} .0655765
{txt}solar_fc_error {c |}{col 16}{res}{space 2}-.0789775{col 28}{space 2} .1365811{col 39}{space 1}   -0.58{col 48}{space 3}0.563{col 56}{space 4}-.3466912{col 69}{space 3} .1887362
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2}  2.52996{col 28}{space 2} .2237669{col 39}{space 1}   11.31{col 48}{space 3}0.000{col 56}{space 4} 2.091353{col 69}{space 3} 2.968568
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2} -3.73361{col 28}{space 2} 1.656152{col 39}{space 1}   -2.25{col 48}{space 3}0.024{col 56}{space 4}-6.979847{col 69}{space 3}-.4873727
{txt}{space 5}gas_share {c |}{col 16}{res}{space 2} .0233992{col 28}{space 2} .0064631{col 39}{space 1}    3.62{col 48}{space 3}0.000{col 56}{space 4} .0107307{col 69}{space 3} .0360676
{txt}{space 4}coal_share {c |}{col 16}{res}{space 2}-.0332628{col 28}{space 2} .0079775{col 39}{space 1}   -4.17{col 48}{space 3}0.000{col 56}{space 4}-.0488996{col 69}{space 3} -.017626
{txt}{space 6}co2price {c |}{col 16}{res}{space 2}-.0183964{col 28}{space 2} .0134156{col 39}{space 1}   -1.37{col 48}{space 3}0.170{col 56}{space 4}-.0446924{col 69}{space 3} .0078995
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2} .1084024{col 28}{space 2} .0113903{col 39}{space 1}    9.52{col 48}{space 3}0.000{col 56}{space 4} .0860762{col 69}{space 3} .1307286
{txt}{space 8}_Iyq_2 {c |}{col 16}{res}{space 2} .1877505{col 28}{space 2} .1599946{col 39}{space 1}    1.17{col 48}{space 3}0.241{col 56}{space 4}-.1258563{col 69}{space 3} .5013574
{txt}{space 8}_Iyq_3 {c |}{col 16}{res}{space 2}-.4861394{col 28}{space 2}  .168192{col 39}{space 1}   -2.89{col 48}{space 3}0.004{col 56}{space 4} -.815814{col 69}{space 3}-.1564647
{txt}{space 8}_Iyq_4 {c |}{col 16}{res}{space 2} .2713491{col 28}{space 2} .1929421{col 39}{space 1}    1.41{col 48}{space 3}0.160{col 56}{space 4}-.1068383{col 69}{space 3} .6495365
{txt}{space 8}_Iyq_5 {c |}{col 16}{res}{space 2}-.6048999{col 28}{space 2} .1822923{col 39}{space 1}   -3.32{col 48}{space 3}0.001{col 56}{space 4}-.9622126{col 69}{space 3}-.2475872
{txt}{space 8}_Iyq_6 {c |}{col 16}{res}{space 2}-1.573201{col 28}{space 2} .2114496{col 39}{space 1}   -7.44{col 48}{space 3}0.000{col 56}{space 4}-1.987665{col 69}{space 3}-1.158737
{txt}{space 8}_Iyq_7 {c |}{col 16}{res}{space 2} -1.20992{col 28}{space 2} .2213866{col 39}{space 1}   -5.47{col 48}{space 3}0.000{col 56}{space 4}-1.643862{col 69}{space 3}-.7759781
{txt}{space 8}_Iyq_8 {c |}{col 16}{res}{space 2}-1.813174{col 28}{space 2}  .252628{col 39}{space 1}   -7.18{col 48}{space 3}0.000{col 56}{space 4}-2.308352{col 69}{space 3}-1.317995
{txt}{space 8}_Iyq_9 {c |}{col 16}{res}{space 2}-1.131642{col 28}{space 2} .2822576{col 39}{space 1}   -4.01{col 48}{space 3}0.000{col 56}{space 4}-1.684898{col 69}{space 3}-.5783866
{txt}{space 7}_Iyq_10 {c |}{col 16}{res}{space 2}-.0990069{col 28}{space 2} .3578834{col 39}{space 1}   -0.28{col 48}{space 3}0.782{col 56}{space 4}-.8004971{col 69}{space 3} .6024833
{txt}{space 7}_Iyq_11 {c |}{col 16}{res}{space 2}  .343639{col 28}{space 2}  .390715{col 39}{space 1}    0.88{col 48}{space 3}0.379{col 56}{space 4}-.4222047{col 69}{space 3} 1.109483
{txt}{space 7}_Iyq_12 {c |}{col 16}{res}{space 2}-.6478954{col 28}{space 2} .3713575{col 39}{space 1}   -1.74{col 48}{space 3}0.081{col 56}{space 4}-1.375796{col 69}{space 3} .0800056
{txt}{space 7}_Iyq_13 {c |}{col 16}{res}{space 2} -.104224{col 28}{space 2} .3446128{col 39}{space 1}   -0.30{col 48}{space 3}0.762{col 56}{space 4}-.7797024{col 69}{space 3} .5712544
{txt}{space 7}_Iyq_14 {c |}{col 16}{res}{space 2} .3141862{col 28}{space 2} .3618808{col 39}{space 1}    0.87{col 48}{space 3}0.385{col 56}{space 4}-.3951393{col 69}{space 3} 1.023512
{txt}{space 7}_Iyq_15 {c |}{col 16}{res}{space 2} .1053787{col 28}{space 2}  .410133{col 39}{space 1}    0.26{col 48}{space 3}0.797{col 56}{space 4}-.6985266{col 69}{space 3}  .909284
{txt}{space 7}_Iyq_16 {c |}{col 16}{res}{space 2}-1.231662{col 28}{space 2} .3805956{col 39}{space 1}   -3.24{col 48}{space 3}0.001{col 56}{space 4}-1.977671{col 69}{space 3}-.4856531
{txt}{space 6}_Ihour_9 {c |}{col 16}{res}{space 2} .0402292{col 28}{space 2} .1445412{col 39}{space 1}    0.28{col 48}{space 3}0.781{col 56}{space 4}-.2430873{col 69}{space 3} .3235457
{txt}{space 5}_Ihour_10 {c |}{col 16}{res}{space 2}-.2137462{col 28}{space 2} .1561696{col 39}{space 1}   -1.37{col 48}{space 3}0.171{col 56}{space 4}-.5198555{col 69}{space 3} .0923632
{txt}{space 5}_Ihour_11 {c |}{col 16}{res}{space 2}-.2596518{col 28}{space 2}  .168769{col 39}{space 1}   -1.54{col 48}{space 3}0.124{col 56}{space 4}-.5904575{col 69}{space 3} .0711538
{txt}{space 5}_Ihour_12 {c |}{col 16}{res}{space 2} .0120215{col 28}{space 2} .1781252{col 39}{space 1}    0.07{col 48}{space 3}0.946{col 56}{space 4}-.3371232{col 69}{space 3} .3611662
{txt}{space 5}_Ihour_13 {c |}{col 16}{res}{space 2}-.2930806{col 28}{space 2} .1578488{col 39}{space 1}   -1.86{col 48}{space 3}0.063{col 56}{space 4}-.6024813{col 69}{space 3} .0163201
{txt}{space 5}_Ihour_14 {c |}{col 16}{res}{space 2}-.2624292{col 28}{space 2} .1595132{col 39}{space 1}   -1.65{col 48}{space 3}0.100{col 56}{space 4}-.5750923{col 69}{space 3}  .050234
{txt}{space 5}_Ihour_15 {c |}{col 16}{res}{space 2}-.1857249{col 28}{space 2} .1604089{col 39}{space 1}   -1.16{col 48}{space 3}0.247{col 56}{space 4}-.5001437{col 69}{space 3}  .128694
{txt}{space 5}_Ihour_16 {c |}{col 16}{res}{space 2} .2162459{col 28}{space 2} .1637199{col 39}{space 1}    1.32{col 48}{space 3}0.187{col 56}{space 4}-.1046629{col 69}{space 3} .5371547
{txt}{space 5}_Ihour_17 {c |}{col 16}{res}{space 2} .1439592{col 28}{space 2} .1587488{col 39}{space 1}    0.91{col 48}{space 3}0.365{col 56}{space 4}-.1672057{col 69}{space 3} .4551241
{txt}{space 5}_Ihour_18 {c |}{col 16}{res}{space 2}-.0356522{col 28}{space 2} .1524858{col 39}{space 1}   -0.23{col 48}{space 3}0.815{col 56}{space 4} -.334541{col 69}{space 3} .2632365
{txt}{space 5}_Ihour_19 {c |}{col 16}{res}{space 2}-.1004011{col 28}{space 2} .1513894{col 39}{space 1}   -0.66{col 48}{space 3}0.507{col 56}{space 4}-.3971408{col 69}{space 3} .1963385
{txt}{space 5}_Ihour_20 {c |}{col 16}{res}{space 2}-.2187127{col 28}{space 2} .1490984{col 39}{space 1}   -1.47{col 48}{space 3}0.142{col 56}{space 4}-.5109617{col 69}{space 3} .0735363
{txt}{space 5}_Ihour_21 {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 9}_cons {c |}{col 16}{res}{space 2}-3.725985{col 28}{space 2} .4138816{col 39}{space 1}   -9.00{col 48}{space 3}0.000{col 56}{space 4}-4.537238{col 69}{space 3}-2.914732
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict uhat, residuals
{txt}(1 missing value generated)

{com}. 
. reg q_total_mg_id weekend afternoon solar_share wind_share hydro_share load_ACT solar_fc_error wind_fc_error load_fc_error gas_share coal_share co2price gasprice $fe, robust
{txt}{p 0 6 2}note: {bf:_Ihour_21} omitted because of collinearity.{p_end}

Linear regression                               Number of obs     = {res}    16,460
                                                {txt}F(40, 16419)      =  {res}   311.26
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4402
                                                {txt}Root MSE          =    {res} .76926

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1} q_total_mg_id{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}weekend {c |}{col 16}{res}{space 2}-.2766839{col 28}{space 2} .0202646{col 39}{space 1}  -13.65{col 48}{space 3}0.000{col 56}{space 4}-.3164046{col 69}{space 3}-.2369631
{txt}{space 5}afternoon {c |}{col 16}{res}{space 2} .8590232{col 28}{space 2} .0484192{col 39}{space 1}   17.74{col 48}{space 3}0.000{col 56}{space 4} .7641163{col 69}{space 3}   .95393
{txt}{space 3}solar_share {c |}{col 16}{res}{space 2}-.0278023{col 28}{space 2} .0016943{col 39}{space 1}  -16.41{col 48}{space 3}0.000{col 56}{space 4}-.0311232{col 69}{space 3}-.0244814
{txt}{space 4}wind_share {c |}{col 16}{res}{space 2} .0189668{col 28}{space 2} .0009582{col 39}{space 1}   19.79{col 48}{space 3}0.000{col 56}{space 4} .0170886{col 69}{space 3} .0208449
{txt}{space 3}hydro_share {c |}{col 16}{res}{space 2} .0315529{col 28}{space 2} .0022416{col 39}{space 1}   14.08{col 48}{space 3}0.000{col 56}{space 4} .0271591{col 69}{space 3} .0359468
{txt}{space 6}load_ACT {c |}{col 16}{res}{space 2} .0572392{col 28}{space 2} .0030177{col 39}{space 1}   18.97{col 48}{space 3}0.000{col 56}{space 4} .0513243{col 69}{space 3} .0631542
{txt}solar_fc_error {c |}{col 16}{res}{space 2}-.0226183{col 28}{space 2} .0315706{col 39}{space 1}   -0.72{col 48}{space 3}0.474{col 56}{space 4}-.0845001{col 69}{space 3} .0392635
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2}  .178993{col 28}{space 2} .0742886{col 39}{space 1}    2.41{col 48}{space 3}0.016{col 56}{space 4} .0333793{col 69}{space 3} .3246067
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2} 4.466653{col 28}{space 2} .3522942{col 39}{space 1}   12.68{col 48}{space 3}0.000{col 56}{space 4} 3.776118{col 69}{space 3} 5.157187
{txt}{space 5}gas_share {c |}{col 16}{res}{space 2} .0367984{col 28}{space 2} .0018058{col 39}{space 1}   20.38{col 48}{space 3}0.000{col 56}{space 4} .0332588{col 69}{space 3}  .040338
{txt}{space 4}coal_share {c |}{col 16}{res}{space 2} .0260713{col 28}{space 2} .0023317{col 39}{space 1}   11.18{col 48}{space 3}0.000{col 56}{space 4}  .021501{col 69}{space 3} .0306417
{txt}{space 6}co2price {c |}{col 16}{res}{space 2} .0078834{col 28}{space 2} .0040202{col 39}{space 1}    1.96{col 48}{space 3}0.050{col 56}{space 4} 3.26e-06{col 69}{space 3} .0157635
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2}-.0233616{col 28}{space 2} .0027151{col 39}{space 1}   -8.60{col 48}{space 3}0.000{col 56}{space 4}-.0286835{col 69}{space 3}-.0180396
{txt}{space 8}_Iyq_2 {c |}{col 16}{res}{space 2}-.0215065{col 28}{space 2} .0335496{col 39}{space 1}   -0.64{col 48}{space 3}0.522{col 56}{space 4}-.0872674{col 69}{space 3} .0442545
{txt}{space 8}_Iyq_3 {c |}{col 16}{res}{space 2}-.1113432{col 28}{space 2} .0369298{col 39}{space 1}   -3.01{col 48}{space 3}0.003{col 56}{space 4}-.1837297{col 69}{space 3}-.0389567
{txt}{space 8}_Iyq_4 {c |}{col 16}{res}{space 2} .2056477{col 28}{space 2} .0422007{col 39}{space 1}    4.87{col 48}{space 3}0.000{col 56}{space 4} .1229298{col 69}{space 3} .2883657
{txt}{space 8}_Iyq_5 {c |}{col 16}{res}{space 2}-.2040487{col 28}{space 2} .0399047{col 39}{space 1}   -5.11{col 48}{space 3}0.000{col 56}{space 4}-.2822662{col 69}{space 3}-.1258312
{txt}{space 8}_Iyq_6 {c |}{col 16}{res}{space 2} .1452649{col 28}{space 2} .0593317{col 39}{space 1}    2.45{col 48}{space 3}0.014{col 56}{space 4} .0289684{col 69}{space 3} .2615615
{txt}{space 8}_Iyq_7 {c |}{col 16}{res}{space 2} .7862174{col 28}{space 2} .0645543{col 39}{space 1}   12.18{col 48}{space 3}0.000{col 56}{space 4}  .659684{col 69}{space 3} .9127509
{txt}{space 8}_Iyq_8 {c |}{col 16}{res}{space 2} .3182739{col 28}{space 2} .0696465{col 39}{space 1}    4.57{col 48}{space 3}0.000{col 56}{space 4} .1817591{col 69}{space 3} .4547887
{txt}{space 8}_Iyq_9 {c |}{col 16}{res}{space 2}-.1045622{col 28}{space 2} .0729543{col 39}{space 1}   -1.43{col 48}{space 3}0.152{col 56}{space 4}-.2475606{col 69}{space 3} .0384362
{txt}{space 7}_Iyq_10 {c |}{col 16}{res}{space 2}-.2092734{col 28}{space 2} .0924036{col 39}{space 1}   -2.26{col 48}{space 3}0.024{col 56}{space 4}-.3903945{col 69}{space 3}-.0281524
{txt}{space 7}_Iyq_11 {c |}{col 16}{res}{space 2}-.9530824{col 28}{space 2} .0999578{col 39}{space 1}   -9.53{col 48}{space 3}0.000{col 56}{space 4} -1.14901{col 69}{space 3}-.7571543
{txt}{space 7}_Iyq_12 {c |}{col 16}{res}{space 2}-.9350702{col 28}{space 2} .0923607{col 39}{space 1}  -10.12{col 48}{space 3}0.000{col 56}{space 4}-1.116107{col 69}{space 3}-.7540332
{txt}{space 7}_Iyq_13 {c |}{col 16}{res}{space 2}  -.82128{col 28}{space 2} .0901181{col 39}{space 1}   -9.11{col 48}{space 3}0.000{col 56}{space 4}-.9979212{col 69}{space 3}-.6446387
{txt}{space 7}_Iyq_14 {c |}{col 16}{res}{space 2}-.4944467{col 28}{space 2} .0941623{col 39}{space 1}   -5.25{col 48}{space 3}0.000{col 56}{space 4}-.6790149{col 69}{space 3}-.3098785
{txt}{space 7}_Iyq_15 {c |}{col 16}{res}{space 2}-.8533914{col 28}{space 2} .1055703{col 39}{space 1}   -8.08{col 48}{space 3}0.000{col 56}{space 4}-1.060321{col 69}{space 3}-.6464622
{txt}{space 7}_Iyq_16 {c |}{col 16}{res}{space 2}-.5880579{col 28}{space 2} .0982172{col 39}{space 1}   -5.99{col 48}{space 3}0.000{col 56}{space 4}-.7805743{col 69}{space 3}-.3955416
{txt}{space 6}_Ihour_9 {c |}{col 16}{res}{space 2} .1620109{col 28}{space 2}  .036888{col 39}{space 1}    4.39{col 48}{space 3}0.000{col 56}{space 4} .0897064{col 69}{space 3} .2343154
{txt}{space 5}_Ihour_10 {c |}{col 16}{res}{space 2} .3487377{col 28}{space 2} .0399276{col 39}{space 1}    8.73{col 48}{space 3}0.000{col 56}{space 4} .2704753{col 69}{space 3} .4270001
{txt}{space 5}_Ihour_11 {c |}{col 16}{res}{space 2} .4683251{col 28}{space 2} .0433502{col 39}{space 1}   10.80{col 48}{space 3}0.000{col 56}{space 4}  .383354{col 69}{space 3} .5532963
{txt}{space 5}_Ihour_12 {c |}{col 16}{res}{space 2} .8273802{col 28}{space 2} .0462235{col 39}{space 1}   17.90{col 48}{space 3}0.000{col 56}{space 4} .7367771{col 69}{space 3} .9179834
{txt}{space 5}_Ihour_13 {c |}{col 16}{res}{space 2}  .120138{col 28}{space 2} .0468031{col 39}{space 1}    2.57{col 48}{space 3}0.010{col 56}{space 4} .0283988{col 69}{space 3} .2118771
{txt}{space 5}_Ihour_14 {c |}{col 16}{res}{space 2} .1114596{col 28}{space 2} .0469143{col 39}{space 1}    2.38{col 48}{space 3}0.018{col 56}{space 4} .0195025{col 69}{space 3} .2034167
{txt}{space 5}_Ihour_15 {c |}{col 16}{res}{space 2} .0554944{col 28}{space 2} .0465045{col 39}{space 1}    1.19{col 48}{space 3}0.233{col 56}{space 4}-.0356595{col 69}{space 3} .1466482
{txt}{space 5}_Ihour_16 {c |}{col 16}{res}{space 2} .3821381{col 28}{space 2} .0464325{col 39}{space 1}    8.23{col 48}{space 3}0.000{col 56}{space 4} .2911255{col 69}{space 3} .4731508
{txt}{space 5}_Ihour_17 {c |}{col 16}{res}{space 2} .3113683{col 28}{space 2} .0455164{col 39}{space 1}    6.84{col 48}{space 3}0.000{col 56}{space 4} .2221513{col 69}{space 3} .4005854
{txt}{space 5}_Ihour_18 {c |}{col 16}{res}{space 2} .2655624{col 28}{space 2} .0450241{col 39}{space 1}    5.90{col 48}{space 3}0.000{col 56}{space 4} .1773103{col 69}{space 3} .3538146
{txt}{space 5}_Ihour_19 {c |}{col 16}{res}{space 2}  .244626{col 28}{space 2} .0456614{col 39}{space 1}    5.36{col 48}{space 3}0.000{col 56}{space 4} .1551247{col 69}{space 3} .3341272
{txt}{space 5}_Ihour_20 {c |}{col 16}{res}{space 2} .1336312{col 28}{space 2}  .047295{col 39}{space 1}    2.83{col 48}{space 3}0.005{col 56}{space 4} .0409279{col 69}{space 3} .2263346
{txt}{space 5}_Ihour_21 {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 9}_cons {c |}{col 16}{res}{space 2} .7122247{col 28}{space 2} .1013887{col 39}{space 1}    7.02{col 48}{space 3}0.000{col 56}{space 4} .5134919{col 69}{space 3} .9109575
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict uhat2, residuals
{txt}(1 missing value generated)

{com}. 
. reg pbid_dummy diff_p_id_da q_total_mg_id solar_share wind_share hydro_share load_ACT solar_fc_error wind_fc_error load_fc_error gas_share coal_share co2price gasprice uhat uhat2 $fe, robust
{txt}{p 0 6 2}note: {bf:load_fc_error} omitted because of collinearity.{p_end}

Linear regression                               Number of obs     = {res}    16,460
                                                {txt}F(42, 16417)      =  {res}   352.56
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5365
                                                {txt}Root MSE          =    {res} .28024

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}    pbid_dummy{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}diff_p_id_da {c |}{col 16}{res}{space 2}-.0223087{col 28}{space 2} .0312327{col 39}{space 1}   -0.71{col 48}{space 3}0.475{col 56}{space 4}-.0835282{col 69}{space 3} .0389108
{txt}{space 1}q_total_mg_id {c |}{col 16}{res}{space 2}-.1526148{col 28}{space 2} .0593238{col 39}{space 1}   -2.57{col 48}{space 3}0.010{col 56}{space 4}-.2688959{col 69}{space 3}-.0363337
{txt}{space 3}solar_share {c |}{col 16}{res}{space 2}-.0008045{col 28}{space 2} .0009302{col 39}{space 1}   -0.86{col 48}{space 3}0.387{col 56}{space 4}-.0026277{col 69}{space 3} .0010188
{txt}{space 4}wind_share {c |}{col 16}{res}{space 2} .0037793{col 28}{space 2} .0022882{col 39}{space 1}    1.65{col 48}{space 3}0.099{col 56}{space 4}-.0007058{col 69}{space 3} .0082645
{txt}{space 3}hydro_share {c |}{col 16}{res}{space 2} .0045892{col 28}{space 2} .0048387{col 39}{space 1}    0.95{col 48}{space 3}0.343{col 56}{space 4}-.0048951{col 69}{space 3} .0140735
{txt}{space 6}load_ACT {c |}{col 16}{res}{space 2} .0290615{col 28}{space 2} .0045878{col 39}{space 1}    6.33{col 48}{space 3}0.000{col 56}{space 4} .0200689{col 69}{space 3}  .038054
{txt}solar_fc_error {c |}{col 16}{res}{space 2} -.049546{col 28}{space 2}  .013192{col 39}{space 1}   -3.76{col 48}{space 3}0.000{col 56}{space 4}-.0754038{col 69}{space 3}-.0236883
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2}-.0114641{col 28}{space 2}  .092757{col 39}{space 1}   -0.12{col 48}{space 3}0.902{col 56}{space 4}-.1932779{col 69}{space 3} .1703497
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 5}gas_share {c |}{col 16}{res}{space 2} .0053301{col 28}{space 2} .0029318{col 39}{space 1}    1.82{col 48}{space 3}0.069{col 56}{space 4}-.0004166{col 69}{space 3} .0110768
{txt}{space 4}coal_share {c |}{col 16}{res}{space 2}  .005794{col 28}{space 2} .0011241{col 39}{space 1}    5.15{col 48}{space 3}0.000{col 56}{space 4} .0035906{col 69}{space 3} .0079973
{txt}{space 6}co2price {c |}{col 16}{res}{space 2} .0183344{col 28}{space 2} .0016505{col 39}{space 1}   11.11{col 48}{space 3}0.000{col 56}{space 4} .0150993{col 69}{space 3} .0215695
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2}-.0076005{col 28}{space 2} .0023374{col 39}{space 1}   -3.25{col 48}{space 3}0.001{col 56}{space 4}-.0121821{col 69}{space 3} -.003019
{txt}{space 10}uhat {c |}{col 16}{res}{space 2} .0244685{col 28}{space 2} .0312293{col 39}{space 1}    0.78{col 48}{space 3}0.433{col 56}{space 4}-.0367443{col 69}{space 3} .0856813
{txt}{space 9}uhat2 {c |}{col 16}{res}{space 2} .1513284{col 28}{space 2}  .059352{col 39}{space 1}    2.55{col 48}{space 3}0.011{col 56}{space 4}  .034992{col 69}{space 3} .2676647
{txt}{space 8}_Iyq_2 {c |}{col 16}{res}{space 2}-.0511245{col 28}{space 2} .0102654{col 39}{space 1}   -4.98{col 48}{space 3}0.000{col 56}{space 4}-.0712457{col 69}{space 3}-.0310032
{txt}{space 8}_Iyq_3 {c |}{col 16}{res}{space 2} -.119235{col 28}{space 2} .0244318{col 39}{space 1}   -4.88{col 48}{space 3}0.000{col 56}{space 4} -.167124{col 69}{space 3}-.0713461
{txt}{space 8}_Iyq_4 {c |}{col 16}{res}{space 2}-.0285998{col 28}{space 2} .0234991{col 39}{space 1}   -1.22{col 48}{space 3}0.224{col 56}{space 4}-.0746607{col 69}{space 3}  .017461
{txt}{space 8}_Iyq_5 {c |}{col 16}{res}{space 2}-.1823172{col 28}{space 2} .0323397{col 39}{space 1}   -5.64{col 48}{space 3}0.000{col 56}{space 4}-.2457064{col 69}{space 3}-.1189279
{txt}{space 8}_Iyq_6 {c |}{col 16}{res}{space 2}-.1252713{col 28}{space 2} .0454861{col 39}{space 1}   -2.75{col 48}{space 3}0.006{col 56}{space 4}-.2144289{col 69}{space 3}-.0361137
{txt}{space 8}_Iyq_7 {c |}{col 16}{res}{space 2}-.1364109{col 28}{space 2} .0305865{col 39}{space 1}   -4.46{col 48}{space 3}0.000{col 56}{space 4}-.1963637{col 69}{space 3}-.0764582
{txt}{space 8}_Iyq_8 {c |}{col 16}{res}{space 2}-.2073982{col 28}{space 2} .0487679{col 39}{space 1}   -4.25{col 48}{space 3}0.000{col 56}{space 4}-.3029886{col 69}{space 3}-.1118078
{txt}{space 8}_Iyq_9 {c |}{col 16}{res}{space 2}-.3743379{col 28}{space 2} .0488149{col 39}{space 1}   -7.67{col 48}{space 3}0.000{col 56}{space 4}-.4700204{col 69}{space 3}-.2786555
{txt}{space 7}_Iyq_10 {c |}{col 16}{res}{space 2}-.3965499{col 28}{space 2} .0377918{col 39}{space 1}  -10.49{col 48}{space 3}0.000{col 56}{space 4} -.470626{col 69}{space 3}-.3224738
{txt}{space 7}_Iyq_11 {c |}{col 16}{res}{space 2}-.8020658{col 28}{space 2} .0595944{col 39}{space 1}  -13.46{col 48}{space 3}0.000{col 56}{space 4}-.9188772{col 69}{space 3}-.6852544
{txt}{space 7}_Iyq_12 {c |}{col 16}{res}{space 2}-.5865354{col 28}{space 2} .0807715{col 39}{space 1}   -7.26{col 48}{space 3}0.000{col 56}{space 4}-.7448564{col 69}{space 3}-.4282144
{txt}{space 7}_Iyq_13 {c |}{col 16}{res}{space 2}-.6496244{col 28}{space 2} .0604807{col 39}{space 1}  -10.74{col 48}{space 3}0.000{col 56}{space 4}-.7681731{col 69}{space 3}-.5310757
{txt}{space 7}_Iyq_14 {c |}{col 16}{res}{space 2}-.4415277{col 28}{space 2} .0409475{col 39}{space 1}  -10.78{col 48}{space 3}0.000{col 56}{space 4}-.5217891{col 69}{space 3}-.3612662
{txt}{space 7}_Iyq_15 {c |}{col 16}{res}{space 2}-1.134378{col 28}{space 2} .0619579{col 39}{space 1}  -18.31{col 48}{space 3}0.000{col 56}{space 4}-1.255822{col 69}{space 3}-1.012934
{txt}{space 7}_Iyq_16 {c |}{col 16}{res}{space 2}-1.216433{col 28}{space 2} .0802831{col 39}{space 1}  -15.15{col 48}{space 3}0.000{col 56}{space 4}-1.373797{col 69}{space 3} -1.05907
{txt}{space 6}_Ihour_9 {c |}{col 16}{res}{space 2}-.0297575{col 28}{space 2} .0191385{col 39}{space 1}   -1.55{col 48}{space 3}0.120{col 56}{space 4} -.067271{col 69}{space 3}  .007756
{txt}{space 5}_Ihour_10 {c |}{col 16}{res}{space 2}-.0422628{col 28}{space 2} .0218259{col 39}{space 1}   -1.94{col 48}{space 3}0.053{col 56}{space 4}-.0850439{col 69}{space 3} .0005184
{txt}{space 5}_Ihour_11 {c |}{col 16}{res}{space 2}-.0578306{col 28}{space 2} .0265235{col 39}{space 1}   -2.18{col 48}{space 3}0.029{col 56}{space 4}-.1098195{col 69}{space 3}-.0058417
{txt}{space 5}_Ihour_12 {c |}{col 16}{res}{space 2}-.7990408{col 28}{space 2} .0526907{col 39}{space 1}  -15.16{col 48}{space 3}0.000{col 56}{space 4}-.9023203{col 69}{space 3}-.6957613
{txt}{space 5}_Ihour_13 {c |}{col 16}{res}{space 2} .0031584{col 28}{space 2} .0648735{col 39}{space 1}    0.05{col 48}{space 3}0.961{col 56}{space 4}-.1240008{col 69}{space 3} .1303176
{txt}{space 5}_Ihour_14 {c |}{col 16}{res}{space 2}-.0041052{col 28}{space 2} .0653852{col 39}{space 1}   -0.06{col 48}{space 3}0.950{col 56}{space 4}-.1322673{col 69}{space 3} .1240569
{txt}{space 5}_Ihour_15 {c |}{col 16}{res}{space 2} .0007755{col 28}{space 2} .0641683{col 39}{space 1}    0.01{col 48}{space 3}0.990{col 56}{space 4}-.1250013{col 69}{space 3} .1265523
{txt}{space 5}_Ihour_16 {c |}{col 16}{res}{space 2} .0756482{col 28}{space 2} .0943665{col 39}{space 1}    0.80{col 48}{space 3}0.423{col 56}{space 4}-.1093204{col 69}{space 3} .2606168
{txt}{space 5}_Ihour_17 {c |}{col 16}{res}{space 2} .0747144{col 28}{space 2} .0880366{col 39}{space 1}    0.85{col 48}{space 3}0.396{col 56}{space 4}-.0978468{col 69}{space 3} .2472756
{txt}{space 5}_Ihour_18 {c |}{col 16}{res}{space 2} .0694986{col 28}{space 2} .0801595{col 39}{space 1}    0.87{col 48}{space 3}0.386{col 56}{space 4}-.0876228{col 69}{space 3}   .22662
{txt}{space 5}_Ihour_19 {c |}{col 16}{res}{space 2} .0757857{col 28}{space 2} .0772577{col 39}{space 1}    0.98{col 48}{space 3}0.327{col 56}{space 4}-.0756478{col 69}{space 3} .2272193
{txt}{space 5}_Ihour_20 {c |}{col 16}{res}{space 2} .0602871{col 28}{space 2}  .067761{col 39}{space 1}    0.89{col 48}{space 3}0.374{col 56}{space 4}-.0725318{col 69}{space 3}  .193106
{txt}{space 5}_Ihour_21 {c |}{col 16}{res}{space 2} .0455391{col 28}{space 2} .0673354{col 39}{space 1}    0.68{col 48}{space 3}0.499{col 56}{space 4}-.0864457{col 69}{space 3} .1775238
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .5427424{col 28}{space 2} .0720565{col 39}{space 1}    7.53{col 48}{space 3}0.000{col 56}{space 4} .4015039{col 69}{space 3} .6839809
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. *-> both uhat's betas are significant
. 
. *********Appendix
. *****First stage regressions
. ***(1) IV PF
. reg diff_p_id_da afternoon weekend solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe2, robust 

{txt}Linear regression                               Number of obs     = {res}    16,460
                                                {txt}F(28, 16431)      =  {res}    38.19
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0819
                                                {txt}Root MSE          =    {res} 2.7677

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}  diff_p_id_da{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}afternoon {c |}{col 16}{res}{space 2} .4636735{col 28}{space 2} .0506798{col 39}{space 1}    9.15{col 48}{space 3}0.000{col 56}{space 4} .3643356{col 69}{space 3} .5630115
{txt}{space 7}weekend {c |}{col 16}{res}{space 2} .5676483{col 28}{space 2} .0745078{col 39}{space 1}    7.62{col 48}{space 3}0.000{col 56}{space 4}  .421605{col 69}{space 3} .7136916
{txt}{space 3}solar_share {c |}{col 16}{res}{space 2} .0401038{col 28}{space 2} .0055095{col 39}{space 1}    7.28{col 48}{space 3}0.000{col 56}{space 4} .0293047{col 69}{space 3}  .050903
{txt}{space 4}wind_share {c |}{col 16}{res}{space 2} .0396415{col 28}{space 2} .0042472{col 39}{space 1}    9.33{col 48}{space 3}0.000{col 56}{space 4} .0313166{col 69}{space 3} .0479665
{txt}{space 3}hydro_share {c |}{col 16}{res}{space 2} .0939013{col 28}{space 2} .0075057{col 39}{space 1}   12.51{col 48}{space 3}0.000{col 56}{space 4} .0791892{col 69}{space 3} .1086134
{txt}{space 5}gas_share {c |}{col 16}{res}{space 2} .0269357{col 28}{space 2} .0063825{col 39}{space 1}    4.22{col 48}{space 3}0.000{col 56}{space 4} .0144254{col 69}{space 3} .0394461
{txt}{space 4}coal_share {c |}{col 16}{res}{space 2}-.0299861{col 28}{space 2} .0079863{col 39}{space 1}   -3.75{col 48}{space 3}0.000{col 56}{space 4}  -.04564{col 69}{space 3}-.0143321
{txt}{space 6}load_ACT {c |}{col 16}{res}{space 2} .0311106{col 28}{space 2} .0092745{col 39}{space 1}    3.35{col 48}{space 3}0.001{col 56}{space 4} .0129316{col 69}{space 3} .0492896
{txt}solar_fc_error {c |}{col 16}{res}{space 2}-.0567267{col 28}{space 2}  .135558{col 39}{space 1}   -0.42{col 48}{space 3}0.676{col 56}{space 4} -.322435{col 69}{space 3} .2089816
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2} 2.525124{col 28}{space 2} .2239311{col 39}{space 1}   11.28{col 48}{space 3}0.000{col 56}{space 4} 2.086195{col 69}{space 3} 2.964054
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2}-3.857585{col 28}{space 2} 1.637216{col 39}{space 1}   -2.36{col 48}{space 3}0.018{col 56}{space 4}-7.066707{col 69}{space 3}-.6484636
{txt}{space 6}co2price {c |}{col 16}{res}{space 2}-.0157845{col 28}{space 2} .0134148{col 39}{space 1}   -1.18{col 48}{space 3}0.239{col 56}{space 4} -.042079{col 69}{space 3}   .01051
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2} .1088235{col 28}{space 2} .0113234{col 39}{space 1}    9.61{col 48}{space 3}0.000{col 56}{space 4} .0866285{col 69}{space 3} .1310185
{txt}{space 8}_Iyq_2 {c |}{col 16}{res}{space 2} .1636239{col 28}{space 2} .1604926{col 39}{space 1}    1.02{col 48}{space 3}0.308{col 56}{space 4} -.150959{col 69}{space 3} .4782067
{txt}{space 8}_Iyq_3 {c |}{col 16}{res}{space 2}-.5128137{col 28}{space 2}  .168957{col 39}{space 1}   -3.04{col 48}{space 3}0.002{col 56}{space 4}-.8439877{col 69}{space 3}-.1816397
{txt}{space 8}_Iyq_4 {c |}{col 16}{res}{space 2} .1921677{col 28}{space 2} .1918616{col 39}{space 1}    1.00{col 48}{space 3}0.317{col 56}{space 4} -.183902{col 69}{space 3} .5682373
{txt}{space 8}_Iyq_5 {c |}{col 16}{res}{space 2}-.5881914{col 28}{space 2} .1830051{col 39}{space 1}   -3.21{col 48}{space 3}0.001{col 56}{space 4}-.9469013{col 69}{space 3}-.2294816
{txt}{space 8}_Iyq_6 {c |}{col 16}{res}{space 2}-1.589878{col 28}{space 2} .2117844{col 39}{space 1}   -7.51{col 48}{space 3}0.000{col 56}{space 4}-2.004998{col 69}{space 3}-1.174758
{txt}{space 8}_Iyq_7 {c |}{col 16}{res}{space 2}-1.236181{col 28}{space 2} .2213326{col 39}{space 1}   -5.59{col 48}{space 3}0.000{col 56}{space 4}-1.670017{col 69}{space 3}-.8023452
{txt}{space 8}_Iyq_8 {c |}{col 16}{res}{space 2}-1.897667{col 28}{space 2} .2521948{col 39}{space 1}   -7.52{col 48}{space 3}0.000{col 56}{space 4}-2.391996{col 69}{space 3}-1.403338
{txt}{space 8}_Iyq_9 {c |}{col 16}{res}{space 2}-1.167594{col 28}{space 2} .2827801{col 39}{space 1}   -4.13{col 48}{space 3}0.000{col 56}{space 4}-1.721874{col 69}{space 3}-.6133144
{txt}{space 7}_Iyq_10 {c |}{col 16}{res}{space 2}-.1921189{col 28}{space 2} .3585478{col 39}{space 1}   -0.54{col 48}{space 3}0.592{col 56}{space 4}-.8949115{col 69}{space 3} .5106737
{txt}{space 7}_Iyq_11 {c |}{col 16}{res}{space 2} .2586154{col 28}{space 2} .3914817{col 39}{space 1}    0.66{col 48}{space 3}0.509{col 56}{space 4}-.5087311{col 69}{space 3} 1.025962
{txt}{space 7}_Iyq_12 {c |}{col 16}{res}{space 2}-.7292413{col 28}{space 2} .3694455{col 39}{space 1}   -1.97{col 48}{space 3}0.048{col 56}{space 4}-1.453395{col 69}{space 3} -.005088
{txt}{space 7}_Iyq_13 {c |}{col 16}{res}{space 2}-.1244685{col 28}{space 2} .3447504{col 39}{space 1}   -0.36{col 48}{space 3}0.718{col 56}{space 4}-.8002166{col 69}{space 3} .5512796
{txt}{space 7}_Iyq_14 {c |}{col 16}{res}{space 2} .2201858{col 28}{space 2} .3633829{col 39}{space 1}    0.61{col 48}{space 3}0.545{col 56}{space 4}-.4920841{col 69}{space 3} .9324557
{txt}{space 7}_Iyq_15 {c |}{col 16}{res}{space 2} .0247375{col 28}{space 2} .4118395{col 39}{space 1}    0.06{col 48}{space 3}0.952{col 56}{space 4}-.7825125{col 69}{space 3} .8319876
{txt}{space 7}_Iyq_16 {c |}{col 16}{res}{space 2}-1.305585{col 28}{space 2} .3808409{col 39}{space 1}   -3.43{col 48}{space 3}0.001{col 56}{space 4}-2.052074{col 69}{space 3}-.5590953
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-3.526663{col 28}{space 2} .4001929{col 39}{space 1}   -8.81{col 48}{space 3}0.000{col 56}{space 4}-4.311084{col 69}{space 3}-2.742242
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 1st_step_firststage.doc, replace ctitle(IV PF Diff) addstat("F-Test", e(F))
. 
. reg q_total_mg_id afternoon weekend solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe2, robust 

{txt}Linear regression                               Number of obs     = {res}    16,460
                                                {txt}F(28, 16431)      =  {res}   401.94
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4156
                                                {txt}Root MSE          =    {res} .78567

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1} q_total_mg_id{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}afternoon {c |}{col 16}{res}{space 2} .5592663{col 28}{space 2} .0144609{col 39}{space 1}   38.67{col 48}{space 3}0.000{col 56}{space 4} .5309213{col 69}{space 3} .5876112
{txt}{space 7}weekend {c |}{col 16}{res}{space 2}-.2543299{col 28}{space 2} .0200856{col 39}{space 1}  -12.66{col 48}{space 3}0.000{col 56}{space 4}-.2936999{col 69}{space 3}  -.21496
{txt}{space 3}solar_share {c |}{col 16}{res}{space 2}-.0123073{col 28}{space 2} .0013939{col 39}{space 1}   -8.83{col 48}{space 3}0.000{col 56}{space 4}-.0150396{col 69}{space 3}-.0095751
{txt}{space 4}wind_share {c |}{col 16}{res}{space 2} .0212597{col 28}{space 2} .0009585{col 39}{space 1}   22.18{col 48}{space 3}0.000{col 56}{space 4} .0193809{col 69}{space 3} .0231384
{txt}{space 3}hydro_share {c |}{col 16}{res}{space 2} .0346353{col 28}{space 2} .0022491{col 39}{space 1}   15.40{col 48}{space 3}0.000{col 56}{space 4} .0302268{col 69}{space 3} .0390437
{txt}{space 5}gas_share {c |}{col 16}{res}{space 2}  .037003{col 28}{space 2} .0017931{col 39}{space 1}   20.64{col 48}{space 3}0.000{col 56}{space 4} .0334883{col 69}{space 3} .0405177
{txt}{space 4}coal_share {c |}{col 16}{res}{space 2} .0282141{col 28}{space 2} .0023638{col 39}{space 1}   11.94{col 48}{space 3}0.000{col 56}{space 4} .0235809{col 69}{space 3} .0328474
{txt}{space 6}load_ACT {c |}{col 16}{res}{space 2} .0666411{col 28}{space 2} .0028065{col 39}{space 1}   23.75{col 48}{space 3}0.000{col 56}{space 4} .0611401{col 69}{space 3} .0721421
{txt}solar_fc_error {c |}{col 16}{res}{space 2}-.0958961{col 28}{space 2} .0324275{col 39}{space 1}   -2.96{col 48}{space 3}0.003{col 56}{space 4}-.1594576{col 69}{space 3}-.0323346
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2} .2177756{col 28}{space 2}  .075082{col 39}{space 1}    2.90{col 48}{space 3}0.004{col 56}{space 4} .0706068{col 69}{space 3} .3649444
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2} 4.317713{col 28}{space 2} .3537727{col 39}{space 1}   12.20{col 48}{space 3}0.000{col 56}{space 4}  3.62428{col 69}{space 3} 5.011146
{txt}{space 6}co2price {c |}{col 16}{res}{space 2} .0072282{col 28}{space 2} .0040521{col 39}{space 1}    1.78{col 48}{space 3}0.074{col 56}{space 4}-.0007144{col 69}{space 3} .0151708
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2}-.0210907{col 28}{space 2} .0027886{col 39}{space 1}   -7.56{col 48}{space 3}0.000{col 56}{space 4}-.0265566{col 69}{space 3}-.0156247
{txt}{space 8}_Iyq_2 {c |}{col 16}{res}{space 2}  -.07178{col 28}{space 2} .0342184{col 39}{space 1}   -2.10{col 48}{space 3}0.036{col 56}{space 4}-.1388517{col 69}{space 3}-.0047082
{txt}{space 8}_Iyq_3 {c |}{col 16}{res}{space 2}-.1412841{col 28}{space 2} .0380084{col 39}{space 1}   -3.72{col 48}{space 3}0.000{col 56}{space 4}-.2157847{col 69}{space 3}-.0667835
{txt}{space 8}_Iyq_4 {c |}{col 16}{res}{space 2} .2238155{col 28}{space 2} .0426041{col 39}{space 1}    5.25{col 48}{space 3}0.000{col 56}{space 4} .1403068{col 69}{space 3} .3073241
{txt}{space 8}_Iyq_5 {c |}{col 16}{res}{space 2}-.2188609{col 28}{space 2} .0413299{col 39}{space 1}   -5.30{col 48}{space 3}0.000{col 56}{space 4}-.2998721{col 69}{space 3}-.1378498
{txt}{space 8}_Iyq_6 {c |}{col 16}{res}{space 2} .0984916{col 28}{space 2} .0598457{col 39}{space 1}    1.65{col 48}{space 3}0.100{col 56}{space 4}-.0188124{col 69}{space 3} .2157956
{txt}{space 8}_Iyq_7 {c |}{col 16}{res}{space 2} .7168302{col 28}{space 2}  .064962{col 39}{space 1}   11.03{col 48}{space 3}0.000{col 56}{space 4} .5894977{col 69}{space 3} .8441627
{txt}{space 8}_Iyq_8 {c |}{col 16}{res}{space 2} .3488941{col 28}{space 2} .0704843{col 39}{space 1}    4.95{col 48}{space 3}0.000{col 56}{space 4} .2107372{col 69}{space 3} .4870511
{txt}{space 8}_Iyq_9 {c |}{col 16}{res}{space 2} -.113992{col 28}{space 2} .0738984{col 39}{space 1}   -1.54{col 48}{space 3}0.123{col 56}{space 4}-.2588408{col 69}{space 3} .0308568
{txt}{space 7}_Iyq_10 {c |}{col 16}{res}{space 2}-.2246282{col 28}{space 2} .0939241{col 39}{space 1}   -2.39{col 48}{space 3}0.017{col 56}{space 4}-.4087297{col 69}{space 3}-.0405268
{txt}{space 7}_Iyq_11 {c |}{col 16}{res}{space 2}-.9676029{col 28}{space 2} .1016813{col 39}{space 1}   -9.52{col 48}{space 3}0.000{col 56}{space 4}-1.166909{col 69}{space 3}-.7682965
{txt}{space 7}_Iyq_12 {c |}{col 16}{res}{space 2}-.8889994{col 28}{space 2} .0933173{col 39}{space 1}   -9.53{col 48}{space 3}0.000{col 56}{space 4}-1.071911{col 69}{space 3}-.7060874
{txt}{space 7}_Iyq_13 {c |}{col 16}{res}{space 2} -.825128{col 28}{space 2}  .091384{col 39}{space 1}   -9.03{col 48}{space 3}0.000{col 56}{space 4}-1.004251{col 69}{space 3}-.6460055
{txt}{space 7}_Iyq_14 {c |}{col 16}{res}{space 2}-.5937562{col 28}{space 2} .0960627{col 39}{space 1}   -6.18{col 48}{space 3}0.000{col 56}{space 4}-.7820496{col 69}{space 3}-.4054629
{txt}{space 7}_Iyq_15 {c |}{col 16}{res}{space 2}-.9594249{col 28}{space 2} .1075721{col 39}{space 1}   -8.92{col 48}{space 3}0.000{col 56}{space 4}-1.170278{col 69}{space 3}-.7485719
{txt}{space 7}_Iyq_16 {c |}{col 16}{res}{space 2}-.5963471{col 28}{space 2} .0996783{col 39}{space 1}   -5.98{col 48}{space 3}0.000{col 56}{space 4}-.7917274{col 69}{space 3}-.4009667
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .6214233{col 28}{space 2} .1016881{col 39}{space 1}    6.11{col 48}{space 3}0.000{col 56}{space 4} .4221035{col 69}{space 3} .8207431
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. *outreg2 using 1st_step_firststage.doc, append ctitle(IV PF Liq) addstat("F-Test", e(F))
. 
. ***(2) IV Lag
. reg diff_p_id_da afternoon weekend $lag_controls $fe2, robust

{txt}Linear regression                               Number of obs     = {res}    16,446
                                                {txt}F(28, 16417)      =  {res}    29.69
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0677
                                                {txt}Root MSE          =    {res} 2.7889

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}      diff_p_id_da{col 20}{c |} Coefficient{col 32}  std. err.{col 44}      t{col 52}   P>|t|{col 60}     [95% con{col 73}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}afternoon {c |}{col 20}{res}{space 2} .4156728{col 32}{space 2} .0505657{col 43}{space 1}    8.22{col 52}{space 3}0.000{col 60}{space 4} .3165585{col 73}{space 3}  .514787
{txt}{space 11}weekend {c |}{col 20}{res}{space 2} .3670214{col 32}{space 2} .0553641{col 43}{space 1}    6.63{col 52}{space 3}0.000{col 60}{space 4} .2585018{col 73}{space 3}  .475541
{txt}{space 3}lag_solar_share {c |}{col 20}{res}{space 2} .0250147{col 32}{space 2} .0051878{col 43}{space 1}    4.82{col 52}{space 3}0.000{col 60}{space 4}  .014846{col 73}{space 3} .0351833
{txt}{space 4}lag_wind_share {c |}{col 20}{res}{space 2} .0297741{col 32}{space 2} .0039361{col 43}{space 1}    7.56{col 52}{space 3}0.000{col 60}{space 4}  .022059{col 73}{space 3} .0374892
{txt}{space 3}lag_hydro_share {c |}{col 20}{res}{space 2} .0264935{col 32}{space 2} .0075076{col 43}{space 1}    3.53{col 52}{space 3}0.000{col 60}{space 4} .0117777{col 73}{space 3} .0412093
{txt}{space 5}lag_gas_share {c |}{col 20}{res}{space 2} .0204413{col 32}{space 2} .0061649{col 43}{space 1}    3.32{col 52}{space 3}0.001{col 60}{space 4} .0083575{col 73}{space 3} .0325251
{txt}{space 4}lag_coal_share {c |}{col 20}{res}{space 2}-.0379196{col 32}{space 2} .0079982{col 43}{space 1}   -4.74{col 52}{space 3}0.000{col 60}{space 4} -.053597{col 73}{space 3}-.0222423
{txt}{space 6}lag_load_ACT {c |}{col 20}{res}{space 2} .0256315{col 32}{space 2} .0068352{col 43}{space 1}    3.75{col 52}{space 3}0.000{col 60}{space 4} .0122337{col 73}{space 3} .0390293
{txt}lag_solar_fc_error {c |}{col 20}{res}{space 2} .1307819{col 32}{space 2} .1293143{col 43}{space 1}    1.01{col 52}{space 3}0.312{col 60}{space 4}-.1226882{col 73}{space 3}  .384252
{txt}{space 1}lag_wind_fc_error {c |}{col 20}{res}{space 2} .0888386{col 32}{space 2} .2298655{col 43}{space 1}    0.39{col 52}{space 3}0.699{col 60}{space 4}-.3617226{col 73}{space 3} .5393999
{txt}{space 1}lag_load_fc_error {c |}{col 20}{res}{space 2}-13.61751{col 32}{space 2} 1.657343{col 43}{space 1}   -8.22{col 52}{space 3}0.000{col 60}{space 4}-16.86608{col 73}{space 3}-10.36894
{txt}{space 6}lag_co2price {c |}{col 20}{res}{space 2}-.0143337{col 32}{space 2} .0134908{col 43}{space 1}   -1.06{col 52}{space 3}0.288{col 60}{space 4}-.0407772{col 73}{space 3} .0121098
{txt}{space 6}lag_gasprice {c |}{col 20}{res}{space 2} .1036438{col 32}{space 2} .0115709{col 43}{space 1}    8.96{col 52}{space 3}0.000{col 60}{space 4} .0809636{col 73}{space 3} .1263241
{txt}{space 12}_Iyq_2 {c |}{col 20}{res}{space 2} .0029129{col 32}{space 2} .1622101{col 43}{space 1}    0.02{col 52}{space 3}0.986{col 60}{space 4}-.3150364{col 73}{space 3} .3208622
{txt}{space 12}_Iyq_3 {c |}{col 20}{res}{space 2}-.8901532{col 32}{space 2}  .168961{col 43}{space 1}   -5.27{col 52}{space 3}0.000{col 60}{space 4}-1.221335{col 73}{space 3}-.5589713
{txt}{space 12}_Iyq_4 {c |}{col 20}{res}{space 2}-.1315879{col 32}{space 2} .1895716{col 43}{space 1}   -0.69{col 52}{space 3}0.488{col 60}{space 4}-.5031687{col 73}{space 3} .2399929
{txt}{space 12}_Iyq_5 {c |}{col 20}{res}{space 2}-.3493959{col 32}{space 2}  .182832{col 43}{space 1}   -1.91{col 52}{space 3}0.056{col 60}{space 4}-.7077663{col 73}{space 3} .0089746
{txt}{space 12}_Iyq_6 {c |}{col 20}{res}{space 2}-1.084662{col 32}{space 2} .2138169{col 43}{space 1}   -5.07{col 52}{space 3}0.000{col 60}{space 4}-1.503766{col 73}{space 3}-.6655576
{txt}{space 12}_Iyq_7 {c |}{col 20}{res}{space 2}-1.211051{col 32}{space 2} .2242341{col 43}{space 1}   -5.40{col 52}{space 3}0.000{col 60}{space 4}-1.650574{col 73}{space 3}-.7715274
{txt}{space 12}_Iyq_8 {c |}{col 20}{res}{space 2}-1.933722{col 32}{space 2} .2530826{col 43}{space 1}   -7.64{col 52}{space 3}0.000{col 60}{space 4}-2.429791{col 73}{space 3}-1.437652
{txt}{space 12}_Iyq_9 {c |}{col 20}{res}{space 2}-1.211196{col 32}{space 2} .2830199{col 43}{space 1}   -4.28{col 52}{space 3}0.000{col 60}{space 4}-1.765946{col 73}{space 3}-.6564464
{txt}{space 11}_Iyq_10 {c |}{col 20}{res}{space 2} -.382984{col 32}{space 2} .3522082{col 43}{space 1}   -1.09{col 52}{space 3}0.277{col 60}{space 4} -1.07335{col 73}{space 3} .3073822
{txt}{space 11}_Iyq_11 {c |}{col 20}{res}{space 2}-.0726598{col 32}{space 2} .3881738{col 43}{space 1}   -0.19{col 52}{space 3}0.852{col 60}{space 4}-.8335225{col 73}{space 3} .6882029
{txt}{space 11}_Iyq_12 {c |}{col 20}{res}{space 2}-.6542804{col 32}{space 2} .3650793{col 43}{space 1}   -1.79{col 52}{space 3}0.073{col 60}{space 4}-1.369875{col 73}{space 3} .0613147
{txt}{space 11}_Iyq_13 {c |}{col 20}{res}{space 2} .0830684{col 32}{space 2} .3452112{col 43}{space 1}    0.24{col 52}{space 3}0.810{col 60}{space 4} -.593583{col 73}{space 3} .7597198
{txt}{space 11}_Iyq_14 {c |}{col 20}{res}{space 2} .3584197{col 32}{space 2} .3607147{col 43}{space 1}    0.99{col 52}{space 3}0.320{col 60}{space 4}-.3486203{col 73}{space 3}  1.06546
{txt}{space 11}_Iyq_15 {c |}{col 20}{res}{space 2}  -.06285{col 32}{space 2} .4085631{col 43}{space 1}   -0.15{col 52}{space 3}0.878{col 60}{space 4} -.863678{col 73}{space 3}  .737978
{txt}{space 11}_Iyq_16 {c |}{col 20}{res}{space 2}-1.257852{col 32}{space 2} .3770801{col 43}{space 1}   -3.34{col 52}{space 3}0.001{col 60}{space 4} -1.99697{col 73}{space 3}-.5187342
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-1.835942{col 32}{space 2} .3660824{col 43}{space 1}   -5.02{col 52}{space 3}0.000{col 60}{space 4}-2.553503{col 73}{space 3}-1.118381
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 1st_step_firststage.doc, append ctitle(IV 1 Lag Diff) addstat("F-Test", e(F))
. 
. reg q_total_mg_id afternoon weekend $lag_controls $fe2, robust

{txt}Linear regression                               Number of obs     = {res}    16,446
                                                {txt}F(28, 16417)      =  {res}   330.23
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.3700
                                                {txt}Root MSE          =    {res} .81543

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}     q_total_mg_id{col 20}{c |} Coefficient{col 32}  std. err.{col 44}      t{col 52}   P>|t|{col 60}     [95% con{col 73}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}afternoon {c |}{col 20}{res}{space 2} .5044498{col 32}{space 2} .0148273{col 43}{space 1}   34.02{col 52}{space 3}0.000{col 60}{space 4} .4753867{col 73}{space 3} .5335129
{txt}{space 11}weekend {c |}{col 20}{res}{space 2}-.7423391{col 32}{space 2}  .013273{col 43}{space 1}  -55.93{col 52}{space 3}0.000{col 60}{space 4}-.7683556{col 73}{space 3}-.7163225
{txt}{space 3}lag_solar_share {c |}{col 20}{res}{space 2}-.0119647{col 32}{space 2} .0013927{col 43}{space 1}   -8.59{col 52}{space 3}0.000{col 60}{space 4}-.0146945{col 73}{space 3} -.009235
{txt}{space 4}lag_wind_share {c |}{col 20}{res}{space 2} .0156921{col 32}{space 2} .0009979{col 43}{space 1}   15.73{col 52}{space 3}0.000{col 60}{space 4} .0137361{col 73}{space 3}  .017648
{txt}{space 3}lag_hydro_share {c |}{col 20}{res}{space 2} .0093454{col 32}{space 2} .0023213{col 43}{space 1}    4.03{col 52}{space 3}0.000{col 60}{space 4} .0047954{col 73}{space 3} .0138954
{txt}{space 5}lag_gas_share {c |}{col 20}{res}{space 2} .0111034{col 32}{space 2} .0016866{col 43}{space 1}    6.58{col 52}{space 3}0.000{col 60}{space 4} .0077975{col 73}{space 3} .0144093
{txt}{space 4}lag_coal_share {c |}{col 20}{res}{space 2} .0248827{col 32}{space 2} .0024858{col 43}{space 1}   10.01{col 52}{space 3}0.000{col 60}{space 4} .0200102{col 73}{space 3} .0297552
{txt}{space 6}lag_load_ACT {c |}{col 20}{res}{space 2} .0373075{col 32}{space 2} .0019579{col 43}{space 1}   19.06{col 52}{space 3}0.000{col 60}{space 4} .0334698{col 73}{space 3} .0411451
{txt}lag_solar_fc_error {c |}{col 20}{res}{space 2}-.0758275{col 32}{space 2} .0327915{col 43}{space 1}   -2.31{col 52}{space 3}0.021{col 60}{space 4}-.1401025{col 73}{space 3}-.0115526
{txt}{space 1}lag_wind_fc_error {c |}{col 20}{res}{space 2}  .383111{col 32}{space 2} .0742743{col 43}{space 1}    5.16{col 52}{space 3}0.000{col 60}{space 4} .2375253{col 73}{space 3} .5286967
{txt}{space 1}lag_load_fc_error {c |}{col 20}{res}{space 2} .0299981{col 32}{space 2} .3559148{col 43}{space 1}    0.08{col 52}{space 3}0.933{col 60}{space 4}-.6676335{col 73}{space 3} .7276298
{txt}{space 6}lag_co2price {c |}{col 20}{res}{space 2} .0164098{col 32}{space 2} .0042018{col 43}{space 1}    3.91{col 52}{space 3}0.000{col 60}{space 4} .0081737{col 73}{space 3} .0246458
{txt}{space 6}lag_gasprice {c |}{col 20}{res}{space 2}-.0120414{col 32}{space 2} .0028514{col 43}{space 1}   -4.22{col 52}{space 3}0.000{col 60}{space 4}-.0176305{col 73}{space 3}-.0064523
{txt}{space 12}_Iyq_2 {c |}{col 20}{res}{space 2}-.1292549{col 32}{space 2} .0361181{col 43}{space 1}   -3.58{col 52}{space 3}0.000{col 60}{space 4}-.2000502{col 73}{space 3}-.0584595
{txt}{space 12}_Iyq_3 {c |}{col 20}{res}{space 2}-.0858283{col 32}{space 2} .0396163{col 43}{space 1}   -2.17{col 52}{space 3}0.030{col 60}{space 4}-.1634805{col 73}{space 3} -.008176
{txt}{space 12}_Iyq_4 {c |}{col 20}{res}{space 2} .3077219{col 32}{space 2} .0466068{col 43}{space 1}    6.60{col 52}{space 3}0.000{col 60}{space 4} .2163676{col 73}{space 3} .3990762
{txt}{space 12}_Iyq_5 {c |}{col 20}{res}{space 2}-.1352574{col 32}{space 2}   .04319{col 43}{space 1}   -3.13{col 52}{space 3}0.002{col 60}{space 4}-.2199146{col 73}{space 3}-.0506003
{txt}{space 12}_Iyq_6 {c |}{col 20}{res}{space 2} .1436657{col 32}{space 2} .0588749{col 43}{space 1}    2.44{col 52}{space 3}0.015{col 60}{space 4} .0282644{col 73}{space 3}  .259067
{txt}{space 12}_Iyq_7 {c |}{col 20}{res}{space 2} .5927132{col 32}{space 2} .0672866{col 43}{space 1}    8.81{col 52}{space 3}0.000{col 60}{space 4} .4608242{col 73}{space 3} .7246022
{txt}{space 12}_Iyq_8 {c |}{col 20}{res}{space 2} .2961883{col 32}{space 2}  .074167{col 43}{space 1}    3.99{col 52}{space 3}0.000{col 60}{space 4} .1508129{col 73}{space 3} .4415637
{txt}{space 12}_Iyq_9 {c |}{col 20}{res}{space 2} -.144992{col 32}{space 2} .0772708{col 43}{space 1}   -1.88{col 52}{space 3}0.061{col 60}{space 4}-.2964513{col 73}{space 3} .0064672
{txt}{space 11}_Iyq_10 {c |}{col 20}{res}{space 2}-.1765181{col 32}{space 2} .0981513{col 43}{space 1}   -1.80{col 52}{space 3}0.072{col 60}{space 4}-.3689052{col 73}{space 3}  .015869
{txt}{space 11}_Iyq_11 {c |}{col 20}{res}{space 2}-.7115348{col 32}{space 2} .1063142{col 43}{space 1}   -6.69{col 52}{space 3}0.000{col 60}{space 4}-.9199222{col 73}{space 3}-.5031475
{txt}{space 11}_Iyq_12 {c |}{col 20}{res}{space 2}-.6471715{col 32}{space 2} .0972777{col 43}{space 1}   -6.65{col 52}{space 3}0.000{col 60}{space 4}-.8378464{col 73}{space 3}-.4564966
{txt}{space 11}_Iyq_13 {c |}{col 20}{res}{space 2}-.7262866{col 32}{space 2} .0936766{col 43}{space 1}   -7.75{col 52}{space 3}0.000{col 60}{space 4}-.9099029{col 73}{space 3}-.5426703
{txt}{space 11}_Iyq_14 {c |}{col 20}{res}{space 2}-.6018976{col 32}{space 2} .0963751{col 43}{space 1}   -6.25{col 52}{space 3}0.000{col 60}{space 4}-.7908032{col 73}{space 3} -.412992
{txt}{space 11}_Iyq_15 {c |}{col 20}{res}{space 2} -.793766{col 32}{space 2} .1115774{col 43}{space 1}   -7.11{col 52}{space 3}0.000{col 60}{space 4} -1.01247{col 73}{space 3}-.5750622
{txt}{space 11}_Iyq_16 {c |}{col 20}{res}{space 2}  -.57563{col 32}{space 2} .1029827{col 43}{space 1}   -5.59{col 52}{space 3}0.000{col 60}{space 4}-.7774872{col 73}{space 3}-.3737728
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 2.366823{col 32}{space 2}  .091475{col 43}{space 1}   25.87{col 52}{space 3}0.000{col 60}{space 4} 2.187522{col 73}{space 3} 2.546124
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 1st_step_firststage.doc, append ctitle(IV 1 Lag Liq) addstat("F-Test", e(F))
. 
. *****Robustness Checks
. ***OLS (linear probability model) & Probit without instruments, additional: Logit model
. ***(1) OLS PF
. reg pbid_dummy diff_p_id_da q_total_mg_id solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe2, robust

{txt}Linear regression                               Number of obs     = {res}    16,460
                                                {txt}F(28, 16431)      =  {res}   197.01
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2580
                                                {txt}Root MSE          =    {res} .35441

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}    pbid_dummy{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}diff_p_id_da {c |}{col 16}{res}{space 2} .0033865{col 28}{space 2} .0009482{col 39}{space 1}    3.57{col 48}{space 3}0.000{col 56}{space 4} .0015279{col 69}{space 3} .0052451
{txt}{space 1}q_total_mg_id {c |}{col 16}{res}{space 2} .0027813{col 28}{space 2} .0033022{col 39}{space 1}    0.84{col 48}{space 3}0.400{col 56}{space 4}-.0036913{col 69}{space 3} .0092539
{txt}{space 3}solar_share {c |}{col 16}{res}{space 2} -.004778{col 28}{space 2} .0006207{col 39}{space 1}   -7.70{col 48}{space 3}0.000{col 56}{space 4}-.0059947{col 69}{space 3}-.0035613
{txt}{space 4}wind_share {c |}{col 16}{res}{space 2} .0017089{col 28}{space 2} .0004587{col 39}{space 1}    3.73{col 48}{space 3}0.000{col 56}{space 4} .0008098{col 69}{space 3}  .002608
{txt}{space 3}hydro_share {c |}{col 16}{res}{space 2}-.0057271{col 28}{space 2} .0009123{col 39}{space 1}   -6.28{col 48}{space 3}0.000{col 56}{space 4}-.0075154{col 69}{space 3}-.0039388
{txt}{space 5}gas_share {c |}{col 16}{res}{space 2} .0028867{col 28}{space 2} .0007415{col 39}{space 1}    3.89{col 48}{space 3}0.000{col 56}{space 4} .0014333{col 69}{space 3} .0043402
{txt}{space 4}coal_share {c |}{col 16}{res}{space 2} .0039702{col 28}{space 2} .0010321{col 39}{space 1}    3.85{col 48}{space 3}0.000{col 56}{space 4} .0019473{col 69}{space 3} .0059932
{txt}{space 6}load_ACT {c |}{col 16}{res}{space 2} .0079491{col 28}{space 2} .0009823{col 39}{space 1}    8.09{col 48}{space 3}0.000{col 56}{space 4} .0060236{col 69}{space 3} .0098746
{txt}solar_fc_error {c |}{col 16}{res}{space 2}-.0230503{col 28}{space 2} .0141534{col 39}{space 1}   -1.63{col 48}{space 3}0.103{col 56}{space 4}-.0507926{col 69}{space 3} .0046919
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2}-.1196275{col 28}{space 2}  .033435{col 39}{space 1}   -3.58{col 48}{space 3}0.000{col 56}{space 4}-.1851637{col 69}{space 3}-.0540912
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2}-.5445078{col 28}{space 2} .1794063{col 39}{space 1}   -3.04{col 48}{space 3}0.002{col 56}{space 4}-.8961637{col 69}{space 3}-.1928519
{txt}{space 6}co2price {c |}{col 16}{res}{space 2} .0182583{col 28}{space 2} .0019437{col 39}{space 1}    9.39{col 48}{space 3}0.000{col 56}{space 4} .0144484{col 69}{space 3} .0220682
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2}-.0087082{col 28}{space 2} .0010926{col 39}{space 1}   -7.97{col 48}{space 3}0.000{col 56}{space 4}-.0108498{col 69}{space 3}-.0065666
{txt}{space 8}_Iyq_2 {c |}{col 16}{res}{space 2}-.0346276{col 28}{space 2} .0154228{col 39}{space 1}   -2.25{col 48}{space 3}0.025{col 56}{space 4}-.0648579{col 69}{space 3}-.0043972
{txt}{space 8}_Iyq_3 {c |}{col 16}{res}{space 2}-.0923162{col 28}{space 2} .0168559{col 39}{space 1}   -5.48{col 48}{space 3}0.000{col 56}{space 4}-.1253555{col 69}{space 3}-.0592769
{txt}{space 8}_Iyq_4 {c |}{col 16}{res}{space 2}-.1424054{col 28}{space 2} .0183436{col 39}{space 1}   -7.76{col 48}{space 3}0.000{col 56}{space 4}-.1783608{col 69}{space 3}-.1064499
{txt}{space 8}_Iyq_5 {c |}{col 16}{res}{space 2}-.1220176{col 28}{space 2} .0182806{col 39}{space 1}   -6.67{col 48}{space 3}0.000{col 56}{space 4}-.1578496{col 69}{space 3}-.0861856
{txt}{space 8}_Iyq_6 {c |}{col 16}{res}{space 2}-.0615101{col 28}{space 2} .0237556{col 39}{space 1}   -2.59{col 48}{space 3}0.010{col 56}{space 4}-.1080737{col 69}{space 3}-.0149465
{txt}{space 8}_Iyq_7 {c |}{col 16}{res}{space 2}-.1732324{col 28}{space 2} .0290718{col 39}{space 1}   -5.96{col 48}{space 3}0.000{col 56}{space 4}-.2302163{col 69}{space 3}-.1162484
{txt}{space 8}_Iyq_8 {c |}{col 16}{res}{space 2}-.2667106{col 28}{space 2}  .032748{col 39}{space 1}   -8.14{col 48}{space 3}0.000{col 56}{space 4}-.3309002{col 69}{space 3}-.2025211
{txt}{space 8}_Iyq_9 {c |}{col 16}{res}{space 2}-.3386426{col 28}{space 2} .0361896{col 39}{space 1}   -9.36{col 48}{space 3}0.000{col 56}{space 4}-.4095782{col 69}{space 3} -.267707
{txt}{space 7}_Iyq_10 {c |}{col 16}{res}{space 2}-.4026248{col 28}{space 2} .0443468{col 39}{space 1}   -9.08{col 48}{space 3}0.000{col 56}{space 4}-.4895495{col 69}{space 3}-.3157002
{txt}{space 7}_Iyq_11 {c |}{col 16}{res}{space 2}-.7101511{col 28}{space 2} .0501955{col 39}{space 1}  -14.15{col 48}{space 3}0.000{col 56}{space 4}-.8085398{col 69}{space 3}-.6117624
{txt}{space 7}_Iyq_12 {c |}{col 16}{res}{space 2}-.5061078{col 28}{space 2} .0446071{col 39}{space 1}  -11.35{col 48}{space 3}0.000{col 56}{space 4}-.5935426{col 69}{space 3}-.4186731
{txt}{space 7}_Iyq_13 {c |}{col 16}{res}{space 2}-.5229182{col 28}{space 2} .0434998{col 39}{space 1}  -12.02{col 48}{space 3}0.000{col 56}{space 4}-.6081825{col 69}{space 3}-.4376538
{txt}{space 7}_Iyq_14 {c |}{col 16}{res}{space 2} -.362871{col 28}{space 2} .0437437{col 39}{space 1}   -8.30{col 48}{space 3}0.000{col 56}{space 4}-.4486135{col 69}{space 3}-.2771286
{txt}{space 7}_Iyq_15 {c |}{col 16}{res}{space 2}-.9973232{col 28}{space 2} .0514411{col 39}{space 1}  -19.39{col 48}{space 3}0.000{col 56}{space 4}-1.098153{col 69}{space 3} -.896493
{txt}{space 7}_Iyq_16 {c |}{col 16}{res}{space 2}-1.126118{col 28}{space 2} .0461214{col 39}{space 1}  -24.42{col 48}{space 3}0.000{col 56}{space 4}-1.216521{col 69}{space 3}-1.035715
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  .690873{col 28}{space 2} .0389351{col 39}{space 1}   17.74{col 48}{space 3}0.000{col 56}{space 4} .6145559{col 69}{space 3} .7671901
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 1st_step_robust.doc, replace ctitle(OLS PF) addstat("F-Test", e(F))
. 
. ****Probit
. ***(2) Probit PF
. probit pbid_dummy diff_p_id_da q_total_mg_id solar_share wind_share hydro_share  gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe2 afternoon weekend

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-8575.4282}  
Iteration 1:{space 3}log likelihood = {res:-6038.8506}  
Iteration 2:{space 3}log likelihood = {res:-5988.5665}  
Iteration 3:{space 3}log likelihood = {res:-5988.5133}  
Iteration 4:{space 3}log likelihood = {res:-5988.5133}  
{res}
{txt}{col 1}Probit regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:16,460}
{txt}{col 56}{lalign 13:LR chi2({res:30})}{col 69} = {res}{ralign 7:5173.83}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-5988.5133}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.3017}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    pbid_dummy{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}diff_p_id_da {c |}{col 16}{res}{space 2} .0102733{col 28}{space 2} .0047987{col 39}{space 1}    2.14{col 48}{space 3}0.032{col 56}{space 4} .0008679{col 69}{space 3} .0196786
{txt}{space 1}q_total_mg_id {c |}{col 16}{res}{space 2}-.1555964{col 28}{space 2}  .016766{col 39}{space 1}   -9.28{col 48}{space 3}0.000{col 56}{space 4}-.1884572{col 69}{space 3}-.1227356
{txt}{space 3}solar_share {c |}{col 16}{res}{space 2}-.0523402{col 28}{space 2} .0029199{col 39}{space 1}  -17.93{col 48}{space 3}0.000{col 56}{space 4}-.0580631{col 69}{space 3}-.0466173
{txt}{space 4}wind_share {c |}{col 16}{res}{space 2} .0014369{col 28}{space 2}  .002079{col 39}{space 1}    0.69{col 48}{space 3}0.489{col 56}{space 4}-.0026379{col 69}{space 3} .0055118
{txt}{space 3}hydro_share {c |}{col 16}{res}{space 2} -.014199{col 28}{space 2} .0039486{col 39}{space 1}   -3.60{col 48}{space 3}0.000{col 56}{space 4} -.021938{col 69}{space 3}-.0064599
{txt}{space 5}gas_share {c |}{col 16}{res}{space 2} .0120802{col 28}{space 2} .0033423{col 39}{space 1}    3.61{col 48}{space 3}0.000{col 56}{space 4} .0055293{col 69}{space 3}  .018631
{txt}{space 4}coal_share {c |}{col 16}{res}{space 2} .0227039{col 28}{space 2} .0047318{col 39}{space 1}    4.80{col 48}{space 3}0.000{col 56}{space 4} .0134298{col 69}{space 3}  .031978
{txt}{space 6}load_ACT {c |}{col 16}{res}{space 2} .0274264{col 28}{space 2} .0053617{col 39}{space 1}    5.12{col 48}{space 3}0.000{col 56}{space 4} .0169176{col 69}{space 3} .0379351
{txt}solar_fc_error {c |}{col 16}{res}{space 2}-.0199091{col 28}{space 2} .0691002{col 39}{space 1}   -0.29{col 48}{space 3}0.773{col 56}{space 4}-.1553429{col 69}{space 3} .1155248
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2}-.5198099{col 28}{space 2}   .14109{col 39}{space 1}   -3.68{col 48}{space 3}0.000{col 56}{space 4}-.7963413{col 69}{space 3}-.2432785
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2}-1.635131{col 28}{space 2}  .750143{col 39}{space 1}   -2.18{col 48}{space 3}0.029{col 56}{space 4}-3.105384{col 69}{space 3}-.1648777
{txt}{space 6}co2price {c |}{col 16}{res}{space 2} .0841201{col 28}{space 2} .0082866{col 39}{space 1}   10.15{col 48}{space 3}0.000{col 56}{space 4} .0678786{col 69}{space 3} .1003616
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2}-.0455145{col 28}{space 2} .0055252{col 39}{space 1}   -8.24{col 48}{space 3}0.000{col 56}{space 4}-.0563437{col 69}{space 3}-.0346853
{txt}{space 8}_Iyq_2 {c |}{col 16}{res}{space 2}-.2074619{col 28}{space 2} .0867688{col 39}{space 1}   -2.39{col 48}{space 3}0.017{col 56}{space 4}-.3775256{col 69}{space 3}-.0373981
{txt}{space 8}_Iyq_3 {c |}{col 16}{res}{space 2}-.3806472{col 28}{space 2} .0954503{col 39}{space 1}   -3.99{col 48}{space 3}0.000{col 56}{space 4}-.5677264{col 69}{space 3}-.1935681
{txt}{space 8}_Iyq_4 {c |}{col 16}{res}{space 2}-.5582398{col 28}{space 2} .0913353{col 39}{space 1}   -6.11{col 48}{space 3}0.000{col 56}{space 4}-.7372537{col 69}{space 3}-.3792259
{txt}{space 8}_Iyq_5 {c |}{col 16}{res}{space 2}-.5920223{col 28}{space 2} .0923848{col 39}{space 1}   -6.41{col 48}{space 3}0.000{col 56}{space 4}-.7730933{col 69}{space 3}-.4109513
{txt}{space 8}_Iyq_6 {c |}{col 16}{res}{space 2}-.3394862{col 28}{space 2} .1188386{col 39}{space 1}   -2.86{col 48}{space 3}0.004{col 56}{space 4}-.5724055{col 69}{space 3}-.1065669
{txt}{space 8}_Iyq_7 {c |}{col 16}{res}{space 2}-.6140527{col 28}{space 2} .1386635{col 39}{space 1}   -4.43{col 48}{space 3}0.000{col 56}{space 4}-.8858282{col 69}{space 3}-.3422772
{txt}{space 8}_Iyq_8 {c |}{col 16}{res}{space 2}-1.114615{col 28}{space 2} .1526468{col 39}{space 1}   -7.30{col 48}{space 3}0.000{col 56}{space 4}-1.413798{col 69}{space 3}-.8154333
{txt}{space 8}_Iyq_9 {c |}{col 16}{res}{space 2}-1.500026{col 28}{space 2} .1664172{col 39}{space 1}   -9.01{col 48}{space 3}0.000{col 56}{space 4}-1.826198{col 69}{space 3}-1.173855
{txt}{space 7}_Iyq_10 {c |}{col 16}{res}{space 2}-1.753129{col 28}{space 2} .2049799{col 39}{space 1}   -8.55{col 48}{space 3}0.000{col 56}{space 4}-2.154882{col 69}{space 3}-1.351375
{txt}{space 7}_Iyq_11 {c |}{col 16}{res}{space 2}-3.154011{col 28}{space 2} .2241303{col 39}{space 1}  -14.07{col 48}{space 3}0.000{col 56}{space 4}-3.593298{col 69}{space 3}-2.714723
{txt}{space 7}_Iyq_12 {c |}{col 16}{res}{space 2}-2.405753{col 28}{space 2} .2066376{col 39}{space 1}  -11.64{col 48}{space 3}0.000{col 56}{space 4}-2.810756{col 69}{space 3}-2.000751
{txt}{space 7}_Iyq_13 {c |}{col 16}{res}{space 2}-2.424412{col 28}{space 2}  .190659{col 39}{space 1}  -12.72{col 48}{space 3}0.000{col 56}{space 4}-2.798097{col 69}{space 3}-2.050727
{txt}{space 7}_Iyq_14 {c |}{col 16}{res}{space 2}-1.656096{col 28}{space 2} .1951401{col 39}{space 1}   -8.49{col 48}{space 3}0.000{col 56}{space 4}-2.038564{col 69}{space 3}-1.273629
{txt}{space 7}_Iyq_15 {c |}{col 16}{res}{space 2}-3.802015{col 28}{space 2} .2331541{col 39}{space 1}  -16.31{col 48}{space 3}0.000{col 56}{space 4}-4.258989{col 69}{space 3}-3.345042
{txt}{space 7}_Iyq_16 {c |}{col 16}{res}{space 2}-4.296606{col 28}{space 2} .2185878{col 39}{space 1}  -19.66{col 48}{space 3}0.000{col 56}{space 4} -4.72503{col 69}{space 3}-3.868182
{txt}{space 5}afternoon {c |}{col 16}{res}{space 2} 1.120829{col 28}{space 2} .0311381{col 39}{space 1}   36.00{col 48}{space 3}0.000{col 56}{space 4}   1.0598{col 69}{space 3} 1.181859
{txt}{space 7}weekend {c |}{col 16}{res}{space 2}-.1679086{col 28}{space 2} .0405428{col 39}{space 1}   -4.14{col 48}{space 3}0.000{col 56}{space 4} -.247371{col 69}{space 3}-.0884461
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1.166634{col 28}{space 2} .2219186{col 39}{space 1}    5.26{col 48}{space 3}0.000{col 56}{space 4} .7316818{col 69}{space 3} 1.601587
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. *outreg2 using 1st_step_robust.doc, append ctitle(Probit PF) addstat("Chi2", e(chi2))
. 
. ****Logit
. ***(3) Logit PF
. logit pbid_dummy diff_p_id_da q_total_mg_id solar_share wind_share hydro_share  gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe2 afternoon weekend

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-8575.4282}  
Iteration 1:{space 3}log likelihood = {res:-6187.6414}  
Iteration 2:{space 3}log likelihood = {res:-5993.3675}  
Iteration 3:{space 3}log likelihood = {res:-5988.3909}  
Iteration 4:{space 3}log likelihood = {res:-5988.3827}  
Iteration 5:{space 3}log likelihood = {res:-5988.3827}  
{res}
{txt}{col 1}Logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:16,460}
{txt}{col 56}{lalign 13:LR chi2({res:30})}{col 69} = {res}{ralign 7:5174.09}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-5988.3827}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.3017}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    pbid_dummy{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}diff_p_id_da {c |}{col 16}{res}{space 2} .0160799{col 28}{space 2} .0087143{col 39}{space 1}    1.85{col 48}{space 3}0.065{col 56}{space 4}-.0009997{col 69}{space 3} .0331596
{txt}{space 1}q_total_mg_id {c |}{col 16}{res}{space 2}-.2970988{col 28}{space 2} .0301141{col 39}{space 1}   -9.87{col 48}{space 3}0.000{col 56}{space 4}-.3561212{col 69}{space 3}-.2380763
{txt}{space 3}solar_share {c |}{col 16}{res}{space 2} -.098713{col 28}{space 2} .0053792{col 39}{space 1}  -18.35{col 48}{space 3}0.000{col 56}{space 4}-.1092561{col 69}{space 3}-.0881699
{txt}{space 4}wind_share {c |}{col 16}{res}{space 2} .0019479{col 28}{space 2} .0037772{col 39}{space 1}    0.52{col 48}{space 3}0.606{col 56}{space 4}-.0054553{col 69}{space 3} .0093511
{txt}{space 3}hydro_share {c |}{col 16}{res}{space 2} -.024876{col 28}{space 2} .0072079{col 39}{space 1}   -3.45{col 48}{space 3}0.001{col 56}{space 4}-.0390033{col 69}{space 3}-.0107488
{txt}{space 5}gas_share {c |}{col 16}{res}{space 2} .0200666{col 28}{space 2} .0060472{col 39}{space 1}    3.32{col 48}{space 3}0.001{col 56}{space 4} .0082142{col 69}{space 3}  .031919
{txt}{space 4}coal_share {c |}{col 16}{res}{space 2} .0458501{col 28}{space 2} .0089187{col 39}{space 1}    5.14{col 48}{space 3}0.000{col 56}{space 4} .0283697{col 69}{space 3} .0633305
{txt}{space 6}load_ACT {c |}{col 16}{res}{space 2} .0465476{col 28}{space 2} .0097963{col 39}{space 1}    4.75{col 48}{space 3}0.000{col 56}{space 4} .0273471{col 69}{space 3}  .065748
{txt}solar_fc_error {c |}{col 16}{res}{space 2}-.0514442{col 28}{space 2} .1191379{col 39}{space 1}   -0.43{col 48}{space 3}0.666{col 56}{space 4}-.2849501{col 69}{space 3} .1820618
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2}-.9656573{col 28}{space 2} .2490142{col 39}{space 1}   -3.88{col 48}{space 3}0.000{col 56}{space 4}-1.453716{col 69}{space 3}-.4775983
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2}-2.838468{col 28}{space 2}  1.35396{col 39}{space 1}   -2.10{col 48}{space 3}0.036{col 56}{space 4}-5.492181{col 69}{space 3}-.1847549
{txt}{space 6}co2price {c |}{col 16}{res}{space 2} .1557678{col 28}{space 2} .0150165{col 39}{space 1}   10.37{col 48}{space 3}0.000{col 56}{space 4}  .126336{col 69}{space 3} .1851997
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2}-.0851952{col 28}{space 2} .0098154{col 39}{space 1}   -8.68{col 48}{space 3}0.000{col 56}{space 4}-.1044331{col 69}{space 3}-.0659574
{txt}{space 8}_Iyq_2 {c |}{col 16}{res}{space 2} -.356922{col 28}{space 2} .1610201{col 39}{space 1}   -2.22{col 48}{space 3}0.027{col 56}{space 4}-.6725156{col 69}{space 3}-.0413283
{txt}{space 8}_Iyq_3 {c |}{col 16}{res}{space 2}-.7348177{col 28}{space 2} .1762752{col 39}{space 1}   -4.17{col 48}{space 3}0.000{col 56}{space 4}-1.080311{col 69}{space 3}-.3893247
{txt}{space 8}_Iyq_4 {c |}{col 16}{res}{space 2}-1.036324{col 28}{space 2} .1688957{col 39}{space 1}   -6.14{col 48}{space 3}0.000{col 56}{space 4}-1.367353{col 69}{space 3}-.7052945
{txt}{space 8}_Iyq_5 {c |}{col 16}{res}{space 2}-1.070003{col 28}{space 2} .1698335{col 39}{space 1}   -6.30{col 48}{space 3}0.000{col 56}{space 4} -1.40287{col 69}{space 3}-.7371354
{txt}{space 8}_Iyq_6 {c |}{col 16}{res}{space 2}-.6049232{col 28}{space 2} .2185811{col 39}{space 1}   -2.77{col 48}{space 3}0.006{col 56}{space 4}-1.033334{col 69}{space 3}-.1765121
{txt}{space 8}_Iyq_7 {c |}{col 16}{res}{space 2}-1.140863{col 28}{space 2}   .25302{col 39}{space 1}   -4.51{col 48}{space 3}0.000{col 56}{space 4}-1.636773{col 69}{space 3}-.6449527
{txt}{space 8}_Iyq_8 {c |}{col 16}{res}{space 2}-2.086915{col 28}{space 2} .2773434{col 39}{space 1}   -7.52{col 48}{space 3}0.000{col 56}{space 4}-2.630498{col 69}{space 3}-1.543332
{txt}{space 8}_Iyq_9 {c |}{col 16}{res}{space 2}-2.747934{col 28}{space 2} .3014322{col 39}{space 1}   -9.12{col 48}{space 3}0.000{col 56}{space 4}-3.338731{col 69}{space 3}-2.157138
{txt}{space 7}_Iyq_10 {c |}{col 16}{res}{space 2}-3.158573{col 28}{space 2}  .371075{col 39}{space 1}   -8.51{col 48}{space 3}0.000{col 56}{space 4}-3.885866{col 69}{space 3}-2.431279
{txt}{space 7}_Iyq_11 {c |}{col 16}{res}{space 2}-5.657806{col 28}{space 2} .4037802{col 39}{space 1}  -14.01{col 48}{space 3}0.000{col 56}{space 4}-6.449201{col 69}{space 3}-4.866412
{txt}{space 7}_Iyq_12 {c |}{col 16}{res}{space 2}-4.371707{col 28}{space 2} .3712226{col 39}{space 1}  -11.78{col 48}{space 3}0.000{col 56}{space 4} -5.09929{col 69}{space 3}-3.644124
{txt}{space 7}_Iyq_13 {c |}{col 16}{res}{space 2} -4.37241{col 28}{space 2} .3431627{col 39}{space 1}  -12.74{col 48}{space 3}0.000{col 56}{space 4}-5.044996{col 69}{space 3}-3.699823
{txt}{space 7}_Iyq_14 {c |}{col 16}{res}{space 2}-2.963718{col 28}{space 2} .3541856{col 39}{space 1}   -8.37{col 48}{space 3}0.000{col 56}{space 4}-3.657909{col 69}{space 3}-2.269527
{txt}{space 7}_Iyq_15 {c |}{col 16}{res}{space 2}-6.761055{col 28}{space 2} .4202633{col 39}{space 1}  -16.09{col 48}{space 3}0.000{col 56}{space 4}-7.584756{col 69}{space 3}-5.937354
{txt}{space 7}_Iyq_16 {c |}{col 16}{res}{space 2}-7.709201{col 28}{space 2}  .397584{col 39}{space 1}  -19.39{col 48}{space 3}0.000{col 56}{space 4}-8.488452{col 69}{space 3}-6.929951
{txt}{space 5}afternoon {c |}{col 16}{res}{space 2} 2.081563{col 28}{space 2} .0594249{col 39}{space 1}   35.03{col 48}{space 3}0.000{col 56}{space 4} 1.965093{col 69}{space 3} 2.198034
{txt}{space 7}weekend {c |}{col 16}{res}{space 2}-.2858304{col 28}{space 2} .0735571{col 39}{space 1}   -3.89{col 48}{space 3}0.000{col 56}{space 4}-.4299996{col 69}{space 3}-.1416611
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 2.186813{col 28}{space 2} .4040429{col 39}{space 1}    5.41{col 48}{space 3}0.000{col 56}{space 4} 1.394904{col 69}{space 3} 2.978723
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. *outreg2 using 1st_step_robust.doc, append ctitle(Logit PF) addstat("Chi2", e(chi2))
. 
. *****IV Robustness
. ***More Lags
. ***(1) IV 5 Lags
. ivregress 2sls pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend) $lags_controls $fe2, robust
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}    16,386
{txt}{col 1}{col 51}Wald chi2({res}72{txt}){col 67}= {res}   1145.39
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}         .
{txt}{col 51}Root MSE{col 67}=    {res} 1.0265

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}    Robust
{col 1}         pbid_dummy{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}diff_p_id_da {c |}{col 21}{res}{space 2} .3320693{col 33}{space 2} .0386582{col 44}{space 1}    8.59{col 53}{space 3}0.000{col 61}{space 4} .2563007{col 74}{space 3} .4078379
{txt}{space 6}q_total_mg_id {c |}{col 21}{res}{space 2} .3338171{col 33}{space 2} .0279443{col 44}{space 1}   11.95{col 53}{space 3}0.000{col 61}{space 4} .2790472{col 74}{space 3} .3885869
{txt}{space 4}lag_solar_share {c |}{col 21}{res}{space 2} .0096151{col 33}{space 2} .0035185{col 44}{space 1}    2.73{col 53}{space 3}0.006{col 61}{space 4}  .002719{col 74}{space 3} .0165112
{txt}{space 3}lag2_solar_share {c |}{col 21}{res}{space 2}-.0069064{col 33}{space 2} .0036624{col 44}{space 1}   -1.89{col 53}{space 3}0.059{col 61}{space 4}-.0140847{col 74}{space 3} .0002718
{txt}{space 3}lag3_solar_share {c |}{col 21}{res}{space 2}-.0162285{col 33}{space 2} .0041301{col 44}{space 1}   -3.93{col 53}{space 3}0.000{col 61}{space 4}-.0243233{col 74}{space 3}-.0081337
{txt}{space 3}lag4_solar_share {c |}{col 21}{res}{space 2}-.0064896{col 33}{space 2}  .003591{col 44}{space 1}   -1.81{col 53}{space 3}0.071{col 61}{space 4}-.0135277{col 74}{space 3} .0005486
{txt}{space 3}lag5_solar_share {c |}{col 21}{res}{space 2}-.0125658{col 33}{space 2}  .003295{col 44}{space 1}   -3.81{col 53}{space 3}0.000{col 61}{space 4}-.0190239{col 74}{space 3}-.0061077
{txt}{space 5}lag_wind_share {c |}{col 21}{res}{space 2}-.0155429{col 33}{space 2} .0021651{col 44}{space 1}   -7.18{col 53}{space 3}0.000{col 61}{space 4}-.0197865{col 74}{space 3}-.0112993
{txt}{space 4}lag2_wind_share {c |}{col 21}{res}{space 2} .0003238{col 33}{space 2} .0017605{col 44}{space 1}    0.18{col 53}{space 3}0.854{col 61}{space 4}-.0031268{col 74}{space 3} .0037744
{txt}{space 4}lag3_wind_share {c |}{col 21}{res}{space 2}-.0046337{col 33}{space 2} .0018527{col 44}{space 1}   -2.50{col 53}{space 3}0.012{col 61}{space 4} -.008265{col 74}{space 3}-.0010024
{txt}{space 4}lag4_wind_share {c |}{col 21}{res}{space 2} .0002283{col 33}{space 2} .0017232{col 44}{space 1}    0.13{col 53}{space 3}0.895{col 61}{space 4}-.0031491{col 74}{space 3} .0036057
{txt}{space 4}lag5_wind_share {c |}{col 21}{res}{space 2}-.0014592{col 33}{space 2} .0016188{col 44}{space 1}   -0.90{col 53}{space 3}0.367{col 61}{space 4} -.004632{col 74}{space 3} .0017135
{txt}{space 4}lag_hydro_share {c |}{col 21}{res}{space 2}-.0191318{col 33}{space 2} .0039111{col 44}{space 1}   -4.89{col 53}{space 3}0.000{col 61}{space 4}-.0267974{col 74}{space 3}-.0114662
{txt}{space 3}lag2_hydro_share {c |}{col 21}{res}{space 2} .0069847{col 33}{space 2} .0040237{col 44}{space 1}    1.74{col 53}{space 3}0.083{col 61}{space 4}-.0009016{col 74}{space 3}  .014871
{txt}{space 3}lag3_hydro_share {c |}{col 21}{res}{space 2}-.0184711{col 33}{space 2} .0042228{col 44}{space 1}   -4.37{col 53}{space 3}0.000{col 61}{space 4}-.0267476{col 74}{space 3}-.0101947
{txt}{space 3}lag4_hydro_share {c |}{col 21}{res}{space 2}-.0027534{col 33}{space 2} .0041679{col 44}{space 1}   -0.66{col 53}{space 3}0.509{col 61}{space 4}-.0109223{col 74}{space 3} .0054156
{txt}{space 3}lag5_hydro_share {c |}{col 21}{res}{space 2} .0131507{col 33}{space 2}  .003653{col 44}{space 1}    3.60{col 53}{space 3}0.000{col 61}{space 4} .0059909{col 74}{space 3} .0203105
{txt}{space 6}lag_gas_share {c |}{col 21}{res}{space 2}-.0078607{col 33}{space 2} .0029058{col 44}{space 1}   -2.71{col 53}{space 3}0.007{col 61}{space 4} -.013556{col 74}{space 3}-.0021654
{txt}{space 5}lag2_gas_share {c |}{col 21}{res}{space 2}-.0026314{col 33}{space 2} .0031341{col 44}{space 1}   -0.84{col 53}{space 3}0.401{col 61}{space 4}-.0087741{col 74}{space 3} .0035112
{txt}{space 5}lag3_gas_share {c |}{col 21}{res}{space 2} .0016858{col 33}{space 2} .0029137{col 44}{space 1}    0.58{col 53}{space 3}0.563{col 61}{space 4}-.0040249{col 74}{space 3} .0073965
{txt}{space 5}lag4_gas_share {c |}{col 21}{res}{space 2}-.0060035{col 33}{space 2} .0031073{col 44}{space 1}   -1.93{col 53}{space 3}0.053{col 61}{space 4}-.0120936{col 74}{space 3} .0000866
{txt}{space 5}lag5_gas_share {c |}{col 21}{res}{space 2}-.0003847{col 33}{space 2}  .002723{col 44}{space 1}   -0.14{col 53}{space 3}0.888{col 61}{space 4}-.0057216{col 74}{space 3} .0049522
{txt}{space 5}lag_coal_share {c |}{col 21}{res}{space 2}-.0026698{col 33}{space 2} .0049869{col 44}{space 1}   -0.54{col 53}{space 3}0.592{col 61}{space 4}-.0124438{col 74}{space 3} .0071043
{txt}{space 4}lag2_coal_share {c |}{col 21}{res}{space 2} .0030546{col 33}{space 2} .0061876{col 44}{space 1}    0.49{col 53}{space 3}0.622{col 61}{space 4} -.009073{col 74}{space 3} .0151821
{txt}{space 4}lag3_coal_share {c |}{col 21}{res}{space 2}-.0127882{col 33}{space 2} .0066688{col 44}{space 1}   -1.92{col 53}{space 3}0.055{col 61}{space 4}-.0258587{col 74}{space 3} .0002824
{txt}{space 4}lag4_coal_share {c |}{col 21}{res}{space 2} .0199709{col 33}{space 2} .0066747{col 44}{space 1}    2.99{col 53}{space 3}0.003{col 61}{space 4} .0068888{col 74}{space 3}  .033053
{txt}{space 4}lag5_coal_share {c |}{col 21}{res}{space 2} -.000358{col 33}{space 2} .0048524{col 44}{space 1}   -0.07{col 53}{space 3}0.941{col 61}{space 4}-.0098685{col 74}{space 3} .0091526
{txt}{space 7}lag_load_ACT {c |}{col 21}{res}{space 2}-.0062498{col 33}{space 2} .0037911{col 44}{space 1}   -1.65{col 53}{space 3}0.099{col 61}{space 4}-.0136801{col 74}{space 3} .0011806
{txt}{space 6}lag2_load_ACT {c |}{col 21}{res}{space 2} .0086575{col 33}{space 2} .0043098{col 44}{space 1}    2.01{col 53}{space 3}0.045{col 61}{space 4} .0002104{col 74}{space 3} .0171045
{txt}{space 6}lag3_load_ACT {c |}{col 21}{res}{space 2} .0130667{col 33}{space 2} .0043886{col 44}{space 1}    2.98{col 53}{space 3}0.003{col 61}{space 4} .0044651{col 74}{space 3} .0216683
{txt}{space 6}lag4_load_ACT {c |}{col 21}{res}{space 2}-.0120339{col 33}{space 2} .0043833{col 44}{space 1}   -2.75{col 53}{space 3}0.006{col 61}{space 4} -.020625{col 74}{space 3}-.0034428
{txt}{space 6}lag5_load_ACT {c |}{col 21}{res}{space 2} -.005616{col 33}{space 2} .0035051{col 44}{space 1}   -1.60{col 53}{space 3}0.109{col 61}{space 4}-.0124859{col 74}{space 3}  .001254
{txt}{space 1}lag_solar_fc_error {c |}{col 21}{res}{space 2}-.0537765{col 33}{space 2} .0535472{col 44}{space 1}   -1.00{col 53}{space 3}0.315{col 61}{space 4}-.1587272{col 74}{space 3} .0511742
{txt}lag2_solar_fc_error {c |}{col 21}{res}{space 2}-.0559691{col 33}{space 2} .0599753{col 44}{space 1}   -0.93{col 53}{space 3}0.351{col 61}{space 4}-.1735186{col 74}{space 3} .0615804
{txt}lag3_solar_fc_error {c |}{col 21}{res}{space 2} .0483942{col 33}{space 2} .0534948{col 44}{space 1}    0.90{col 53}{space 3}0.366{col 61}{space 4}-.0564536{col 74}{space 3}  .153242
{txt}lag4_solar_fc_error {c |}{col 21}{res}{space 2} .2059062{col 33}{space 2} .0600699{col 44}{space 1}    3.43{col 53}{space 3}0.001{col 61}{space 4} .0881714{col 74}{space 3}  .323641
{txt}lag5_solar_fc_error {c |}{col 21}{res}{space 2} .0754525{col 33}{space 2} .0537854{col 44}{space 1}    1.40{col 53}{space 3}0.161{col 61}{space 4} -.029965{col 74}{space 3}   .18087
{txt}{space 2}lag_wind_fc_error {c |}{col 21}{res}{space 2}-.1252233{col 33}{space 2} .0908911{col 44}{space 1}   -1.38{col 53}{space 3}0.168{col 61}{space 4}-.3033667{col 74}{space 3} .0529201
{txt}{space 1}lag2_wind_fc_error {c |}{col 21}{res}{space 2}-.0418838{col 33}{space 2} .0872753{col 44}{space 1}   -0.48{col 53}{space 3}0.631{col 61}{space 4}-.2129402{col 74}{space 3} .1291726
{txt}{space 1}lag3_wind_fc_error {c |}{col 21}{res}{space 2}-.2358199{col 33}{space 2} .0850619{col 44}{space 1}   -2.77{col 53}{space 3}0.006{col 61}{space 4}-.4025383{col 74}{space 3}-.0691016
{txt}{space 1}lag4_wind_fc_error {c |}{col 21}{res}{space 2}  .059624{col 33}{space 2} .0922501{col 44}{space 1}    0.65{col 53}{space 3}0.518{col 61}{space 4} -.121183{col 74}{space 3} .2404309
{txt}{space 1}lag5_wind_fc_error {c |}{col 21}{res}{space 2}-.0125321{col 33}{space 2} .0853181{col 44}{space 1}   -0.15{col 53}{space 3}0.883{col 61}{space 4}-.1797526{col 74}{space 3} .1546883
{txt}{space 2}lag_load_fc_error {c |}{col 21}{res}{space 2} 3.547571{col 33}{space 2} .7060817{col 44}{space 1}    5.02{col 53}{space 3}0.000{col 61}{space 4} 2.163676{col 74}{space 3} 4.931466
{txt}{space 1}lag2_load_fc_error {c |}{col 21}{res}{space 2} 3.112727{col 33}{space 2} .5880479{col 44}{space 1}    5.29{col 53}{space 3}0.000{col 61}{space 4} 1.960174{col 74}{space 3}  4.26528
{txt}{space 1}lag3_load_fc_error {c |}{col 21}{res}{space 2}  .574719{col 33}{space 2} .4778151{col 44}{space 1}    1.20{col 53}{space 3}0.229{col 61}{space 4}-.3617813{col 74}{space 3} 1.511219
{txt}{space 1}lag4_load_fc_error {c |}{col 21}{res}{space 2}-.9833745{col 33}{space 2} .4698776{col 44}{space 1}   -2.09{col 53}{space 3}0.036{col 61}{space 4}-1.904318{col 74}{space 3}-.0624314
{txt}{space 1}lag5_load_fc_error {c |}{col 21}{res}{space 2} 1.236903{col 33}{space 2} .5096128{col 44}{space 1}    2.43{col 53}{space 3}0.015{col 61}{space 4} .2380804{col 74}{space 3} 2.235726
{txt}{space 7}lag_co2price {c |}{col 21}{res}{space 2}-.0132107{col 33}{space 2}  .014703{col 44}{space 1}   -0.90{col 53}{space 3}0.369{col 61}{space 4}-.0420281{col 74}{space 3} .0156066
{txt}{space 6}lag2_co2price {c |}{col 21}{res}{space 2}-.0090268{col 33}{space 2} .0203113{col 44}{space 1}   -0.44{col 53}{space 3}0.657{col 61}{space 4}-.0488362{col 74}{space 3} .0307825
{txt}{space 6}lag3_co2price {c |}{col 21}{res}{space 2} .0194524{col 33}{space 2} .0215707{col 44}{space 1}    0.90{col 53}{space 3}0.367{col 61}{space 4}-.0228254{col 74}{space 3} .0617303
{txt}{space 6}lag4_co2price {c |}{col 21}{res}{space 2}-.0084672{col 33}{space 2} .0216725{col 44}{space 1}   -0.39{col 53}{space 3}0.696{col 61}{space 4}-.0509445{col 74}{space 3} .0340101
{txt}{space 6}lag5_co2price {c |}{col 21}{res}{space 2} .0364836{col 33}{space 2} .0155556{col 44}{space 1}    2.35{col 53}{space 3}0.019{col 61}{space 4} .0059952{col 74}{space 3} .0669719
{txt}{space 7}lag_gasprice {c |}{col 21}{res}{space 2}-.0659213{col 33}{space 2} .0151479{col 44}{space 1}   -4.35{col 53}{space 3}0.000{col 61}{space 4}-.0956107{col 74}{space 3} -.036232
{txt}{space 6}lag2_gasprice {c |}{col 21}{res}{space 2} .0203521{col 33}{space 2} .0201671{col 44}{space 1}    1.01{col 53}{space 3}0.313{col 61}{space 4}-.0191748{col 74}{space 3}  .059879
{txt}{space 6}lag3_gasprice {c |}{col 21}{res}{space 2}-.0145214{col 33}{space 2} .0200744{col 44}{space 1}   -0.72{col 53}{space 3}0.469{col 61}{space 4}-.0538664{col 74}{space 3} .0248236
{txt}{space 6}lag4_gasprice {c |}{col 21}{res}{space 2} .0852809{col 33}{space 2} .0216194{col 44}{space 1}    3.94{col 53}{space 3}0.000{col 61}{space 4} .0429076{col 74}{space 3} .1276542
{txt}{space 6}lag5_gasprice {c |}{col 21}{res}{space 2}-.0690506{col 33}{space 2} .0160269{col 44}{space 1}   -4.31{col 53}{space 3}0.000{col 61}{space 4}-.1004627{col 74}{space 3}-.0376384
{txt}{space 13}_Iyq_2 {c |}{col 21}{res}{space 2} .0461634{col 33}{space 2} .0595135{col 44}{space 1}    0.78{col 53}{space 3}0.438{col 61}{space 4}-.0704809{col 74}{space 3} .1628077
{txt}{space 13}_Iyq_3 {c |}{col 21}{res}{space 2} .2593297{col 33}{space 2} .0698845{col 44}{space 1}    3.71{col 53}{space 3}0.000{col 61}{space 4} .1223586{col 74}{space 3} .3963008
{txt}{space 13}_Iyq_4 {c |}{col 21}{res}{space 2}-.1467648{col 33}{space 2}  .069388{col 44}{space 1}   -2.12{col 53}{space 3}0.034{col 61}{space 4}-.2827629{col 74}{space 3}-.0107667
{txt}{space 13}_Iyq_5 {c |}{col 21}{res}{space 2}-.0103271{col 33}{space 2} .0674085{col 44}{space 1}   -0.15{col 53}{space 3}0.878{col 61}{space 4}-.1424453{col 74}{space 3} .1217911
{txt}{space 13}_Iyq_6 {c |}{col 21}{res}{space 2}  .233633{col 33}{space 2} .0922469{col 44}{space 1}    2.53{col 53}{space 3}0.011{col 61}{space 4} .0528324{col 74}{space 3} .4144337
{txt}{space 13}_Iyq_7 {c |}{col 21}{res}{space 2}-.0235359{col 33}{space 2} .0926959{col 44}{space 1}   -0.25{col 53}{space 3}0.800{col 61}{space 4}-.2052165{col 74}{space 3} .1581447
{txt}{space 13}_Iyq_8 {c |}{col 21}{res}{space 2} .2196744{col 33}{space 2} .1205303{col 44}{space 1}    1.82{col 53}{space 3}0.068{col 61}{space 4}-.0165606{col 74}{space 3} .4559094
{txt}{space 13}_Iyq_9 {c |}{col 21}{res}{space 2} .0233169{col 33}{space 2} .1181043{col 44}{space 1}    0.20{col 53}{space 3}0.843{col 61}{space 4}-.2081632{col 74}{space 3}  .254797
{txt}{space 12}_Iyq_10 {c |}{col 21}{res}{space 2}-.2079868{col 33}{space 2} .1396879{col 44}{space 1}   -1.49{col 53}{space 3}0.137{col 61}{space 4}-.4817701{col 74}{space 3} .0657965
{txt}{space 12}_Iyq_11 {c |}{col 21}{res}{space 2}-.4835529{col 33}{space 2} .1550186{col 44}{space 1}   -3.12{col 53}{space 3}0.002{col 61}{space 4}-.7873839{col 74}{space 3} -.179722
{txt}{space 12}_Iyq_12 {c |}{col 21}{res}{space 2}-.0924312{col 33}{space 2}  .149594{col 44}{space 1}   -0.62{col 53}{space 3}0.537{col 61}{space 4}-.3856301{col 74}{space 3} .2007677
{txt}{space 12}_Iyq_13 {c |}{col 21}{res}{space 2}-.4299939{col 33}{space 2} .1389088{col 44}{space 1}   -3.10{col 53}{space 3}0.002{col 61}{space 4}-.7022502{col 74}{space 3}-.1577376
{txt}{space 12}_Iyq_14 {c |}{col 21}{res}{space 2}-.1037693{col 33}{space 2} .1463028{col 44}{space 1}   -0.71{col 53}{space 3}0.478{col 61}{space 4}-.3905175{col 74}{space 3} .1829788
{txt}{space 12}_Iyq_15 {c |}{col 21}{res}{space 2}-.6031603{col 33}{space 2} .1668892{col 44}{space 1}   -3.61{col 53}{space 3}0.000{col 61}{space 4}-.9302572{col 74}{space 3}-.2760635
{txt}{space 12}_Iyq_16 {c |}{col 21}{res}{space 2}-.4825563{col 33}{space 2}  .163726{col 44}{space 1}   -2.95{col 53}{space 3}0.003{col 61}{space 4}-.8034534{col 74}{space 3}-.1616592
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} .5914005{col 33}{space 2} .1870358{col 44}{space 1}    3.16{col 53}{space 3}0.002{col 61}{space 4} .2248171{col 74}{space 3} .9579839
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 89}Instrumented: {res:diff_p_id_da q_total_mg_id}{p_end}
{p 0 14 89}{space 1}Instruments: {res:lag_solar_share lag2_solar_share lag3_solar_share lag4_solar_share lag5_solar_share lag_wind_share lag2_wind_share lag3_wind_share lag4_wind_share lag5_wind_share lag_hydro_share lag2_hydro_share lag3_hydro_share lag4_hydro_share lag5_hydro_share lag_gas_share lag2_gas_share lag3_gas_share lag4_gas_share lag5_gas_share lag_coal_share lag2_coal_share lag3_coal_share lag4_coal_share lag5_coal_share lag_load_ACT lag2_load_ACT lag3_load_ACT lag4_load_ACT lag5_load_ACT lag_solar_fc_error lag2_solar_fc_error lag3_solar_fc_error lag4_solar_fc_error lag5_solar_fc_error lag_wind_fc_error lag2_wind_fc_error lag3_wind_fc_error lag4_wind_fc_error lag5_wind_fc_error lag_load_fc_error lag2_load_fc_error lag3_load_fc_error lag4_load_fc_error lag5_load_fc_error lag_co2price lag2_co2price lag3_co2price lag4_co2price lag5_co2price lag_gasprice lag2_gasprice lag3_gasprice lag4_gasprice lag5_gasprice _Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 afternoon weekend}{p_end}

{com}. *outreg2 using 1st_step_robust2.doc, replace ctitle(IV 5 Lags) 
. 
. ***Fewer Controls and FE
. **(2) IV PF
. ivregress 2sls pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend) solar_share wind_share hydro_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe3, robust 
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}    16,460
{txt}{col 1}{col 51}Wald chi2({res}14{txt}){col 67}= {res}   1829.50
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}         .
{txt}{col 51}Root MSE{col 67}=    {res} .57504

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}    pbid_dummy{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}diff_p_id_da {c |}{col 16}{res}{space 2} .1220402{col 28}{space 2} .0190491{col 39}{space 1}    6.41{col 48}{space 3}0.000{col 56}{space 4} .0847046{col 69}{space 3} .1593757
{txt}{space 1}q_total_mg_id {c |}{col 16}{res}{space 2} .3202133{col 28}{space 2} .0173133{col 39}{space 1}   18.50{col 48}{space 3}0.000{col 56}{space 4} .2862798{col 69}{space 3} .3541468
{txt}{space 3}solar_share {c |}{col 16}{res}{space 2}-.0063668{col 28}{space 2} .0013568{col 39}{space 1}   -4.69{col 48}{space 3}0.000{col 56}{space 4} -.009026{col 69}{space 3}-.0037075
{txt}{space 4}wind_share {c |}{col 16}{res}{space 2}-.0055666{col 28}{space 2} .0007769{col 39}{space 1}   -7.16{col 48}{space 3}0.000{col 56}{space 4}-.0070893{col 69}{space 3}-.0040439
{txt}{space 3}hydro_share {c |}{col 16}{res}{space 2}-.0112901{col 28}{space 2} .0017422{col 39}{space 1}   -6.48{col 48}{space 3}0.000{col 56}{space 4}-.0147047{col 69}{space 3}-.0078755
{txt}{space 6}load_ACT {c |}{col 16}{res}{space 2}-.0275877{col 28}{space 2} .0020087{col 39}{space 1}  -13.73{col 48}{space 3}0.000{col 56}{space 4}-.0315246{col 69}{space 3}-.0236508
{txt}solar_fc_error {c |}{col 16}{res}{space 2} .0234007{col 28}{space 2} .0258451{col 39}{space 1}    0.91{col 48}{space 3}0.365{col 56}{space 4}-.0272547{col 69}{space 3} .0740562
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2}-.5607431{col 28}{space 2} .0722799{col 39}{space 1}   -7.76{col 48}{space 3}0.000{col 56}{space 4}-.7024091{col 69}{space 3}-.4190771
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2}-1.193206{col 28}{space 2}  .303705{col 39}{space 1}   -3.93{col 48}{space 3}0.000{col 56}{space 4}-1.788456{col 69}{space 3}-.5979549
{txt}{space 6}co2price {c |}{col 16}{res}{space 2}-.0177799{col 28}{space 2} .0018233{col 39}{space 1}   -9.75{col 48}{space 3}0.000{col 56}{space 4}-.0213536{col 69}{space 3}-.0142062
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2}-.0179125{col 28}{space 2} .0016854{col 39}{space 1}  -10.63{col 48}{space 3}0.000{col 56}{space 4}-.0212159{col 69}{space 3}-.0146092
{txt}{space 3}_Iyear_2018 {c |}{col 16}{res}{space 2} .2921843{col 28}{space 2} .0291148{col 39}{space 1}   10.04{col 48}{space 3}0.000{col 56}{space 4} .2351204{col 69}{space 3} .3492483
{txt}{space 3}_Iyear_2019 {c |}{col 16}{res}{space 2} .3260686{col 28}{space 2} .0388511{col 39}{space 1}    8.39{col 48}{space 3}0.000{col 56}{space 4} .2499218{col 69}{space 3} .4022153
{txt}{space 3}_Iyear_2020 {c |}{col 16}{res}{space 2} .0843617{col 28}{space 2} .0439387{col 39}{space 1}    1.92{col 48}{space 3}0.055{col 56}{space 4}-.0017565{col 69}{space 3} .1704798
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .8146069{col 28}{space 2} .0567922{col 39}{space 1}   14.34{col 48}{space 3}0.000{col 56}{space 4} .7032962{col 69}{space 3} .9259176
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 94}Instrumented: {res:diff_p_id_da q_total_mg_id}{p_end}
{p 0 14 94}{space 1}Instruments: {res:solar_share wind_share hydro_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice _Iyear_2018 _Iyear_2019 _Iyear_2020 afternoon weekend}{p_end}

{com}. *outreg2 using 1st_step_robust2.doc, append ctitle(IV PF small) addstat("Chi2", e(chi2))
. *estat firststage
. *estat overid
. 
. ***More Controls and FE
. **(3) IV PF
. ivregress 2sls pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend) solar_share wind_share hydro_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice  oil_share gas_share coal_share other_share $fe4, robust 
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}    16,460
{txt}{col 1}{col 51}Wald chi2({res}29{txt}){col 67}= {res}   3716.85
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}         .
{txt}{col 51}Root MSE{col 67}=    {res} .49512

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}    pbid_dummy{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}diff_p_id_da {c |}{col 16}{res}{space 2}   .05175{col 28}{space 2}  .021686{col 39}{space 1}    2.39{col 48}{space 3}0.017{col 56}{space 4} .0092461{col 69}{space 3} .0942538
{txt}{space 1}q_total_mg_id {c |}{col 16}{res}{space 2} .3798094{col 28}{space 2} .0237339{col 39}{space 1}   16.00{col 48}{space 3}0.000{col 56}{space 4} .3332918{col 69}{space 3} .4263271
{txt}{space 3}solar_share {c |}{col 16}{res}{space 2}-.0062869{col 28}{space 2} .0016365{col 39}{space 1}   -3.84{col 48}{space 3}0.000{col 56}{space 4}-.0094943{col 69}{space 3}-.0030795
{txt}{space 4}wind_share {c |}{col 16}{res}{space 2}-.0089083{col 28}{space 2} .0010774{col 39}{space 1}   -8.27{col 48}{space 3}0.000{col 56}{space 4}-.0110199{col 69}{space 3}-.0067967
{txt}{space 3}hydro_share {c |}{col 16}{res}{space 2}-.0166681{col 28}{space 2} .0021798{col 39}{space 1}   -7.65{col 48}{space 3}0.000{col 56}{space 4}-.0209405{col 69}{space 3}-.0123958
{txt}{space 6}load_ACT {c |}{col 16}{res}{space 2}-.0349749{col 28}{space 2} .0039905{col 39}{space 1}   -8.76{col 48}{space 3}0.000{col 56}{space 4}-.0427961{col 69}{space 3}-.0271536
{txt}solar_fc_error {c |}{col 16}{res}{space 2} .0125727{col 28}{space 2} .0211886{col 39}{space 1}    0.59{col 48}{space 3}0.553{col 56}{space 4}-.0289562{col 69}{space 3} .0541016
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2}-.2943271{col 28}{space 2} .0688671{col 39}{space 1}   -4.27{col 48}{space 3}0.000{col 56}{space 4}-.4293041{col 69}{space 3}  -.15935
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2} -1.96261{col 28}{space 2} .2783289{col 39}{space 1}   -7.05{col 48}{space 3}0.000{col 56}{space 4}-2.508125{col 69}{space 3}-1.417096
{txt}{space 6}co2price {c |}{col 16}{res}{space 2} .0008329{col 28}{space 2} .0029743{col 39}{space 1}    0.28{col 48}{space 3}0.779{col 56}{space 4}-.0049967{col 69}{space 3} .0066625
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2}-.0204154{col 28}{space 2} .0023006{col 39}{space 1}   -8.87{col 48}{space 3}0.000{col 56}{space 4}-.0249245{col 69}{space 3}-.0159064
{txt}{space 5}oil_share {c |}{col 16}{res}{space 2} .1181959{col 28}{space 2} .0564105{col 39}{space 1}    2.10{col 48}{space 3}0.036{col 56}{space 4} .0076333{col 69}{space 3} .2287584
{txt}{space 5}gas_share {c |}{col 16}{res}{space 2}-.0113424{col 28}{space 2} .0013071{col 39}{space 1}   -8.68{col 48}{space 3}0.000{col 56}{space 4}-.0139042{col 69}{space 3}-.0087806
{txt}{space 4}coal_share {c |}{col 16}{res}{space 2}-.0047849{col 28}{space 2} .0020281{col 39}{space 1}   -2.36{col 48}{space 3}0.018{col 56}{space 4}-.0087599{col 69}{space 3}-.0008099
{txt}{space 3}other_share {c |}{col 16}{res}{space 2}-.0163814{col 28}{space 2} .0219905{col 39}{space 1}   -0.74{col 48}{space 3}0.456{col 56}{space 4} -.059482{col 69}{space 3} .0267193
{txt}{space 3}_Iyear_2018 {c |}{col 16}{res}{space 2} .0625845{col 28}{space 2} .0291749{col 39}{space 1}    2.15{col 48}{space 3}0.032{col 56}{space 4} .0054028{col 69}{space 3} .1197661
{txt}{space 3}_Iyear_2019 {c |}{col 16}{res}{space 2} .0159477{col 28}{space 2} .0479469{col 39}{space 1}    0.33{col 48}{space 3}0.739{col 56}{space 4}-.0780265{col 69}{space 3} .1099219
{txt}{space 3}_Iyear_2020 {c |}{col 16}{res}{space 2}-.2561701{col 28}{space 2} .0538393{col 39}{space 1}   -4.76{col 48}{space 3}0.000{col 56}{space 4}-.3616932{col 69}{space 3}-.1506471
{txt}{space 5}_Imonth_2 {c |}{col 16}{res}{space 2}-.0293332{col 28}{space 2}  .022954{col 39}{space 1}   -1.28{col 48}{space 3}0.201{col 56}{space 4}-.0743223{col 69}{space 3} .0156558
{txt}{space 5}_Imonth_3 {c |}{col 16}{res}{space 2}-.1656586{col 28}{space 2} .0267971{col 39}{space 1}   -6.18{col 48}{space 3}0.000{col 56}{space 4}-.2181799{col 69}{space 3}-.1131373
{txt}{space 5}_Imonth_4 {c |}{col 16}{res}{space 2}-.2699347{col 28}{space 2} .0339795{col 39}{space 1}   -7.94{col 48}{space 3}0.000{col 56}{space 4}-.3365333{col 69}{space 3}-.2033362
{txt}{space 5}_Imonth_5 {c |}{col 16}{res}{space 2}-.1783327{col 28}{space 2} .0273045{col 39}{space 1}   -6.53{col 48}{space 3}0.000{col 56}{space 4}-.2318485{col 69}{space 3}-.1248169
{txt}{space 5}_Imonth_6 {c |}{col 16}{res}{space 2}-.1146944{col 28}{space 2} .0251871{col 39}{space 1}   -4.55{col 48}{space 3}0.000{col 56}{space 4}-.1640602{col 69}{space 3}-.0653285
{txt}{space 5}_Imonth_7 {c |}{col 16}{res}{space 2} -.055803{col 28}{space 2} .0246686{col 39}{space 1}   -2.26{col 48}{space 3}0.024{col 56}{space 4}-.1041526{col 69}{space 3}-.0074534
{txt}{space 5}_Imonth_8 {c |}{col 16}{res}{space 2}-.4046984{col 28}{space 2} .0274419{col 39}{space 1}  -14.75{col 48}{space 3}0.000{col 56}{space 4}-.4584835{col 69}{space 3}-.3509133
{txt}{space 5}_Imonth_9 {c |}{col 16}{res}{space 2}-.3348224{col 28}{space 2} .0282751{col 39}{space 1}  -11.84{col 48}{space 3}0.000{col 56}{space 4}-.3902406{col 69}{space 3}-.2794043
{txt}{space 4}_Imonth_10 {c |}{col 16}{res}{space 2}-.3625589{col 28}{space 2} .0293135{col 39}{space 1}  -12.37{col 48}{space 3}0.000{col 56}{space 4}-.4200123{col 69}{space 3}-.3051054
{txt}{space 4}_Imonth_11 {c |}{col 16}{res}{space 2}-.2946566{col 28}{space 2} .0266891{col 39}{space 1}  -11.04{col 48}{space 3}0.000{col 56}{space 4}-.3469662{col 69}{space 3} -.242347
{txt}{space 4}_Imonth_12 {c |}{col 16}{res}{space 2}-.1449017{col 28}{space 2} .0291144{col 39}{space 1}   -4.98{col 48}{space 3}0.000{col 56}{space 4}-.2019648{col 69}{space 3}-.0878386
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1.413066{col 28}{space 2} .1504612{col 39}{space 1}    9.39{col 48}{space 3}0.000{col 56}{space 4} 1.118168{col 69}{space 3} 1.707965
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 94}Instrumented: {res:diff_p_id_da q_total_mg_id}{p_end}
{p 0 14 94}{space 1}Instruments: {res:solar_share wind_share hydro_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice oil_share gas_share coal_share other_share _Iyear_2018 _Iyear_2019 _Iyear_2020 _Imonth_2 _Imonth_3 _Imonth_4 _Imonth_5 _Imonth_6 _Imonth_7 _Imonth_8 _Imonth_9 _Imonth_10 _Imonth_11 _Imonth_12 afternoon weekend}{p_end}

{com}. *outreg2 using 1st_step_robust2.doc, append ctitle(IV PF large) addstat("Chi2", e(chi2))
. *estat firststage
. *estat overid
. 
. ****Mean ID price instead of max ID price 
. ***(1) IV PF
. ivregress 2sls pbid_dummy (diff_p_id_da_m q_total_mg_id = afternoon weekend) solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe2, robust 
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}    16,460
{txt}{col 1}{col 51}Wald chi2({res}28{txt}){col 67}= {res}   2105.50
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}         .
{txt}{col 51}Root MSE{col 67}=    {res} .71578

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}    pbid_dummy{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
diff_p_id_da_m {c |}{col 16}{res}{space 2} .2263762{col 28}{space 2} .0544834{col 39}{space 1}    4.15{col 48}{space 3}0.000{col 56}{space 4} .1195906{col 69}{space 3} .3331617
{txt}{space 1}q_total_mg_id {c |}{col 16}{res}{space 2} .3895604{col 28}{space 2} .0235394{col 39}{space 1}   16.55{col 48}{space 3}0.000{col 56}{space 4}  .343424{col 69}{space 3} .4356969
{txt}{space 3}solar_share {c |}{col 16}{res}{space 2}-.0138903{col 28}{space 2}  .002296{col 39}{space 1}   -6.05{col 48}{space 3}0.000{col 56}{space 4}-.0183904{col 69}{space 3}-.0093902
{txt}{space 4}wind_share {c |}{col 16}{res}{space 2} -.011797{col 28}{space 2} .0014225{col 39}{space 1}   -8.29{col 48}{space 3}0.000{col 56}{space 4} -.014585{col 69}{space 3} -.009009
{txt}{space 3}hydro_share {c |}{col 16}{res}{space 2}-.0348583{col 28}{space 2} .0047278{col 39}{space 1}   -7.37{col 48}{space 3}0.000{col 56}{space 4}-.0441246{col 69}{space 3}-.0255921
{txt}{space 5}gas_share {c |}{col 16}{res}{space 2}-.0167119{col 28}{space 2} .0020399{col 39}{space 1}   -8.19{col 48}{space 3}0.000{col 56}{space 4}-.0207099{col 69}{space 3}-.0127139
{txt}{space 4}coal_share {c |}{col 16}{res}{space 2} .0002752{col 28}{space 2} .0028227{col 39}{space 1}    0.10{col 48}{space 3}0.922{col 56}{space 4}-.0052572{col 69}{space 3} .0058076
{txt}{space 6}load_ACT {c |}{col 16}{res}{space 2}-.0354116{col 28}{space 2}  .003377{col 39}{space 1}  -10.49{col 48}{space 3}0.000{col 56}{space 4}-.0420304{col 69}{space 3}-.0287928
{txt}solar_fc_error {c |}{col 16}{res}{space 2} .0287296{col 28}{space 2} .0320599{col 39}{space 1}    0.90{col 48}{space 3}0.370{col 56}{space 4}-.0341066{col 69}{space 3} .0915658
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2}-.8315829{col 28}{space 2}  .161449{col 39}{space 1}   -5.15{col 48}{space 3}0.000{col 56}{space 4}-1.148017{col 69}{space 3}-.5151487
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2}-2.052447{col 28}{space 2} .3373587{col 39}{space 1}   -6.08{col 48}{space 3}0.000{col 56}{space 4}-2.713658{col 69}{space 3}-1.391236
{txt}{space 6}co2price {c |}{col 16}{res}{space 2} .0183728{col 28}{space 2}  .003562{col 39}{space 1}    5.16{col 48}{space 3}0.000{col 56}{space 4} .0113914{col 69}{space 3} .0253542
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2}-.0151382{col 28}{space 2}  .004659{col 39}{space 1}   -3.25{col 48}{space 3}0.001{col 56}{space 4}-.0242697{col 69}{space 3}-.0060068
{txt}{space 8}_Iyq_2 {c |}{col 16}{res}{space 2}-.0462173{col 28}{space 2} .0420319{col 39}{space 1}   -1.10{col 48}{space 3}0.272{col 56}{space 4}-.1285982{col 69}{space 3} .0361637
{txt}{space 8}_Iyq_3 {c |}{col 16}{res}{space 2}  .037666{col 28}{space 2} .0430918{col 39}{space 1}    0.87{col 48}{space 3}0.382{col 56}{space 4}-.0467925{col 69}{space 3} .1221244
{txt}{space 8}_Iyq_4 {c |}{col 16}{res}{space 2} -.318887{col 28}{space 2} .0558826{col 39}{space 1}   -5.71{col 48}{space 3}0.000{col 56}{space 4} -.428415{col 69}{space 3}-.2093591
{txt}{space 8}_Iyq_5 {c |}{col 16}{res}{space 2} .0330411{col 28}{space 2} .0469312{col 39}{space 1}    0.70{col 48}{space 3}0.481{col 56}{space 4}-.0589423{col 69}{space 3} .1250246
{txt}{space 8}_Iyq_6 {c |}{col 16}{res}{space 2} .0946329{col 28}{space 2} .0794354{col 39}{space 1}    1.19{col 48}{space 3}0.234{col 56}{space 4}-.0610577{col 69}{space 3} .2503235
{txt}{space 8}_Iyq_7 {c |}{col 16}{res}{space 2}-.3751596{col 28}{space 2} .0663201{col 39}{space 1}   -5.66{col 48}{space 3}0.000{col 56}{space 4}-.5051446{col 69}{space 3}-.2451746
{txt}{space 8}_Iyq_8 {c |}{col 16}{res}{space 2}-.1752641{col 28}{space 2} .0918673{col 39}{space 1}   -1.91{col 48}{space 3}0.056{col 56}{space 4}-.3553207{col 69}{space 3} .0047926
{txt}{space 8}_Iyq_9 {c |}{col 16}{res}{space 2}-.1871987{col 28}{space 2}  .078128{col 39}{space 1}   -2.40{col 48}{space 3}0.017{col 56}{space 4}-.3403269{col 69}{space 3}-.0340706
{txt}{space 7}_Iyq_10 {c |}{col 16}{res}{space 2}-.3419766{col 28}{space 2} .0906034{col 39}{space 1}   -3.77{col 48}{space 3}0.000{col 56}{space 4} -.519556{col 69}{space 3}-.1643971
{txt}{space 7}_Iyq_11 {c |}{col 16}{res}{space 2}-.4083907{col 28}{space 2} .1052053{col 39}{space 1}   -3.88{col 48}{space 3}0.000{col 56}{space 4}-.6145892{col 69}{space 3}-.2021922
{txt}{space 7}_Iyq_12 {c |}{col 16}{res}{space 2}-.0438408{col 28}{space 2} .0996184{col 39}{space 1}   -0.44{col 48}{space 3}0.660{col 56}{space 4}-.2390893{col 69}{space 3} .1514077
{txt}{space 7}_Iyq_13 {c |}{col 16}{res}{space 2}-.2475672{col 28}{space 2} .0906327{col 39}{space 1}   -2.73{col 48}{space 3}0.006{col 56}{space 4} -.425204{col 69}{space 3}-.0699304
{txt}{space 7}_Iyq_14 {c |}{col 16}{res}{space 2}-.2053001{col 28}{space 2} .0934756{col 39}{space 1}   -2.20{col 48}{space 3}0.028{col 56}{space 4} -.388509{col 69}{space 3}-.0220913
{txt}{space 7}_Iyq_15 {c |}{col 16}{res}{space 2}-.6273212{col 28}{space 2} .1072909{col 39}{space 1}   -5.85{col 48}{space 3}0.000{col 56}{space 4}-.8376076{col 69}{space 3}-.4170349
{txt}{space 7}_Iyq_16 {c |}{col 16}{res}{space 2}-.6949134{col 28}{space 2} .1100781{col 39}{space 1}   -6.31{col 48}{space 3}0.000{col 56}{space 4}-.9106626{col 69}{space 3}-.4791642
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1.581738{col 28}{space 2} .2191075{col 39}{space 1}    7.22{col 48}{space 3}0.000{col 56}{space 4} 1.152295{col 69}{space 3}  2.01118
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 94}Instrumented: {res:diff_p_id_da_m q_total_mg_id}{p_end}
{p 0 14 94}{space 1}Instruments: {res:solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice _Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 afternoon weekend}{p_end}

{com}. 
. 
. ****IV Probit Robustness
. ***More Lags
. ***(1) IV 5 Lags
. ivprobit pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend) $lags_controls $fe2
{res}
{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-8539.3793}  
Iteration 1:{space 3}log likelihood = {res:-5784.1393}  
Iteration 2:{space 3}log likelihood = {res:-5726.9157}  
Iteration 3:{space 3}log likelihood = {res:-5726.8022}  
Iteration 4:{space 3}log likelihood = {res:-5726.8022}  
{res}
{txt}Fitting full model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-65086.959}  
Iteration 1:{space 3}log likelihood = {res:-65086.796}  
Iteration 2:{space 3}log likelihood = {res:-65086.796}  

{col 1}Probit model with endogenous regressors{col 55}{lalign 13:Number of obs}{col 68} = {res}{ralign 8:16,386}
{txt}{col 55}{lalign 13:Wald chi2({res:72})}{col 68} = {res}{ralign 8:24748.11}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-65086.796}{txt}{col 55}{lalign 13:Prob > chi2}{col 68} = {res}{ralign 8:0.0000}

{txt}{hline 37}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 38}{c |} Coefficient{col 50}  Std. err.{col 62}      z{col 70}   P>|z|{col 78}     [95% con{col 91}f. interval]
{hline 37}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 24}diff_p_id_da {c |}{col 38}{res}{space 2} .3334032{col 50}{space 2} .0053346{col 61}{space 1}   62.50{col 70}{space 3}0.000{col 78}{space 4} .3229476{col 91}{space 3} .3438589
{txt}{space 23}q_total_mg_id {c |}{col 38}{res}{space 2} .3448099{col 50}{space 2}  .030074{col 61}{space 1}   11.47{col 70}{space 3}0.000{col 78}{space 4} .2858658{col 91}{space 3} .4037539
{txt}{space 21}lag_solar_share {c |}{col 38}{res}{space 2} .0103617{col 50}{space 2} .0031382{col 61}{space 1}    3.30{col 70}{space 3}0.001{col 78}{space 4}  .004211{col 91}{space 3} .0165123
{txt}{space 20}lag2_solar_share {c |}{col 38}{res}{space 2} -.007473{col 50}{space 2} .0036472{col 61}{space 1}   -2.05{col 70}{space 3}0.040{col 78}{space 4}-.0146214{col 91}{space 3}-.0003247
{txt}{space 20}lag3_solar_share {c |}{col 38}{res}{space 2}-.0159712{col 50}{space 2} .0036915{col 61}{space 1}   -4.33{col 70}{space 3}0.000{col 78}{space 4}-.0232064{col 91}{space 3}-.0087361
{txt}{space 20}lag4_solar_share {c |}{col 38}{res}{space 2}-.0065791{col 50}{space 2} .0036685{col 61}{space 1}   -1.79{col 70}{space 3}0.073{col 78}{space 4}-.0137692{col 91}{space 3} .0006109
{txt}{space 20}lag5_solar_share {c |}{col 38}{res}{space 2}-.0124064{col 50}{space 2} .0031653{col 61}{space 1}   -3.92{col 70}{space 3}0.000{col 78}{space 4}-.0186104{col 91}{space 3}-.0062025
{txt}{space 22}lag_wind_share {c |}{col 38}{res}{space 2}-.0155576{col 50}{space 2} .0016785{col 61}{space 1}   -9.27{col 70}{space 3}0.000{col 78}{space 4}-.0188474{col 91}{space 3}-.0122677
{txt}{space 21}lag2_wind_share {c |}{col 38}{res}{space 2} .0001655{col 50}{space 2} .0017423{col 61}{space 1}    0.09{col 70}{space 3}0.924{col 78}{space 4}-.0032493{col 91}{space 3} .0035802
{txt}{space 21}lag3_wind_share {c |}{col 38}{res}{space 2}-.0044861{col 50}{space 2} .0017773{col 61}{space 1}   -2.52{col 70}{space 3}0.012{col 78}{space 4}-.0079695{col 91}{space 3}-.0010026
{txt}{space 21}lag4_wind_share {c |}{col 38}{res}{space 2} .0006224{col 50}{space 2} .0017872{col 61}{space 1}    0.35{col 70}{space 3}0.728{col 78}{space 4}-.0028804{col 91}{space 3} .0041252
{txt}{space 21}lag5_wind_share {c |}{col 38}{res}{space 2}-.0015246{col 50}{space 2} .0016007{col 61}{space 1}   -0.95{col 70}{space 3}0.341{col 78}{space 4}-.0046619{col 91}{space 3} .0016127
{txt}{space 21}lag_hydro_share {c |}{col 38}{res}{space 2}-.0200605{col 50}{space 2} .0037821{col 61}{space 1}   -5.30{col 70}{space 3}0.000{col 78}{space 4}-.0274732{col 91}{space 3}-.0126478
{txt}{space 20}lag2_hydro_share {c |}{col 38}{res}{space 2} .0063634{col 50}{space 2} .0039699{col 61}{space 1}    1.60{col 70}{space 3}0.109{col 78}{space 4}-.0014176{col 91}{space 3} .0141443
{txt}{space 20}lag3_hydro_share {c |}{col 38}{res}{space 2}-.0187721{col 50}{space 2} .0039574{col 61}{space 1}   -4.74{col 70}{space 3}0.000{col 78}{space 4}-.0265285{col 91}{space 3}-.0110157
{txt}{space 20}lag4_hydro_share {c |}{col 38}{res}{space 2}-.0019172{col 50}{space 2} .0040327{col 61}{space 1}   -0.48{col 70}{space 3}0.634{col 78}{space 4}-.0098211{col 91}{space 3} .0059867
{txt}{space 20}lag5_hydro_share {c |}{col 38}{res}{space 2} .0140412{col 50}{space 2} .0036511{col 61}{space 1}    3.85{col 70}{space 3}0.000{col 78}{space 4} .0068853{col 91}{space 3} .0211972
{txt}{space 23}lag_gas_share {c |}{col 38}{res}{space 2}-.0079198{col 50}{space 2} .0027386{col 61}{space 1}   -2.89{col 70}{space 3}0.004{col 78}{space 4}-.0132874{col 91}{space 3}-.0025522
{txt}{space 22}lag2_gas_share {c |}{col 38}{res}{space 2}-.0025529{col 50}{space 2} .0029678{col 61}{space 1}   -0.86{col 70}{space 3}0.390{col 78}{space 4}-.0083698{col 91}{space 3}  .003264
{txt}{space 22}lag3_gas_share {c |}{col 38}{res}{space 2} .0019362{col 50}{space 2} .0029838{col 61}{space 1}    0.65{col 70}{space 3}0.516{col 78}{space 4} -.003912{col 91}{space 3} .0077843
{txt}{space 22}lag4_gas_share {c |}{col 38}{res}{space 2}-.0060359{col 50}{space 2}  .002954{col 61}{space 1}   -2.04{col 70}{space 3}0.041{col 78}{space 4}-.0118255{col 91}{space 3}-.0002462
{txt}{space 22}lag5_gas_share {c |}{col 38}{res}{space 2}-.0004913{col 50}{space 2} .0025976{col 61}{space 1}   -0.19{col 70}{space 3}0.850{col 78}{space 4}-.0055826{col 91}{space 3} .0045999
{txt}{space 22}lag_coal_share {c |}{col 38}{res}{space 2}-.0000414{col 50}{space 2} .0049855{col 61}{space 1}   -0.01{col 70}{space 3}0.993{col 78}{space 4}-.0098128{col 91}{space 3}   .00973
{txt}{space 21}lag2_coal_share {c |}{col 38}{res}{space 2} .0022681{col 50}{space 2} .0062546{col 61}{space 1}    0.36{col 70}{space 3}0.717{col 78}{space 4}-.0099908{col 91}{space 3}  .014527
{txt}{space 21}lag3_coal_share {c |}{col 38}{res}{space 2}-.0118808{col 50}{space 2} .0062825{col 61}{space 1}   -1.89{col 70}{space 3}0.059{col 78}{space 4}-.0241944{col 91}{space 3} .0004327
{txt}{space 21}lag4_coal_share {c |}{col 38}{res}{space 2} .0209958{col 50}{space 2} .0062408{col 61}{space 1}    3.36{col 70}{space 3}0.001{col 78}{space 4} .0087641{col 91}{space 3} .0332274
{txt}{space 21}lag5_coal_share {c |}{col 38}{res}{space 2}-.0025356{col 50}{space 2} .0048934{col 61}{space 1}   -0.52{col 70}{space 3}0.604{col 78}{space 4}-.0121265{col 91}{space 3} .0070553
{txt}{space 24}lag_load_ACT {c |}{col 38}{res}{space 2}-.0052209{col 50}{space 2} .0036897{col 61}{space 1}   -1.41{col 70}{space 3}0.157{col 78}{space 4}-.0124526{col 91}{space 3} .0020108
{txt}{space 23}lag2_load_ACT {c |}{col 38}{res}{space 2} .0087004{col 50}{space 2} .0043387{col 61}{space 1}    2.01{col 70}{space 3}0.045{col 78}{space 4} .0001968{col 91}{space 3}  .017204
{txt}{space 23}lag3_load_ACT {c |}{col 38}{res}{space 2} .0126677{col 50}{space 2} .0042386{col 61}{space 1}    2.99{col 70}{space 3}0.003{col 78}{space 4} .0043602{col 91}{space 3} .0209752
{txt}{space 23}lag4_load_ACT {c |}{col 38}{res}{space 2}-.0121139{col 50}{space 2} .0042174{col 61}{space 1}   -2.87{col 70}{space 3}0.004{col 78}{space 4}-.0203799{col 91}{space 3} -.003848
{txt}{space 23}lag5_load_ACT {c |}{col 38}{res}{space 2}-.0061545{col 50}{space 2} .0036483{col 61}{space 1}   -1.69{col 70}{space 3}0.092{col 78}{space 4} -.013305{col 91}{space 3}  .000996
{txt}{space 18}lag_solar_fc_error {c |}{col 38}{res}{space 2}-.0523739{col 50}{space 2} .0519626{col 61}{space 1}   -1.01{col 70}{space 3}0.313{col 78}{space 4}-.1542187{col 91}{space 3} .0494709
{txt}{space 17}lag2_solar_fc_error {c |}{col 38}{res}{space 2}-.0594062{col 50}{space 2}  .053535{col 61}{space 1}   -1.11{col 70}{space 3}0.267{col 78}{space 4}-.1643328{col 91}{space 3} .0455204
{txt}{space 17}lag3_solar_fc_error {c |}{col 38}{res}{space 2} .0352171{col 50}{space 2} .0534937{col 61}{space 1}    0.66{col 70}{space 3}0.510{col 78}{space 4}-.0696287{col 91}{space 3} .1400629
{txt}{space 17}lag4_solar_fc_error {c |}{col 38}{res}{space 2} .2063082{col 50}{space 2} .0537628{col 61}{space 1}    3.84{col 70}{space 3}0.000{col 78}{space 4} .1009349{col 91}{space 3} .3116814
{txt}{space 17}lag5_solar_fc_error {c |}{col 38}{res}{space 2} .0830768{col 50}{space 2} .0525541{col 61}{space 1}    1.58{col 70}{space 3}0.114{col 78}{space 4}-.0199273{col 91}{space 3} .1860809
{txt}{space 19}lag_wind_fc_error {c |}{col 38}{res}{space 2} -.130716{col 50}{space 2} .0942639{col 61}{space 1}   -1.39{col 70}{space 3}0.166{col 78}{space 4}-.3154698{col 91}{space 3} .0540378
{txt}{space 18}lag2_wind_fc_error {c |}{col 38}{res}{space 2}-.0290508{col 50}{space 2} .0939866{col 61}{space 1}   -0.31{col 70}{space 3}0.757{col 78}{space 4}-.2132611{col 91}{space 3} .1551595
{txt}{space 18}lag3_wind_fc_error {c |}{col 38}{res}{space 2}-.2168328{col 50}{space 2} .0937791{col 61}{space 1}   -2.31{col 70}{space 3}0.021{col 78}{space 4}-.4006364{col 91}{space 3}-.0330292
{txt}{space 18}lag4_wind_fc_error {c |}{col 38}{res}{space 2}  .055703{col 50}{space 2} .0957645{col 61}{space 1}    0.58{col 70}{space 3}0.561{col 78}{space 4}-.1319921{col 91}{space 3}  .243398
{txt}{space 18}lag5_wind_fc_error {c |}{col 38}{res}{space 2} .0072259{col 50}{space 2} .0932177{col 61}{space 1}    0.08{col 70}{space 3}0.938{col 78}{space 4}-.1754774{col 91}{space 3} .1899293
{txt}{space 19}lag_load_fc_error {c |}{col 38}{res}{space 2} 3.616818{col 50}{space 2} .5002431{col 61}{space 1}    7.23{col 70}{space 3}0.000{col 78}{space 4}  2.63636{col 91}{space 3} 4.597277
{txt}{space 18}lag2_load_fc_error {c |}{col 38}{res}{space 2} 3.256379{col 50}{space 2} .4963454{col 61}{space 1}    6.56{col 70}{space 3}0.000{col 78}{space 4}  2.28356{col 91}{space 3} 4.229198
{txt}{space 18}lag3_load_fc_error {c |}{col 38}{res}{space 2} .6837708{col 50}{space 2} .4977702{col 61}{space 1}    1.37{col 70}{space 3}0.170{col 78}{space 4}-.2918409{col 91}{space 3} 1.659382
{txt}{space 18}lag4_load_fc_error {c |}{col 38}{res}{space 2} -.940259{col 50}{space 2} .4991154{col 61}{space 1}   -1.88{col 70}{space 3}0.060{col 78}{space 4}-1.918507{col 91}{space 3} .0379892
{txt}{space 18}lag5_load_fc_error {c |}{col 38}{res}{space 2} 1.320698{col 50}{space 2} .4921545{col 61}{space 1}    2.68{col 70}{space 3}0.007{col 78}{space 4} .3560925{col 91}{space 3} 2.285303
{txt}{space 24}lag_co2price {c |}{col 38}{res}{space 2}-.0131808{col 50}{space 2} .0162428{col 61}{space 1}   -0.81{col 70}{space 3}0.417{col 78}{space 4}-.0450162{col 91}{space 3} .0186546
{txt}{space 23}lag2_co2price {c |}{col 38}{res}{space 2}-.0092245{col 50}{space 2} .0222139{col 61}{space 1}   -0.42{col 70}{space 3}0.678{col 78}{space 4}-.0527628{col 91}{space 3} .0343139
{txt}{space 23}lag3_co2price {c |}{col 38}{res}{space 2} .0213101{col 50}{space 2} .0220241{col 61}{space 1}    0.97{col 70}{space 3}0.333{col 78}{space 4}-.0218564{col 91}{space 3} .0644767
{txt}{space 23}lag4_co2price {c |}{col 38}{res}{space 2} -.007747{col 50}{space 2} .0220519{col 61}{space 1}   -0.35{col 70}{space 3}0.725{col 78}{space 4} -.050968{col 91}{space 3}  .035474
{txt}{space 23}lag5_co2price {c |}{col 38}{res}{space 2} .0333541{col 50}{space 2}   .01613{col 61}{space 1}    2.07{col 70}{space 3}0.039{col 78}{space 4} .0017399{col 91}{space 3} .0649682
{txt}{space 24}lag_gasprice {c |}{col 38}{res}{space 2}-.0691979{col 50}{space 2} .0128313{col 61}{space 1}   -5.39{col 70}{space 3}0.000{col 78}{space 4}-.0943467{col 91}{space 3} -.044049
{txt}{space 23}lag2_gasprice {c |}{col 38}{res}{space 2} .0216331{col 50}{space 2} .0191816{col 61}{space 1}    1.13{col 70}{space 3}0.259{col 78}{space 4}-.0159621{col 91}{space 3} .0592284
{txt}{space 23}lag3_gasprice {c |}{col 38}{res}{space 2}-.0135316{col 50}{space 2} .0191422{col 61}{space 1}   -0.71{col 70}{space 3}0.480{col 78}{space 4}-.0510497{col 91}{space 3} .0239864
{txt}{space 23}lag4_gasprice {c |}{col 38}{res}{space 2} .0880018{col 50}{space 2} .0190299{col 61}{space 1}    4.62{col 70}{space 3}0.000{col 78}{space 4} .0507039{col 91}{space 3} .1252996
{txt}{space 23}lag5_gasprice {c |}{col 38}{res}{space 2} -.072287{col 50}{space 2} .0128577{col 61}{space 1}   -5.62{col 70}{space 3}0.000{col 78}{space 4}-.0974876{col 91}{space 3}-.0470864
{txt}{space 30}_Iyq_2 {c |}{col 38}{res}{space 2} .0162023{col 50}{space 2} .0541352{col 61}{space 1}    0.30{col 70}{space 3}0.765{col 78}{space 4}-.0899007{col 91}{space 3} .1223052
{txt}{space 30}_Iyq_3 {c |}{col 38}{res}{space 2} .2345342{col 50}{space 2} .0597175{col 61}{space 1}    3.93{col 70}{space 3}0.000{col 78}{space 4}   .11749{col 91}{space 3} .3515783
{txt}{space 30}_Iyq_4 {c |}{col 38}{res}{space 2}-.1846994{col 50}{space 2}  .064897{col 61}{space 1}   -2.85{col 70}{space 3}0.004{col 78}{space 4}-.3118951{col 91}{space 3}-.0575037
{txt}{space 30}_Iyq_5 {c |}{col 38}{res}{space 2}-.0248528{col 50}{space 2} .0595414{col 61}{space 1}   -0.42{col 70}{space 3}0.676{col 78}{space 4}-.1415517{col 91}{space 3} .0918462
{txt}{space 30}_Iyq_6 {c |}{col 38}{res}{space 2} .2392983{col 50}{space 2} .0795465{col 61}{space 1}    3.01{col 70}{space 3}0.003{col 78}{space 4} .0833899{col 91}{space 3} .3952066
{txt}{space 30}_Iyq_7 {c |}{col 38}{res}{space 2}-.0168677{col 50}{space 2} .0963964{col 61}{space 1}   -0.17{col 70}{space 3}0.861{col 78}{space 4}-.2058011{col 91}{space 3} .1720658
{txt}{space 30}_Iyq_8 {c |}{col 38}{res}{space 2} .2221173{col 50}{space 2} .1100656{col 61}{space 1}    2.02{col 70}{space 3}0.044{col 78}{space 4} .0063927{col 91}{space 3} .4378419
{txt}{space 30}_Iyq_9 {c |}{col 38}{res}{space 2} .0156502{col 50}{space 2} .1186641{col 61}{space 1}    0.13{col 70}{space 3}0.895{col 78}{space 4}-.2169272{col 91}{space 3} .2482276
{txt}{space 29}_Iyq_10 {c |}{col 38}{res}{space 2}-.2016594{col 50}{space 2}  .144548{col 61}{space 1}   -1.40{col 70}{space 3}0.163{col 78}{space 4}-.4849683{col 91}{space 3} .0816495
{txt}{space 29}_Iyq_11 {c |}{col 38}{res}{space 2}-.4740763{col 50}{space 2}  .166776{col 61}{space 1}   -2.84{col 70}{space 3}0.004{col 78}{space 4}-.8009512{col 91}{space 3}-.1472013
{txt}{space 29}_Iyq_12 {c |}{col 38}{res}{space 2}-.1022773{col 50}{space 2} .1501824{col 61}{space 1}   -0.68{col 70}{space 3}0.496{col 78}{space 4}-.3966295{col 91}{space 3} .1920748
{txt}{space 29}_Iyq_13 {c |}{col 38}{res}{space 2}-.4291674{col 50}{space 2} .1398355{col 61}{space 1}   -3.07{col 70}{space 3}0.002{col 78}{space 4}-.7032399{col 91}{space 3}-.1550948
{txt}{space 29}_Iyq_14 {c |}{col 38}{res}{space 2}-.1263978{col 50}{space 2} .1380778{col 61}{space 1}   -0.92{col 70}{space 3}0.360{col 78}{space 4}-.3970252{col 91}{space 3} .1442296
{txt}{space 29}_Iyq_15 {c |}{col 38}{res}{space 2}-.4889692{col 50}{space 2}  .178798{col 61}{space 1}   -2.73{col 70}{space 3}0.006{col 78}{space 4}-.8394068{col 91}{space 3}-.1385317
{txt}{space 29}_Iyq_16 {c |}{col 38}{res}{space 2}-.3270341{col 50}{space 2} .1779771{col 61}{space 1}   -1.84{col 70}{space 3}0.066{col 78}{space 4}-.6758628{col 91}{space 3} .0217946
{txt}{space 31}_cons {c |}{col 38}{res}{space 2}-.0073222{col 50}{space 2}  .176987{col 61}{space 1}   -0.04{col 70}{space 3}0.967{col 78}{space 4}-.3542105{col 91}{space 3}  .339566
{txt}{hline 37}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    corr(e.diff_p_id_da,e.pbid_dummy){c |}{col 38}{res}{space 2}-.9276627{col 50}{space 2} .0126061{col 78}{space 4}-.9486936{col 91}{space 3}-.8984602
{txt}   corr(e.q_total_mg_id,e.pbid_dummy){c |}{col 38}{res}{space 2}-.3549081{col 50}{space 2}  .025948{col 78}{space 4}-.4046813{col 91}{space 3}-.3030383
{txt} corr(e.q_total_mg_id,e.diff_p_id_da){c |}{col 38}{res}{space 2} .0582705{col 50}{space 2} .0077855{col 78}{space 4} .0429987{col 91}{space 3} .0735151
{txt}                   sd(e.diff_p_id_da){c |}{col 38}{res}{space 2} 2.744246{col 50}{space 2}  .015159{col 78}{space 4} 2.714695{col 91}{space 3} 2.774118
{txt}                  sd(e.q_total_mg_id){c |}{col 38}{res}{space 2} .8000521{col 50}{space 2} .0044194{col 78}{space 4} .7914369{col 91}{space 3} .8087611
{txt}{hline 37}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test of exogeneity: chi2({res}2{txt}) = {res}5500.54{txt}{col 59}Prob > chi2 = {res}0.0000
{txt}{p 0 14 72}Instrumented: {res:diff_p_id_da q_total_mg_id}{p_end}
{p 0 14 72}{space 1}Instruments: {res:lag_solar_share lag2_solar_share lag3_solar_share lag4_solar_share lag5_solar_share lag_wind_share lag2_wind_share lag3_wind_share lag4_wind_share lag5_wind_share lag_hydro_share lag2_hydro_share lag3_hydro_share lag4_hydro_share lag5_hydro_share lag_gas_share lag2_gas_share lag3_gas_share lag4_gas_share lag5_gas_share lag_coal_share lag2_coal_share lag3_coal_share lag4_coal_share lag5_coal_share lag_load_ACT lag2_load_ACT lag3_load_ACT lag4_load_ACT lag5_load_ACT lag_solar_fc_error lag2_solar_fc_error lag3_solar_fc_error lag4_solar_fc_error lag5_solar_fc_error lag_wind_fc_error lag2_wind_fc_error lag3_wind_fc_error lag4_wind_fc_error lag5_wind_fc_error lag_load_fc_error lag2_load_fc_error lag3_load_fc_error lag4_load_fc_error lag5_load_fc_error lag_co2price lag2_co2price lag3_co2price lag4_co2price lag5_co2price lag_gasprice lag2_gasprice lag3_gasprice lag4_gasprice lag5_gasprice _Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 afternoon weekend}{p_end}

{com}. *outreg2 using 1st_step_robust3.doc, replace ctitle(IV Probit 5 Lags) addstat("Chi2", e(chi2))
. 
. ***Fewer Controls and FE
. ***(3) IV Probit PF
. ivprobit pbid_dummy (diff_p_id_da q_total_mg_id = afternoon weekend) load_ACT solar_share wind_share hydro_share co2price gasprice wind_fc_error solar_fc_error load_fc_error $fe3
{res}
{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-8575.4282}  
Iteration 1:{space 3}log likelihood = {res:-6836.4941}  
Iteration 2:{space 3}log likelihood = {res:-6805.6771}  
Iteration 3:{space 3}log likelihood = {res:-6805.6021}  
Iteration 4:{space 3}log likelihood = {res:-6805.6021}  
{res}
{txt}Fitting full model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-67404.194}  
Iteration 1:{space 3}log likelihood = {res:-67404.187}  
Iteration 2:{space 3}log likelihood = {res:-67404.187}  

{col 1}Probit model with endogenous regressors{col 55}{lalign 13:Number of obs}{col 68} = {res}{ralign 8:16,460}
{txt}{col 55}{lalign 13:Wald chi2({res:14})}{col 68} = {res}{ralign 8:11138.99}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-67404.187}{txt}{col 55}{lalign 13:Prob > chi2}{col 68} = {res}{ralign 8:0.0000}

{txt}{hline 37}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 38}{c |} Coefficient{col 50}  Std. err.{col 62}      z{col 70}   P>|z|{col 78}     [95% con{col 91}f. interval]
{hline 37}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 24}diff_p_id_da {c |}{col 38}{res}{space 2} .2432117{col 50}{space 2} .0203735{col 61}{space 1}   11.94{col 70}{space 3}0.000{col 78}{space 4} .2032804{col 91}{space 3} .2831431
{txt}{space 23}q_total_mg_id {c |}{col 38}{res}{space 2} .6174592{col 50}{space 2} .0545158{col 61}{space 1}   11.33{col 70}{space 3}0.000{col 78}{space 4} .5106103{col 91}{space 3} .7243081
{txt}{space 28}load_ACT {c |}{col 38}{res}{space 2}-.0504866{col 50}{space 2} .0049444{col 61}{space 1}  -10.21{col 70}{space 3}0.000{col 78}{space 4}-.0601775{col 91}{space 3}-.0407957
{txt}{space 25}solar_share {c |}{col 38}{res}{space 2}-.0112084{col 50}{space 2} .0021137{col 61}{space 1}   -5.30{col 70}{space 3}0.000{col 78}{space 4}-.0153512{col 91}{space 3}-.0070656
{txt}{space 26}wind_share {c |}{col 38}{res}{space 2}-.0105556{col 50}{space 2} .0009951{col 61}{space 1}  -10.61{col 70}{space 3}0.000{col 78}{space 4}-.0125059{col 91}{space 3}-.0086054
{txt}{space 25}hydro_share {c |}{col 38}{res}{space 2}-.0227673{col 50}{space 2} .0022836{col 61}{space 1}   -9.97{col 70}{space 3}0.000{col 78}{space 4}-.0272431{col 91}{space 3}-.0182916
{txt}{space 28}co2price {c |}{col 38}{res}{space 2}-.0345453{col 50}{space 2} .0047252{col 61}{space 1}   -7.31{col 70}{space 3}0.000{col 78}{space 4}-.0438065{col 91}{space 3}-.0252841
{txt}{space 28}gasprice {c |}{col 38}{res}{space 2}-.0343968{col 50}{space 2} .0024648{col 61}{space 1}  -13.96{col 70}{space 3}0.000{col 78}{space 4}-.0392277{col 91}{space 3}-.0295659
{txt}{space 23}wind_fc_error {c |}{col 38}{res}{space 2}-1.099519{col 50}{space 2} .1043243{col 61}{space 1}  -10.54{col 70}{space 3}0.000{col 78}{space 4}-1.303991{col 91}{space 3}-.8950467
{txt}{space 22}solar_fc_error {c |}{col 38}{res}{space 2} .0385155{col 50}{space 2} .0503926{col 61}{space 1}    0.76{col 70}{space 3}0.445{col 78}{space 4}-.0602522{col 91}{space 3} .1372831
{txt}{space 23}load_fc_error {c |}{col 38}{res}{space 2}-2.497924{col 50}{space 2} .6662943{col 61}{space 1}   -3.75{col 70}{space 3}0.000{col 78}{space 4}-3.803837{col 91}{space 3}-1.192011
{txt}{space 25}_Iyear_2018 {c |}{col 38}{res}{space 2} .5979568{col 50}{space 2} .0485062{col 61}{space 1}   12.33{col 70}{space 3}0.000{col 78}{space 4} .5028864{col 91}{space 3} .6930272
{txt}{space 25}_Iyear_2019 {c |}{col 38}{res}{space 2}  .597592{col 50}{space 2} .0903303{col 61}{space 1}    6.62{col 70}{space 3}0.000{col 78}{space 4} .4205478{col 91}{space 3} .7746361
{txt}{space 25}_Iyear_2020 {c |}{col 38}{res}{space 2} .2535325{col 50}{space 2} .0854565{col 61}{space 1}    2.97{col 70}{space 3}0.003{col 78}{space 4} .0860409{col 91}{space 3} .4210241
{txt}{space 31}_cons {c |}{col 38}{res}{space 2} .4101491{col 50}{space 2} .1020102{col 61}{space 1}    4.02{col 70}{space 3}0.000{col 78}{space 4} .2102129{col 91}{space 3} .6100853
{txt}{hline 37}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    corr(e.diff_p_id_da,e.pbid_dummy){c |}{col 38}{res}{space 2}-.6927259{col 50}{space 2} .0561339{col 78}{space 4}-.7874569{col 91}{space 3} -.566024
{txt}   corr(e.q_total_mg_id,e.pbid_dummy){c |}{col 38}{res}{space 2}-.5584976{col 50}{space 2}  .044205{col 78}{space 4}-.6390479{col 91}{space 3}-.4658299
{txt} corr(e.q_total_mg_id,e.diff_p_id_da){c |}{col 38}{res}{space 2} .0415508{col 50}{space 2}  .007781{col 78}{space 4} .0262918{col 91}{space 3} .0567904
{txt}                   sd(e.diff_p_id_da){c |}{col 38}{res}{space 2}  2.80918{col 50}{space 2} .0154828{col 78}{space 4} 2.778998{col 91}{space 3} 2.839691
{txt}                  sd(e.q_total_mg_id){c |}{col 38}{res}{space 2} .8283336{col 50}{space 2} .0045654{col 78}{space 4} .8194338{col 91}{space 3} .8373301
{txt}{hline 37}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test of exogeneity: chi2({res}2{txt}) = {res}3762.56{txt}{col 59}Prob > chi2 = {res}0.0000
{txt}{p 0 14 72}Instrumented: {res:diff_p_id_da q_total_mg_id}{p_end}
{p 0 14 72}{space 1}Instruments: {res:load_ACT solar_share wind_share hydro_share co2price gasprice wind_fc_error solar_fc_error load_fc_error _Iyear_2018 _Iyear_2019 _Iyear_2020 afternoon weekend}{p_end}

{com}. *outreg2 using 1st_step_robust3.doc, append ctitle(IV Probit PF small) addstat("Chi2", e(chi2))
. *estat firststage
. *estat overid
. 
. **More Controls and FE
. ***(4) IV Probit PF
. ivprobit pbid_dummy (diff_p_id_da_m q_total_mg_id = afternoon weekend) load_ACT solar_share wind_share hydro_share co2price gasprice wind_fc_error solar_fc_error load_fc_error co2price gasprice oil_share gas_share coal_share other_share $fe4
{txt}note: {bf:co2price} omitted because of collinearity.
note: {bf:gasprice} omitted because of collinearity.
{res}
{txt}Fitting exogenous probit model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-8575.4282}  
Iteration 1:{space 3}log likelihood = {res:-6143.4162}  
Iteration 2:{space 3}log likelihood = {res: -6078.846}  
Iteration 3:{space 3}log likelihood = {res:-6078.7691}  
Iteration 4:{space 3}log likelihood = {res:-6078.7691}  
{res}
{txt}Fitting full model

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-63526.182}  
Iteration 1:{space 3}log likelihood = {res:-63526.155}  
Iteration 2:{space 3}log likelihood = {res:-63526.155}  

{col 1}Probit model with endogenous regressors{col 55}{lalign 13:Number of obs}{col 68} = {res}{ralign 8:16,460}
{txt}{col 55}{lalign 13:Wald chi2({res:29})}{col 68} = {res}{ralign 8:12692.82}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-63526.155}{txt}{col 55}{lalign 13:Prob > chi2}{col 68} = {res}{ralign 8:0.0000}

{txt}{hline 39}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 40}{c |} Coefficient{col 52}  Std. err.{col 64}      z{col 72}   P>|z|{col 80}     [95% con{col 93}f. interval]
{hline 39}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 24}diff_p_id_da_m {c |}{col 40}{res}{space 2} .2055005{col 52}{space 2} .0703617{col 63}{space 1}    2.92{col 72}{space 3}0.003{col 80}{space 4} .0675941{col 93}{space 3} .3434069
{txt}{space 25}q_total_mg_id {c |}{col 40}{res}{space 2} .8841962{col 52}{space 2} .0938557{col 63}{space 1}    9.42{col 72}{space 3}0.000{col 80}{space 4} .7002424{col 93}{space 3}  1.06815
{txt}{space 30}load_ACT {c |}{col 40}{res}{space 2}-.0784739{col 52}{space 2} .0100619{col 63}{space 1}   -7.80{col 72}{space 3}0.000{col 80}{space 4}-.0981949{col 93}{space 3} -.058753
{txt}{space 27}solar_share {c |}{col 40}{res}{space 2}-.0130997{col 52}{space 2} .0026389{col 63}{space 1}   -4.96{col 72}{space 3}0.000{col 80}{space 4}-.0182719{col 93}{space 3}-.0079274
{txt}{space 28}wind_share {c |}{col 40}{res}{space 2} -.018599{col 52}{space 2} .0014874{col 63}{space 1}  -12.50{col 72}{space 3}0.000{col 80}{space 4}-.0215143{col 93}{space 3}-.0156837
{txt}{space 27}hydro_share {c |}{col 40}{res}{space 2}-.0432526{col 52}{space 2} .0031289{col 63}{space 1}  -13.82{col 72}{space 3}0.000{col 80}{space 4}-.0493852{col 93}{space 3}  -.03712
{txt}{space 30}co2price {c |}{col 40}{res}{space 2}-.0031803{col 52}{space 2} .0061206{col 63}{space 1}   -0.52{col 72}{space 3}0.603{col 80}{space 4}-.0151765{col 93}{space 3} .0088159
{txt}{space 30}gasprice {c |}{col 40}{res}{space 2} -.043083{col 52}{space 2} .0036317{col 63}{space 1}  -11.86{col 72}{space 3}0.000{col 80}{space 4} -.050201{col 93}{space 3} -.035965
{txt}{space 25}wind_fc_error {c |}{col 40}{res}{space 2}-.8603526{col 52}{space 2} .1946073{col 63}{space 1}   -4.42{col 72}{space 3}0.000{col 80}{space 4}-1.241776{col 93}{space 3}-.4789293
{txt}{space 24}solar_fc_error {c |}{col 40}{res}{space 2} .0038062{col 52}{space 2} .0530673{col 63}{space 1}    0.07{col 72}{space 3}0.943{col 80}{space 4}-.1002038{col 93}{space 3} .1078163
{txt}{space 25}load_fc_error {c |}{col 40}{res}{space 2}-4.748137{col 52}{space 2} .8141584{col 63}{space 1}   -5.83{col 72}{space 3}0.000{col 80}{space 4}-6.343858{col 93}{space 3}-3.152416
{txt}{space 30}co2price {c |}{col 40}{res}{space 2}        0{col 52}{txt}  (omitted)
{space 30}gasprice {c |}{col 40}{res}{space 2}        0{col 52}{txt}  (omitted)
{space 29}oil_share {c |}{col 40}{res}{space 2}  .184233{col 52}{space 2} .1104499{col 63}{space 1}    1.67{col 72}{space 3}0.095{col 80}{space 4}-.0322448{col 93}{space 3} .4007107
{txt}{space 29}gas_share {c |}{col 40}{res}{space 2}-.0263967{col 52}{space 2} .0020762{col 63}{space 1}  -12.71{col 72}{space 3}0.000{col 80}{space 4} -.030466{col 93}{space 3}-.0223274
{txt}{space 28}coal_share {c |}{col 40}{res}{space 2}-.0134664{col 52}{space 2} .0050011{col 63}{space 1}   -2.69{col 72}{space 3}0.007{col 80}{space 4}-.0232684{col 93}{space 3}-.0036645
{txt}{space 27}other_share {c |}{col 40}{res}{space 2} .0493403{col 52}{space 2} .0526285{col 63}{space 1}    0.94{col 72}{space 3}0.348{col 80}{space 4}-.0538096{col 93}{space 3} .1524902
{txt}{space 27}_Iyear_2018 {c |}{col 40}{res}{space 2} .1619432{col 52}{space 2} .0640307{col 63}{space 1}    2.53{col 72}{space 3}0.011{col 80}{space 4} .0364454{col 93}{space 3} .2874411
{txt}{space 27}_Iyear_2019 {c |}{col 40}{res}{space 2} .0602158{col 52}{space 2} .1111875{col 63}{space 1}    0.54{col 72}{space 3}0.588{col 80}{space 4}-.1577077{col 93}{space 3} .2781393
{txt}{space 27}_Iyear_2020 {c |}{col 40}{res}{space 2}-.4103023{col 52}{space 2} .1258648{col 63}{space 1}   -3.26{col 72}{space 3}0.001{col 80}{space 4}-.6569928{col 93}{space 3}-.1636119
{txt}{space 29}_Imonth_2 {c |}{col 40}{res}{space 2} .0215367{col 52}{space 2} .0551002{col 63}{space 1}    0.39{col 72}{space 3}0.696{col 80}{space 4}-.0864577{col 93}{space 3} .1295311
{txt}{space 29}_Imonth_3 {c |}{col 40}{res}{space 2}-.3574976{col 52}{space 2} .0562162{col 63}{space 1}   -6.36{col 72}{space 3}0.000{col 80}{space 4}-.4676792{col 93}{space 3}-.2473159
{txt}{space 29}_Imonth_4 {c |}{col 40}{res}{space 2}-.5401333{col 52}{space 2} .0920251{col 63}{space 1}   -5.87{col 72}{space 3}0.000{col 80}{space 4}-.7204993{col 93}{space 3}-.3597673
{txt}{space 29}_Imonth_5 {c |}{col 40}{res}{space 2}-.3580794{col 52}{space 2} .0620385{col 63}{space 1}   -5.77{col 72}{space 3}0.000{col 80}{space 4}-.4796726{col 93}{space 3}-.2364861
{txt}{space 29}_Imonth_6 {c |}{col 40}{res}{space 2}-.1915392{col 52}{space 2} .0640322{col 63}{space 1}   -2.99{col 72}{space 3}0.003{col 80}{space 4}-.3170399{col 93}{space 3}-.0660384
{txt}{space 29}_Imonth_7 {c |}{col 40}{res}{space 2}-.0802839{col 52}{space 2} .0633856{col 63}{space 1}   -1.27{col 72}{space 3}0.205{col 80}{space 4}-.2045174{col 93}{space 3} .0439496
{txt}{space 29}_Imonth_8 {c |}{col 40}{res}{space 2} -.788271{col 52}{space 2} .1085257{col 63}{space 1}   -7.26{col 72}{space 3}0.000{col 80}{space 4}-1.000978{col 93}{space 3}-.5755644
{txt}{space 29}_Imonth_9 {c |}{col 40}{res}{space 2}-.6781735{col 52}{space 2}  .072431{col 63}{space 1}   -9.36{col 72}{space 3}0.000{col 80}{space 4}-.8201356{col 93}{space 3}-.5362114
{txt}{space 28}_Imonth_10 {c |}{col 40}{res}{space 2}-.7063736{col 52}{space 2} .1135013{col 63}{space 1}   -6.22{col 72}{space 3}0.000{col 80}{space 4}-.9288321{col 93}{space 3}-.4839151
{txt}{space 28}_Imonth_11 {c |}{col 40}{res}{space 2}-.5305035{col 52}{space 2} .0933974{col 63}{space 1}   -5.68{col 72}{space 3}0.000{col 80}{space 4} -.713559{col 93}{space 3} -.347448
{txt}{space 28}_Imonth_12 {c |}{col 40}{res}{space 2}-.1666963{col 52}{space 2} .0927536{col 63}{space 1}   -1.80{col 72}{space 3}0.072{col 80}{space 4}  -.34849{col 93}{space 3} .0150974
{txt}{space 33}_cons {c |}{col 40}{res}{space 2} 1.843412{col 52}{space 2} .3042138{col 63}{space 1}    6.06{col 72}{space 3}0.000{col 80}{space 4} 1.247164{col 93}{space 3}  2.43966
{txt}{hline 39}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    corr(e.diff_p_id_da_m,e.pbid_dummy){c |}{col 40}{res}{space 2}-.4710768{col 52}{space 2} .1724051{col 80}{space 4}-.7378455{col 93}{space 3}-.0770202
{txt}     corr(e.q_total_mg_id,e.pbid_dummy){c |}{col 40}{res}{space 2}-.7463073{col 52}{space 2} .0777635{col 80}{space 4}-.8639199{col 93}{space 3}-.5515027
{txt} corr(e.q_total_mg_id,e.diff_p_id_da_m){c |}{col 40}{res}{space 2} .0049769{col 52}{space 2} .0077943{col 80}{space 4}-.0102995{col 93}{space 3}  .020251
{txt}                   sd(e.diff_p_id_da_m){c |}{col 40}{res}{space 2} 2.412857{col 52}{space 2} .0132985{col 80}{space 4} 2.386933{col 93}{space 3} 2.439063
{txt}                    sd(e.q_total_mg_id){c |}{col 40}{res}{space 2} .7956819{col 52}{space 2} .0043854{col 80}{space 4}  .787133{col 93}{space 3} .8043238
{txt}{hline 39}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test of exogeneity: chi2({res}2{txt}) = {res}3889.37{txt}{col 59}Prob > chi2 = {res}0.0000
{txt}{p 0 14 70}Instrumented: {res:diff_p_id_da_m q_total_mg_id}{p_end}
{p 0 14 70}{space 1}Instruments: {res:load_ACT solar_share wind_share hydro_share co2price gasprice wind_fc_error solar_fc_error load_fc_error oil_share gas_share coal_share other_share _Iyear_2018 _Iyear_2019 _Iyear_2020 _Imonth_2 _Imonth_3 _Imonth_4 _Imonth_5 _Imonth_6 _Imonth_7 _Imonth_8 _Imonth_9 _Imonth_10 _Imonth_11 _Imonth_12 afternoon weekend}{p_end}

{com}. *outreg2 using 1st_step_robust3.doc, append ctitle(IV Probit PF large) addstat("Chi2", e(chi2))
. 
. 
{txt}end of do-file

{com}. do "C:\Users\JOHANNS\AppData\Local\Temp\STD5f8_000000.tmp"
{txt}
{com}. drop if pbid_max==0
{txt}(3,545 observations deleted)

{com}. 
. ***OLS
. ***(1) OLS PF
. reg pbid_max mg_price_id_max $fe, vce(cluster yq)

{txt}Linear regression                               Number of obs     = {res}    12,916
                                                {txt}{help j_robustsingular:F(13, 15) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.7664
                                                {txt}Root MSE          =    {res} 6.0892

{txt}{ralign 81:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}       pbid_max{col 17}{c |} Coefficient{col 29}  std. err.{col 41}      t{col 49}   P>|t|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mg_price_id_max {c |}{col 17}{res}{space 2} .6019656{col 29}{space 2} .0358088{col 40}{space 1}   16.81{col 49}{space 3}0.000{col 57}{space 4} .5256409{col 70}{space 3} .6782904
{txt}{space 9}_Iyq_2 {c |}{col 17}{res}{space 2}-5.609429{col 29}{space 2} .3423816{col 40}{space 1}  -16.38{col 49}{space 3}0.000{col 57}{space 4}-6.339198{col 70}{space 3} -4.87966
{txt}{space 9}_Iyq_3 {c |}{col 17}{res}{space 2}-7.504626{col 29}{space 2} .3130523{col 40}{space 1}  -23.97{col 49}{space 3}0.000{col 57}{space 4}-8.171882{col 70}{space 3}-6.837371
{txt}{space 9}_Iyq_4 {c |}{col 17}{res}{space 2}-2.042149{col 29}{space 2} .1417968{col 40}{space 1}  -14.40{col 49}{space 3}0.000{col 57}{space 4}-2.344382{col 70}{space 3}-1.739916
{txt}{space 9}_Iyq_5 {c |}{col 17}{res}{space 2}-4.725251{col 29}{space 2} .2188853{col 40}{space 1}  -21.59{col 49}{space 3}0.000{col 57}{space 4}-5.191794{col 70}{space 3}-4.258708
{txt}{space 9}_Iyq_6 {c |}{col 17}{res}{space 2}-4.608046{col 29}{space 2} .1954218{col 40}{space 1}  -23.58{col 49}{space 3}0.000{col 57}{space 4}-5.024577{col 70}{space 3}-4.191514
{txt}{space 9}_Iyq_7 {c |}{col 17}{res}{space 2}-.9856833{col 29}{space 2} .3197718{col 40}{space 1}   -3.08{col 49}{space 3}0.008{col 57}{space 4}-1.667261{col 70}{space 3}-.3041058
{txt}{space 9}_Iyq_8 {c |}{col 17}{res}{space 2} .1418839{col 29}{space 2} .2562009{col 40}{space 1}    0.55{col 49}{space 3}0.588{col 57}{space 4}-.4041955{col 70}{space 3} .6879633
{txt}{space 9}_Iyq_9 {c |}{col 17}{res}{space 2} -1.93806{col 29}{space 2} .0707964{col 40}{space 1}  -27.38{col 49}{space 3}0.000{col 57}{space 4}-2.088959{col 70}{space 3}-1.787161
{txt}{space 8}_Iyq_10 {c |}{col 17}{res}{space 2}-5.664952{col 29}{space 2} .3234616{col 40}{space 1}  -17.51{col 49}{space 3}0.000{col 57}{space 4}-6.354394{col 70}{space 3} -4.97551
{txt}{space 8}_Iyq_11 {c |}{col 17}{res}{space 2}-4.188542{col 29}{space 2} .3111589{col 40}{space 1}  -13.46{col 49}{space 3}0.000{col 57}{space 4}-4.851762{col 70}{space 3}-3.525323
{txt}{space 8}_Iyq_12 {c |}{col 17}{res}{space 2}-7.089681{col 29}{space 2} .4663478{col 40}{space 1}  -15.20{col 49}{space 3}0.000{col 57}{space 4}-8.083678{col 70}{space 3}-6.095684
{txt}{space 8}_Iyq_13 {c |}{col 17}{res}{space 2}-7.910311{col 29}{space 2} .7732209{col 40}{space 1}  -10.23{col 49}{space 3}0.000{col 57}{space 4}-9.558392{col 70}{space 3}-6.262229
{txt}{space 8}_Iyq_14 {c |}{col 17}{res}{space 2}-12.59193{col 29}{space 2} 1.192576{col 40}{space 1}  -10.56{col 49}{space 3}0.000{col 57}{space 4}-15.13385{col 70}{space 3}-10.05001
{txt}{space 8}_Iyq_15 {c |}{col 17}{res}{space 2}-8.052958{col 29}{space 2} .7570258{col 40}{space 1}  -10.64{col 49}{space 3}0.000{col 57}{space 4} -9.66652{col 70}{space 3}-6.439395
{txt}{space 8}_Iyq_16 {c |}{col 17}{res}{space 2} 2.804574{col 29}{space 2} .5527434{col 40}{space 1}    5.07{col 49}{space 3}0.000{col 57}{space 4}  1.62643{col 70}{space 3} 3.982719
{txt}{space 7}_Ihour_9 {c |}{col 17}{res}{space 2} .1849519{col 29}{space 2} .5120048{col 40}{space 1}    0.36{col 49}{space 3}0.723{col 57}{space 4}-.9063605{col 70}{space 3} 1.276264
{txt}{space 6}_Ihour_10 {c |}{col 17}{res}{space 2} 1.028351{col 29}{space 2} .5492217{col 40}{space 1}    1.87{col 49}{space 3}0.081{col 57}{space 4}-.1422875{col 70}{space 3} 2.198989
{txt}{space 6}_Ihour_11 {c |}{col 17}{res}{space 2}  2.14976{col 29}{space 2} .5648044{col 40}{space 1}    3.81{col 49}{space 3}0.002{col 57}{space 4} .9459081{col 70}{space 3} 3.353612
{txt}{space 6}_Ihour_12 {c |}{col 17}{res}{space 2} 5.053823{col 29}{space 2}  .943878{col 40}{space 1}    5.35{col 49}{space 3}0.000{col 57}{space 4} 3.041995{col 70}{space 3} 7.065651
{txt}{space 6}_Ihour_13 {c |}{col 17}{res}{space 2} 2.872141{col 29}{space 2} .6282344{col 40}{space 1}    4.57{col 49}{space 3}0.000{col 57}{space 4} 1.533092{col 70}{space 3} 4.211191
{txt}{space 6}_Ihour_14 {c |}{col 17}{res}{space 2} 3.005417{col 29}{space 2}  .644003{col 40}{space 1}    4.67{col 49}{space 3}0.000{col 57}{space 4} 1.632757{col 70}{space 3} 4.378077
{txt}{space 6}_Ihour_15 {c |}{col 17}{res}{space 2} 3.179353{col 29}{space 2} .5990199{col 40}{space 1}    5.31{col 49}{space 3}0.000{col 57}{space 4} 1.902572{col 70}{space 3} 4.456134
{txt}{space 6}_Ihour_16 {c |}{col 17}{res}{space 2} 3.155073{col 29}{space 2} .5713976{col 40}{space 1}    5.52{col 49}{space 3}0.000{col 57}{space 4} 1.937167{col 70}{space 3} 4.372978
{txt}{space 6}_Ihour_17 {c |}{col 17}{res}{space 2} 2.942453{col 29}{space 2} .5513034{col 40}{space 1}    5.34{col 49}{space 3}0.000{col 57}{space 4} 1.767378{col 70}{space 3} 4.117529
{txt}{space 6}_Ihour_18 {c |}{col 17}{res}{space 2} 2.237134{col 29}{space 2} .5304528{col 40}{space 1}    4.22{col 49}{space 3}0.001{col 57}{space 4} 1.106501{col 70}{space 3} 3.367768
{txt}{space 6}_Ihour_19 {c |}{col 17}{res}{space 2} 1.756252{col 29}{space 2} .4443325{col 40}{space 1}    3.95{col 49}{space 3}0.001{col 57}{space 4} .8091794{col 70}{space 3} 2.703324
{txt}{space 6}_Ihour_20 {c |}{col 17}{res}{space 2} 1.372912{col 29}{space 2} .5159739{col 40}{space 1}    2.66{col 49}{space 3}0.018{col 57}{space 4} .2731399{col 70}{space 3} 2.472684
{txt}{space 6}_Ihour_21 {c |}{col 17}{res}{space 2} 1.078933{col 29}{space 2} .5137138{col 40}{space 1}    2.10{col 49}{space 3}0.053{col 57}{space 4}-.0160219{col 70}{space 3} 2.173888
{txt}{space 10}_cons {c |}{col 17}{res}{space 2}  23.7264{col 29}{space 2} 2.144592{col 40}{space 1}   11.06{col 49}{space 3}0.000{col 57}{space 4} 19.15531{col 70}{space 3} 28.29749
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_results.doc, replace ctitle(OLS PF) 
. 
. ***(2) OLS Lags
. reg pbid_max mg_price_id_max_lag* $fe, vce(cluster yq)

{txt}Linear regression                               Number of obs     = {res}    12,860
                                                {txt}{help j_robustsingular:F(14, 15) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.7199
                                                {txt}Root MSE          =    {res} 6.6584

{txt}{ralign 86:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34}    Robust
{col 1}            pbid_max{col 22}{c |} Coefficient{col 34}  std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}mg_price_id_max_lag {c |}{col 22}{res}{space 2} .3598042{col 34}{space 2} .0335576{col 45}{space 1}   10.72{col 54}{space 3}0.000{col 62}{space 4} .2882779{col 75}{space 3} .4313304
{txt}mg_price_id_max_lag2 {c |}{col 22}{res}{space 2} .0178866{col 34}{space 2} .0285153{col 45}{space 1}    0.63{col 54}{space 3}0.540{col 62}{space 4}-.0428922{col 75}{space 3} .0786654
{txt}mg_price_id_max_lag3 {c |}{col 22}{res}{space 2} .0965109{col 34}{space 2} .0165476{col 45}{space 1}    5.83{col 54}{space 3}0.000{col 62}{space 4} .0612406{col 75}{space 3} .1317813
{txt}mg_price_id_max_lag4 {c |}{col 22}{res}{space 2} .0769736{col 34}{space 2} .0206273{col 45}{space 1}    3.73{col 54}{space 3}0.002{col 62}{space 4} .0330076{col 75}{space 3} .1209397
{txt}mg_price_id_max_lag5 {c |}{col 22}{res}{space 2}  .110884{col 34}{space 2} .0295778{col 45}{space 1}    3.75{col 54}{space 3}0.002{col 62}{space 4} .0478404{col 75}{space 3} .1739277
{txt}{space 14}_Iyq_2 {c |}{col 22}{res}{space 2}  -4.3715{col 34}{space 2}  .423027{col 45}{space 1}  -10.33{col 54}{space 3}0.000{col 62}{space 4}-5.273161{col 75}{space 3} -3.46984
{txt}{space 14}_Iyq_3 {c |}{col 22}{res}{space 2}-6.150037{col 34}{space 2} .4017046{col 45}{space 1}  -15.31{col 54}{space 3}0.000{col 62}{space 4} -7.00625{col 75}{space 3}-5.293824
{txt}{space 14}_Iyq_4 {c |}{col 22}{res}{space 2}-1.845817{col 34}{space 2} .1578563{col 45}{space 1}  -11.69{col 54}{space 3}0.000{col 62}{space 4} -2.18228{col 75}{space 3}-1.509354
{txt}{space 14}_Iyq_5 {c |}{col 22}{res}{space 2}-4.011569{col 34}{space 2} .2668075{col 45}{space 1}  -15.04{col 54}{space 3}0.000{col 62}{space 4}-4.580255{col 75}{space 3}-3.442882
{txt}{space 14}_Iyq_6 {c |}{col 22}{res}{space 2}-3.146788{col 34}{space 2} .2824427{col 45}{space 1}  -11.14{col 54}{space 3}0.000{col 62}{space 4}  -3.7488{col 75}{space 3}-2.544775
{txt}{space 14}_Iyq_7 {c |}{col 22}{res}{space 2}-.6430884{col 34}{space 2} .3364479{col 45}{space 1}   -1.91{col 54}{space 3}0.075{col 62}{space 4} -1.36021{col 75}{space 3} .0740334
{txt}{space 14}_Iyq_8 {c |}{col 22}{res}{space 2} .0749008{col 34}{space 2} .2981708{col 45}{space 1}    0.25{col 54}{space 3}0.805{col 62}{space 4}-.5606353{col 75}{space 3} .7104368
{txt}{space 14}_Iyq_9 {c |}{col 22}{res}{space 2}-1.435429{col 34}{space 2} .0866316{col 45}{space 1}  -16.57{col 54}{space 3}0.000{col 62}{space 4} -1.62008{col 75}{space 3}-1.250778
{txt}{space 13}_Iyq_10 {c |}{col 22}{res}{space 2}-4.658154{col 34}{space 2} .3899689{col 45}{space 1}  -11.94{col 54}{space 3}0.000{col 62}{space 4}-5.489353{col 75}{space 3}-3.826955
{txt}{space 13}_Iyq_11 {c |}{col 22}{res}{space 2} -3.00005{col 34}{space 2} .3864009{col 45}{space 1}   -7.76{col 54}{space 3}0.000{col 62}{space 4}-3.823644{col 75}{space 3}-2.176456
{txt}{space 13}_Iyq_12 {c |}{col 22}{res}{space 2}-5.632016{col 34}{space 2} .5705882{col 45}{space 1}   -9.87{col 54}{space 3}0.000{col 62}{space 4}-6.848196{col 75}{space 3}-4.415836
{txt}{space 13}_Iyq_13 {c |}{col 22}{res}{space 2} -6.28041{col 34}{space 2} .9044144{col 45}{space 1}   -6.94{col 54}{space 3}0.000{col 62}{space 4}-8.208124{col 75}{space 3}-4.352697
{txt}{space 13}_Iyq_14 {c |}{col 22}{res}{space 2}-9.305733{col 34}{space 2} 1.463119{col 45}{space 1}   -6.36{col 54}{space 3}0.000{col 62}{space 4} -12.4243{col 75}{space 3}-6.187168
{txt}{space 13}_Iyq_15 {c |}{col 22}{res}{space 2} -5.78196{col 34}{space 2} .9343594{col 45}{space 1}   -6.19{col 54}{space 3}0.000{col 62}{space 4}  -7.7735{col 75}{space 3} -3.79042
{txt}{space 13}_Iyq_16 {c |}{col 22}{res}{space 2} 3.777353{col 34}{space 2}  .625761{col 45}{space 1}    6.04{col 54}{space 3}0.000{col 62}{space 4} 2.443575{col 75}{space 3} 5.111132
{txt}{space 12}_Ihour_9 {c |}{col 22}{res}{space 2} .1130963{col 34}{space 2} .5395945{col 45}{space 1}    0.21{col 54}{space 3}0.837{col 62}{space 4}-1.037022{col 75}{space 3} 1.263215
{txt}{space 11}_Ihour_10 {c |}{col 22}{res}{space 2} .8593768{col 34}{space 2} .5872737{col 45}{space 1}    1.46{col 54}{space 3}0.164{col 62}{space 4}-.3923675{col 75}{space 3} 2.111121
{txt}{space 11}_Ihour_11 {c |}{col 22}{res}{space 2} 1.972168{col 34}{space 2} .6038373{col 45}{space 1}    3.27{col 54}{space 3}0.005{col 62}{space 4} .6851197{col 75}{space 3} 3.259217
{txt}{space 11}_Ihour_12 {c |}{col 22}{res}{space 2} 4.262541{col 34}{space 2}  .883639{col 45}{space 1}    4.82{col 54}{space 3}0.000{col 62}{space 4} 2.379109{col 75}{space 3} 6.145973
{txt}{space 11}_Ihour_13 {c |}{col 22}{res}{space 2}  2.69791{col 34}{space 2}  .662848{col 45}{space 1}    4.07{col 54}{space 3}0.001{col 62}{space 4} 1.285083{col 75}{space 3} 4.110737
{txt}{space 11}_Ihour_14 {c |}{col 22}{res}{space 2} 2.859594{col 34}{space 2} .6799315{col 45}{space 1}    4.21{col 54}{space 3}0.001{col 62}{space 4} 1.410354{col 75}{space 3} 4.308834
{txt}{space 11}_Ihour_15 {c |}{col 22}{res}{space 2} 3.106063{col 34}{space 2}  .651339{col 45}{space 1}    4.77{col 54}{space 3}0.000{col 62}{space 4} 1.717767{col 75}{space 3} 4.494359
{txt}{space 11}_Ihour_16 {c |}{col 22}{res}{space 2} 3.158644{col 34}{space 2} .6388873{col 45}{space 1}    4.94{col 54}{space 3}0.000{col 62}{space 4} 1.796888{col 75}{space 3}   4.5204
{txt}{space 11}_Ihour_17 {c |}{col 22}{res}{space 2} 2.998935{col 34}{space 2}   .61331{col 45}{space 1}    4.89{col 54}{space 3}0.000{col 62}{space 4} 1.691696{col 75}{space 3} 4.306174
{txt}{space 11}_Ihour_18 {c |}{col 22}{res}{space 2} 2.215252{col 34}{space 2} .5648198{col 45}{space 1}    3.92{col 54}{space 3}0.001{col 62}{space 4} 1.011367{col 75}{space 3} 3.419137
{txt}{space 11}_Ihour_19 {c |}{col 22}{res}{space 2} 1.637971{col 34}{space 2} .4490114{col 45}{space 1}    3.65{col 54}{space 3}0.002{col 62}{space 4} .6809261{col 75}{space 3} 2.595016
{txt}{space 11}_Ihour_20 {c |}{col 22}{res}{space 2} 1.162755{col 34}{space 2} .5792497{col 45}{space 1}    2.01{col 54}{space 3}0.063{col 62}{space 4}-.0718865{col 75}{space 3} 2.397396
{txt}{space 11}_Ihour_21 {c |}{col 22}{res}{space 2} .6579142{col 34}{space 2} .5221877{col 45}{space 1}    1.26{col 54}{space 3}0.227{col 62}{space 4}-.4551025{col 75}{space 3} 1.770931
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 19.70628{col 34}{space 2} 2.534879{col 45}{space 1}    7.77{col 54}{space 3}0.000{col 62}{space 4} 14.30331{col 75}{space 3} 25.10924
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. *outreg2 using 2ndstep_results.doc, append ctitle(OLS 5 Lags) 
. 
. **Durwin-Wu-Hausman test 
. reg mg_price_id_max load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe, vce(cluster year)

{txt}Linear regression                               Number of obs     = {res}    12,915
                                                {txt}{help j_robustsingular:F(2, 3) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.8010
                                                {txt}Root MSE          =    {res} 6.2243

{txt}{ralign 80:(Std. err. adjusted for {res:4} clusters in {res:year})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}mg_price_id_~x{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}load_ACT {c |}{col 16}{res}{space 2} 1.192323{col 28}{space 2} .1300121{col 39}{space 1}    9.17{col 48}{space 3}0.003{col 56}{space 4} .7785666{col 69}{space 3} 1.606079
{txt}solar_fc_error {c |}{col 16}{res}{space 2}  .762746{col 28}{space 2}  1.21354{col 39}{space 1}    0.63{col 48}{space 3}0.574{col 56}{space 4} -3.09928{col 69}{space 3} 4.624772
{txt}{space 1}wind_fc_error {c |}{col 16}{res}{space 2} 1.987307{col 28}{space 2} 2.275301{col 39}{space 1}    0.87{col 48}{space 3}0.447{col 56}{space 4}-5.253715{col 69}{space 3} 9.228329
{txt}{space 1}load_fc_error {c |}{col 16}{res}{space 2} 28.27284{col 28}{space 2} 9.605169{col 39}{space 1}    2.94{col 48}{space 3}0.060{col 56}{space 4}  -2.2951{col 69}{space 3} 58.84077
{txt}{space 6}co2price {c |}{col 16}{res}{space 2} .5148854{col 28}{space 2} .2405765{col 39}{space 1}    2.14{col 48}{space 3}0.122{col 56}{space 4}-.2507363{col 69}{space 3} 1.280507
{txt}{space 6}gasprice {c |}{col 16}{res}{space 2} 1.417329{col 28}{space 2}  .090021{col 39}{space 1}   15.74{col 48}{space 3}0.001{col 56}{space 4} 1.130842{col 69}{space 3} 1.703816
{txt}{space 8}_Iyq_2 {c |}{col 16}{res}{space 2} 1.770795{col 28}{space 2} .3225303{col 39}{space 1}    5.49{col 48}{space 3}0.012{col 56}{space 4} .7443597{col 69}{space 3}  2.79723
{txt}{space 8}_Iyq_3 {c |}{col 16}{res}{space 2} 1.121148{col 28}{space 2}  .788278{col 39}{space 1}    1.42{col 48}{space 3}0.250{col 56}{space 4}-1.387505{col 69}{space 3}   3.6298
{txt}{space 8}_Iyq_4 {c |}{col 16}{res}{space 2} 4.784176{col 28}{space 2} .4730367{col 39}{space 1}   10.11{col 48}{space 3}0.002{col 56}{space 4} 3.278761{col 69}{space 3}  6.28959
{txt}{space 8}_Iyq_5 {c |}{col 16}{res}{space 2}-7.966002{col 28}{space 2} 1.417345{col 39}{space 1}   -5.62{col 48}{space 3}0.011{col 56}{space 4}-12.47663{col 69}{space 3}-3.455378
{txt}{space 8}_Iyq_6 {c |}{col 16}{res}{space 2}-4.582025{col 28}{space 2} 2.206532{col 39}{space 1}   -2.08{col 48}{space 3}0.129{col 56}{space 4} -11.6042{col 69}{space 3} 2.440147
{txt}{space 8}_Iyq_7 {c |}{col 16}{res}{space 2} -1.86667{col 28}{space 2} 3.168174{col 39}{space 1}   -0.59{col 48}{space 3}0.597{col 56}{space 4}-11.94921{col 69}{space 3} 8.215873
{txt}{space 8}_Iyq_8 {c |}{col 16}{res}{space 2}-1.989841{col 28}{space 2} 3.437375{col 39}{space 1}   -0.58{col 48}{space 3}0.603{col 56}{space 4} -12.9291{col 69}{space 3} 8.949419
{txt}{space 8}_Iyq_9 {c |}{col 16}{res}{space 2}-6.873014{col 28}{space 2} 4.295917{col 39}{space 1}   -1.60{col 48}{space 3}0.208{col 56}{space 4}-20.54454{col 69}{space 3}  6.79851
{txt}{space 7}_Iyq_10 {c |}{col 16}{res}{space 2}-3.295015{col 28}{space 2} 5.229858{col 39}{space 1}   -0.63{col 48}{space 3}0.573{col 56}{space 4}-19.93876{col 69}{space 3} 13.34873
{txt}{space 7}_Iyq_11 {c |}{col 16}{res}{space 2}-4.995556{col 28}{space 2} 6.084451{col 39}{space 1}   -0.82{col 48}{space 3}0.472{col 56}{space 4}-24.35899{col 69}{space 3} 14.36788
{txt}{space 7}_Iyq_12 {c |}{col 16}{res}{space 2}-6.077695{col 28}{space 2} 5.257304{col 39}{space 1}   -1.16{col 48}{space 3}0.331{col 56}{space 4}-22.80878{col 69}{space 3} 10.65339
{txt}{space 7}_Iyq_13 {c |}{col 16}{res}{space 2}-10.62051{col 28}{space 2} 5.232955{col 39}{space 1}   -2.03{col 48}{space 3}0.135{col 56}{space 4}-27.27411{col 69}{space 3} 6.033086
{txt}{space 7}_Iyq_14 {c |}{col 16}{res}{space 2}-9.119275{col 28}{space 2} 4.413044{col 39}{space 1}   -2.07{col 48}{space 3}0.131{col 56}{space 4}-23.16355{col 69}{space 3}    4.925
{txt}{space 7}_Iyq_15 {c |}{col 16}{res}{space 2}-8.771148{col 28}{space 2} 6.426212{col 39}{space 1}   -1.36{col 48}{space 3}0.266{col 56}{space 4}-29.22222{col 69}{space 3} 11.67993
{txt}{space 7}_Iyq_16 {c |}{col 16}{res}{space 2}-14.82086{col 28}{space 2} 6.061363{col 39}{space 1}   -2.45{col 48}{space 3}0.092{col 56}{space 4}-34.11083{col 69}{space 3} 4.469101
{txt}{space 6}_Ihour_9 {c |}{col 16}{res}{space 2}-.9864795{col 28}{space 2} .5166789{col 39}{space 1}   -1.91{col 48}{space 3}0.152{col 56}{space 4}-2.630782{col 69}{space 3} .6578232
{txt}{space 5}_Ihour_10 {c |}{col 16}{res}{space 2}-1.455714{col 28}{space 2} .9056999{col 39}{space 1}   -1.61{col 48}{space 3}0.206{col 56}{space 4}-4.338055{col 69}{space 3} 1.426627
{txt}{space 5}_Ihour_11 {c |}{col 16}{res}{space 2}-2.722273{col 28}{space 2} 1.070223{col 39}{space 1}   -2.54{col 48}{space 3}0.084{col 56}{space 4}-6.128201{col 69}{space 3} .6836539
{txt}{space 5}_Ihour_12 {c |}{col 16}{res}{space 2}-3.744439{col 28}{space 2} 1.704833{col 39}{space 1}   -2.20{col 48}{space 3}0.116{col 56}{space 4}-9.169979{col 69}{space 3} 1.681102
{txt}{space 5}_Ihour_13 {c |}{col 16}{res}{space 2}-4.065854{col 28}{space 2} 1.107493{col 39}{space 1}   -3.67{col 48}{space 3}0.035{col 56}{space 4}-7.590392{col 69}{space 3} -.541317
{txt}{space 5}_Ihour_14 {c |}{col 16}{res}{space 2}-4.605001{col 28}{space 2} 1.134348{col 39}{space 1}   -4.06{col 48}{space 3}0.027{col 56}{space 4}-8.215002{col 69}{space 3}-.9949989
{txt}{space 5}_Ihour_15 {c |}{col 16}{res}{space 2}-5.142793{col 28}{space 2} 1.065738{col 39}{space 1}   -4.83{col 48}{space 3}0.017{col 56}{space 4}-8.534447{col 69}{space 3}-1.751139
{txt}{space 5}_Ihour_16 {c |}{col 16}{res}{space 2}-5.247499{col 28}{space 2} 1.020019{col 39}{space 1}   -5.14{col 48}{space 3}0.014{col 56}{space 4}-8.493655{col 69}{space 3}-2.001342
{txt}{space 5}_Ihour_17 {c |}{col 16}{res}{space 2}-5.165635{col 28}{space 2} .9309715{col 39}{space 1}   -5.55{col 48}{space 3}0.012{col 56}{space 4}-8.128402{col 69}{space 3}-2.202868
{txt}{space 5}_Ihour_18 {c |}{col 16}{res}{space 2}-3.900067{col 28}{space 2} .8378641{col 39}{space 1}   -4.65{col 48}{space 3}0.019{col 56}{space 4}-6.566525{col 69}{space 3} -1.23361
{txt}{space 5}_Ihour_19 {c |}{col 16}{res}{space 2}-3.168156{col 28}{space 2} .7183528{col 39}{space 1}   -4.41{col 48}{space 3}0.022{col 56}{space 4}-5.454275{col 69}{space 3}-.8820363
{txt}{space 5}_Ihour_20 {c |}{col 16}{res}{space 2} -2.31674{col 28}{space 2} .9231561{col 39}{space 1}   -2.51{col 48}{space 3}0.087{col 56}{space 4}-5.254635{col 69}{space 3} .6211548
{txt}{space 5}_Ihour_21 {c |}{col 16}{res}{space 2}-1.249562{col 28}{space 2} .8834717{col 39}{space 1}   -1.41{col 48}{space 3}0.252{col 56}{space 4}-4.061164{col 69}{space 3} 1.562039
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-11.92059{col 28}{space 2} 2.703166{col 39}{space 1}   -4.41{col 48}{space 3}0.022{col 56}{space 4}-20.52327{col 69}{space 3}-3.317904
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict uhat5
{txt}(option {bf:xb} assumed; fitted values)
(1 missing value generated)

{com}. reg pbid_max mg_price_id_max uhat5 $fe, robust

{txt}Linear regression                               Number of obs     = {res}    12,915
                                                {txt}F(30, 12884)      =  {res}  1897.53
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.7752
                                                {txt}Root MSE          =    {res} 5.9737

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}       pbid_max{col 17}{c |} Coefficient{col 29}  std. err.{col 41}      t{col 49}   P>|t|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mg_price_id_max {c |}{col 17}{res}{space 2} .4634276{col 29}{space 2} .0111073{col 40}{space 1}   41.72{col 49}{space 3}0.000{col 57}{space 4} .4416557{col 70}{space 3} .4851995
{txt}{space 10}uhat5 {c |}{col 17}{res}{space 2} .2606742{col 29}{space 2} .0138272{col 40}{space 1}   18.85{col 49}{space 3}0.000{col 57}{space 4} .2335709{col 70}{space 3} .2877776
{txt}{space 9}_Iyq_2 {c |}{col 17}{res}{space 2}-4.478208{col 29}{space 2} .3240873{col 40}{space 1}  -13.82{col 49}{space 3}0.000{col 57}{space 4}-5.113468{col 70}{space 3}-3.842949
{txt}{space 9}_Iyq_3 {c |}{col 17}{res}{space 2}-6.464801{col 29}{space 2}  .314532{col 40}{space 1}  -20.55{col 49}{space 3}0.000{col 57}{space 4}-7.081331{col 70}{space 3}-5.848272
{txt}{space 9}_Iyq_4 {c |}{col 17}{res}{space 2}-2.508732{col 29}{space 2} .3437256{col 40}{space 1}   -7.30{col 49}{space 3}0.000{col 57}{space 4}-3.182485{col 70}{space 3}-1.834979
{txt}{space 9}_Iyq_5 {c |}{col 17}{res}{space 2}-3.976033{col 29}{space 2} .3721253{col 40}{space 1}  -10.68{col 49}{space 3}0.000{col 57}{space 4}-4.705453{col 70}{space 3}-3.246612
{txt}{space 9}_Iyq_6 {c |}{col 17}{res}{space 2}-3.987413{col 29}{space 2} .3278149{col 40}{space 1}  -12.16{col 49}{space 3}0.000{col 57}{space 4}-4.629979{col 70}{space 3}-3.344847
{txt}{space 9}_Iyq_7 {c |}{col 17}{res}{space 2}-2.090969{col 29}{space 2} .3092758{col 40}{space 1}   -6.76{col 49}{space 3}0.000{col 57}{space 4}-2.697196{col 70}{space 3}-1.484743
{txt}{space 9}_Iyq_8 {c |}{col 17}{res}{space 2}-.7097984{col 29}{space 2} .3303497{col 40}{space 1}   -2.15{col 49}{space 3}0.032{col 57}{space 4}-1.357333{col 70}{space 3}-.0622641
{txt}{space 9}_Iyq_9 {c |}{col 17}{res}{space 2}-1.695791{col 29}{space 2} .3050345{col 40}{space 1}   -5.56{col 49}{space 3}0.000{col 57}{space 4}-2.293704{col 70}{space 3}-1.097878
{txt}{space 8}_Iyq_10 {c |}{col 17}{res}{space 2}-4.596231{col 29}{space 2} .3252544{col 40}{space 1}  -14.13{col 49}{space 3}0.000{col 57}{space 4}-5.233778{col 70}{space 3}-3.958684
{txt}{space 8}_Iyq_11 {c |}{col 17}{res}{space 2}-3.160537{col 29}{space 2} .3819142{col 40}{space 1}   -8.28{col 49}{space 3}0.000{col 57}{space 4}-3.909146{col 70}{space 3}-2.411929
{txt}{space 8}_Iyq_12 {c |}{col 17}{res}{space 2} -5.48731{col 29}{space 2} .3576889{col 40}{space 1}  -15.34{col 49}{space 3}0.000{col 57}{space 4}-6.188433{col 70}{space 3}-4.786186
{txt}{space 8}_Iyq_13 {c |}{col 17}{res}{space 2}-5.269479{col 29}{space 2}  .450986{col 40}{space 1}  -11.68{col 49}{space 3}0.000{col 57}{space 4}-6.153478{col 70}{space 3}-4.385479
{txt}{space 8}_Iyq_14 {c |}{col 17}{res}{space 2}-8.552089{col 29}{space 2} .4487499{col 40}{space 1}  -19.06{col 49}{space 3}0.000{col 57}{space 4}-9.431705{col 70}{space 3}-7.672472
{txt}{space 8}_Iyq_15 {c |}{col 17}{res}{space 2}-5.500868{col 29}{space 2} .5692827{col 40}{space 1}   -9.66{col 49}{space 3}0.000{col 57}{space 4}-6.616747{col 70}{space 3} -4.38499
{txt}{space 8}_Iyq_16 {c |}{col 17}{res}{space 2} 4.716785{col 29}{space 2} 1.503579{col 40}{space 1}    3.14{col 49}{space 3}0.002{col 57}{space 4} 1.769548{col 70}{space 3} 7.664022
{txt}{space 7}_Ihour_9 {c |}{col 17}{res}{space 2} -.178136{col 29}{space 2} .3541738{col 40}{space 1}   -0.50{col 49}{space 3}0.615{col 57}{space 4}-.8723691{col 70}{space 3} .5160971
{txt}{space 6}_Ihour_10 {c |}{col 17}{res}{space 2} .4929846{col 29}{space 2} .3454832{col 40}{space 1}    1.43{col 49}{space 3}0.154{col 57}{space 4}-.1842136{col 70}{space 3} 1.170183
{txt}{space 6}_Ihour_11 {c |}{col 17}{res}{space 2} 1.629615{col 29}{space 2}  .342465{col 40}{space 1}    4.76{col 49}{space 3}0.000{col 57}{space 4} .9583329{col 70}{space 3} 2.300897
{txt}{space 6}_Ihour_12 {c |}{col 17}{res}{space 2} 4.821164{col 29}{space 2} .7109493{col 40}{space 1}    6.78{col 49}{space 3}0.000{col 57}{space 4} 3.427597{col 70}{space 3}  6.21473
{txt}{space 6}_Ihour_13 {c |}{col 17}{res}{space 2} 2.425907{col 29}{space 2} .3414121{col 40}{space 1}    7.11{col 49}{space 3}0.000{col 57}{space 4} 1.756688{col 70}{space 3} 3.095125
{txt}{space 6}_Ihour_14 {c |}{col 17}{res}{space 2} 2.609873{col 29}{space 2} .3425044{col 40}{space 1}    7.62{col 49}{space 3}0.000{col 57}{space 4} 1.938513{col 70}{space 3} 3.281232
{txt}{space 6}_Ihour_15 {c |}{col 17}{res}{space 2} 2.955845{col 29}{space 2} .3435905{col 40}{space 1}    8.60{col 49}{space 3}0.000{col 57}{space 4} 2.282357{col 70}{space 3} 3.629334
{txt}{space 6}_Ihour_16 {c |}{col 17}{res}{space 2} 3.066704{col 29}{space 2} .3457314{col 40}{space 1}    8.87{col 49}{space 3}0.000{col 57}{space 4} 2.389019{col 70}{space 3} 3.744389
{txt}{space 6}_Ihour_17 {c |}{col 17}{res}{space 2} 2.906174{col 29}{space 2} .3470782{col 40}{space 1}    8.37{col 49}{space 3}0.000{col 57}{space 4} 2.225849{col 70}{space 3} 3.586499
{txt}{space 6}_Ihour_18 {c |}{col 17}{res}{space 2}  2.05987{col 29}{space 2} .3477504{col 40}{space 1}    5.92{col 49}{space 3}0.000{col 57}{space 4} 1.378228{col 70}{space 3} 2.741513
{txt}{space 6}_Ihour_19 {c |}{col 17}{res}{space 2} 1.648513{col 29}{space 2}  .354549{col 40}{space 1}    4.65{col 49}{space 3}0.000{col 57}{space 4} .9535442{col 70}{space 3} 2.343481
{txt}{space 6}_Ihour_20 {c |}{col 17}{res}{space 2} 1.047766{col 29}{space 2} .3659211{col 40}{space 1}    2.86{col 49}{space 3}0.004{col 57}{space 4} .3305068{col 70}{space 3} 1.765026
{txt}{space 6}_Ihour_21 {c |}{col 17}{res}{space 2} .5886576{col 29}{space 2} .3813875{col 40}{space 1}    1.54{col 49}{space 3}0.123{col 57}{space 4}-.1589184{col 70}{space 3} 1.336234
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 16.78751{col 29}{space 2} .6752537{col 40}{space 1}   24.86{col 49}{space 3}0.000{col 57}{space 4} 15.46391{col 70}{space 3} 18.11111
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. *-> uhat5 is significant 
. 
. ***(3) IV PF
. ivregress 2sls pbid_max (mg_price_id_max=load_ACT solar_share wind_share hydro_share co2price gasprice) $fe, vce(cluster yq)
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}    12,916
{txt}{col 1}{col 51}Wald chi2({res}29{txt}){col 67}= {res}   1004.29
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.7614
{txt}{col 51}Root MSE{col 67}=    {res} 6.1469

{txt}{ralign 81:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}       pbid_max{col 17}{c |} Coefficient{col 29}  std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mg_price_id_max {c |}{col 17}{res}{space 2} .6999874{col 29}{space 2} .0358172{col 40}{space 1}   19.54{col 49}{space 3}0.000{col 57}{space 4} .6297869{col 70}{space 3} .7701879
{txt}{space 9}_Iyq_2 {c |}{col 17}{res}{space 2}-4.701542{col 29}{space 2} .3377093{col 40}{space 1}  -13.92{col 49}{space 3}0.000{col 57}{space 4} -5.36344{col 70}{space 3}-4.039644
{txt}{space 9}_Iyq_3 {c |}{col 17}{res}{space 2} -6.67009{col 29}{space 2} .3098258{col 40}{space 1}  -21.53{col 49}{space 3}0.000{col 57}{space 4}-7.277337{col 70}{space 3}-6.062843
{txt}{space 9}_Iyq_4 {c |}{col 17}{res}{space 2}-2.413304{col 29}{space 2}   .13831{col 40}{space 1}  -17.45{col 49}{space 3}0.000{col 57}{space 4}-2.684387{col 70}{space 3}-2.142221
{txt}{space 9}_Iyq_5 {c |}{col 17}{res}{space 2}-4.123959{col 29}{space 2} .2185688{col 40}{space 1}  -18.87{col 49}{space 3}0.000{col 57}{space 4}-4.552346{col 70}{space 3}-3.695572
{txt}{space 9}_Iyq_6 {c |}{col 17}{res}{space 2}-4.109936{col 29}{space 2} .1906796{col 40}{space 1}  -21.55{col 49}{space 3}0.000{col 57}{space 4}-4.483661{col 70}{space 3}-3.736211
{txt}{space 9}_Iyq_7 {c |}{col 17}{res}{space 2}-1.872729{col 29}{space 2} .3238416{col 40}{space 1}   -5.78{col 49}{space 3}0.000{col 57}{space 4}-2.507447{col 70}{space 3}-1.238011
{txt}{space 9}_Iyq_8 {c |}{col 17}{res}{space 2}-.5416501{col 29}{space 2} .2537516{col 40}{space 1}   -2.13{col 49}{space 3}0.033{col 57}{space 4}-1.038994{col 70}{space 3}-.0443062
{txt}{space 9}_Iyq_9 {c |}{col 17}{res}{space 2}-1.743625{col 29}{space 2} .0703974{col 40}{space 1}  -24.77{col 49}{space 3}0.000{col 57}{space 4}-1.881602{col 70}{space 3}-1.605649
{txt}{space 8}_Iyq_10 {c |}{col 17}{res}{space 2}-4.807224{col 29}{space 2} .3183833{col 40}{space 1}  -15.10{col 49}{space 3}0.000{col 57}{space 4}-5.431244{col 70}{space 3}-4.183204
{txt}{space 8}_Iyq_11 {c |}{col 17}{res}{space 2}-3.363492{col 29}{space 2} .3071484{col 40}{space 1}  -10.95{col 49}{space 3}0.000{col 57}{space 4}-3.965491{col 70}{space 3}-2.761492
{txt}{space 8}_Iyq_12 {c |}{col 17}{res}{space 2}-5.803684{col 29}{space 2} .4686918{col 40}{space 1}  -12.38{col 49}{space 3}0.000{col 57}{space 4}-6.722304{col 70}{space 3}-4.885065
{txt}{space 8}_Iyq_13 {c |}{col 17}{res}{space 2}-5.790888{col 29}{space 2}  .774087{col 40}{space 1}   -7.48{col 49}{space 3}0.000{col 57}{space 4}-7.308071{col 70}{space 3}-4.273705
{txt}{space 8}_Iyq_14 {c |}{col 17}{res}{space 2}-9.349695{col 29}{space 2}  1.18728{col 40}{space 1}   -7.87{col 49}{space 3}0.000{col 57}{space 4}-11.67672{col 70}{space 3}-7.022669
{txt}{space 8}_Iyq_15 {c |}{col 17}{res}{space 2}-6.004736{col 29}{space 2} .7527912{col 40}{space 1}   -7.98{col 49}{space 3}0.000{col 57}{space 4} -7.48018{col 70}{space 3}-4.529293
{txt}{space 8}_Iyq_16 {c |}{col 17}{res}{space 2} 4.339231{col 29}{space 2} .5578224{col 40}{space 1}    7.78{col 49}{space 3}0.000{col 57}{space 4} 3.245919{col 70}{space 3} 5.432543
{txt}{space 7}_Ihour_9 {c |}{col 17}{res}{space 2}-.1066707{col 29}{space 2} .4473911{col 40}{space 1}   -0.24{col 49}{space 3}0.812{col 57}{space 4}-.9835412{col 70}{space 3} .7701997
{txt}{space 6}_Ihour_10 {c |}{col 17}{res}{space 2} .5984567{col 29}{space 2}  .485203{col 40}{space 1}    1.23{col 49}{space 3}0.217{col 57}{space 4}-.3525238{col 70}{space 3} 1.549437
{txt}{space 6}_Ihour_11 {c |}{col 17}{res}{space 2} 1.732082{col 29}{space 2} .5008039{col 40}{space 1}    3.46{col 49}{space 3}0.001{col 57}{space 4} .7505248{col 70}{space 3}  2.71364
{txt}{space 6}_Ihour_12 {c |}{col 17}{res}{space 2} 4.867081{col 29}{space 2} .9055918{col 40}{space 1}    5.37{col 49}{space 3}0.000{col 57}{space 4} 3.092154{col 70}{space 3} 6.642009
{txt}{space 6}_Ihour_13 {c |}{col 17}{res}{space 2} 2.516129{col 29}{space 2} .5733927{col 40}{space 1}    4.39{col 49}{space 3}0.000{col 57}{space 4}   1.3923{col 70}{space 3} 3.639958
{txt}{space 6}_Ihour_14 {c |}{col 17}{res}{space 2} 2.687739{col 29}{space 2} .5912853{col 40}{space 1}    4.55{col 49}{space 3}0.000{col 57}{space 4} 1.528841{col 70}{space 3} 3.846637
{txt}{space 6}_Ihour_15 {c |}{col 17}{res}{space 2} 2.999745{col 29}{space 2} .5520242{col 40}{space 1}    5.43{col 49}{space 3}0.000{col 57}{space 4} 1.917798{col 70}{space 3} 4.081693
{txt}{space 6}_Ihour_16 {c |}{col 17}{res}{space 2} 3.083922{col 29}{space 2} .5281487{col 40}{space 1}    5.84{col 49}{space 3}0.000{col 57}{space 4}  2.04877{col 70}{space 3} 4.119075
{txt}{space 6}_Ihour_17 {c |}{col 17}{res}{space 2} 2.913107{col 29}{space 2} .5016868{col 40}{space 1}    5.81{col 49}{space 3}0.000{col 57}{space 4} 1.929819{col 70}{space 3} 3.896395
{txt}{space 6}_Ihour_18 {c |}{col 17}{res}{space 2} 2.094665{col 29}{space 2} .4847213{col 40}{space 1}    4.32{col 49}{space 3}0.000{col 57}{space 4} 1.144629{col 70}{space 3} 3.044702
{txt}{space 6}_Ihour_19 {c |}{col 17}{res}{space 2} 1.669685{col 29}{space 2} .3990262{col 40}{space 1}    4.18{col 49}{space 3}0.000{col 57}{space 4} .8876081{col 70}{space 3} 2.451762
{txt}{space 6}_Ihour_20 {c |}{col 17}{res}{space 2} 1.111882{col 29}{space 2} .4591171{col 40}{space 1}    2.42{col 49}{space 3}0.015{col 57}{space 4} .2120293{col 70}{space 3} 2.011735
{txt}{space 6}_Ihour_21 {c |}{col 17}{res}{space 2} .6854684{col 29}{space 2} .4719819{col 40}{space 1}    1.45{col 49}{space 3}0.146{col 57}{space 4}-.2395992{col 70}{space 3} 1.610536
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 18.15749{col 29}{space 2} 2.056263{col 40}{space 1}    8.83{col 49}{space 3}0.000{col 57}{space 4} 14.12729{col 70}{space 3} 22.18769
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 93}Instrumented: {res:mg_price_id_max}{p_end}
{p 0 14 93}{space 1}Instruments: {res:_Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 _Ihour_9 _Ihour_10 _Ihour_11 _Ihour_12 _Ihour_13 _Ihour_14 _Ihour_15 _Ihour_16 _Ihour_17 _Ihour_18 _Ihour_19 _Ihour_20 _Ihour_21 load_ACT solar_share wind_share hydro_share co2price gasprice}{p_end}

{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_results.doc, append ctitle(IV PF) addstat("Chi²", e(chi2))
. 
. ***(4) IV Lags
. ivregress 2sls pbid_max (mg_price_id_max=$instr_lag) $fe, vce(cluster yq)
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}    12,912
{txt}{col 1}{col 51}Wald chi2({res}29{txt}){col 67}= {res}    738.21
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.7417
{txt}{col 51}Root MSE{col 67}=    {res} 6.3934

{txt}{ralign 81:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}       pbid_max{col 17}{c |} Coefficient{col 29}  std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mg_price_id_max {c |}{col 17}{res}{space 2}  .819524{col 29}{space 2} .0340624{col 40}{space 1}   24.06{col 49}{space 3}0.000{col 57}{space 4} .7527629{col 70}{space 3} .8862851
{txt}{space 9}_Iyq_2 {c |}{col 17}{res}{space 2}-3.561269{col 29}{space 2} .3018479{col 40}{space 1}  -11.80{col 49}{space 3}0.000{col 57}{space 4} -4.15288{col 70}{space 3}-2.969658
{txt}{space 9}_Iyq_3 {c |}{col 17}{res}{space 2}-5.627423{col 29}{space 2}  .281349{col 40}{space 1}  -20.00{col 49}{space 3}0.000{col 57}{space 4}-6.178857{col 70}{space 3}-5.075989
{txt}{space 9}_Iyq_4 {c |}{col 17}{res}{space 2}-2.841452{col 29}{space 2} .1241021{col 40}{space 1}  -22.90{col 49}{space 3}0.000{col 57}{space 4}-3.084688{col 70}{space 3}-2.598217
{txt}{space 9}_Iyq_5 {c |}{col 17}{res}{space 2}-3.365305{col 29}{space 2} .2078541{col 40}{space 1}  -16.19{col 49}{space 3}0.000{col 57}{space 4}-3.772692{col 70}{space 3}-2.957919
{txt}{space 9}_Iyq_6 {c |}{col 17}{res}{space 2}-3.477356{col 29}{space 2} .1630479{col 40}{space 1}  -21.33{col 49}{space 3}0.000{col 57}{space 4}-3.796924{col 70}{space 3}-3.157787
{txt}{space 9}_Iyq_7 {c |}{col 17}{res}{space 2}-2.929372{col 29}{space 2} .3250992{col 40}{space 1}   -9.01{col 49}{space 3}0.000{col 57}{space 4}-3.566555{col 70}{space 3} -2.29219
{txt}{space 9}_Iyq_8 {c |}{col 17}{res}{space 2}-1.350813{col 29}{space 2} .2333632{col 40}{space 1}   -5.79{col 49}{space 3}0.000{col 57}{space 4}-1.808196{col 70}{space 3}-.8934292
{txt}{space 9}_Iyq_9 {c |}{col 17}{res}{space 2}-1.481121{col 29}{space 2} .0671155{col 40}{space 1}  -22.07{col 49}{space 3}0.000{col 57}{space 4}-1.612665{col 70}{space 3}-1.349577
{txt}{space 8}_Iyq_10 {c |}{col 17}{res}{space 2}-3.736082{col 29}{space 2} .2849707{col 40}{space 1}  -13.11{col 49}{space 3}0.000{col 57}{space 4}-4.294614{col 70}{space 3} -3.17755
{txt}{space 8}_Iyq_11 {c |}{col 17}{res}{space 2}-2.332205{col 29}{space 2} .2758966{col 40}{space 1}   -8.45{col 49}{space 3}0.000{col 57}{space 4}-2.872952{col 70}{space 3}-1.791457
{txt}{space 8}_Iyq_12 {c |}{col 17}{res}{space 2}-4.210987{col 29}{space 2} .4518948{col 40}{space 1}   -9.32{col 49}{space 3}0.000{col 57}{space 4}-5.096685{col 70}{space 3}-3.325289
{txt}{space 8}_Iyq_13 {c |}{col 17}{res}{space 2}-3.180988{col 29}{space 2} .7375104{col 40}{space 1}   -4.31{col 49}{space 3}0.000{col 57}{space 4}-4.626482{col 70}{space 3}-1.735494
{txt}{space 8}_Iyq_14 {c |}{col 17}{res}{space 2}-5.370616{col 29}{space 2} 1.109481{col 40}{space 1}   -4.84{col 49}{space 3}0.000{col 57}{space 4}-7.545158{col 70}{space 3}-3.196073
{txt}{space 8}_Iyq_15 {c |}{col 17}{res}{space 2}-3.481932{col 29}{space 2} .6946586{col 40}{space 1}   -5.01{col 49}{space 3}0.000{col 57}{space 4}-4.843438{col 70}{space 3}-2.120426
{txt}{space 8}_Iyq_16 {c |}{col 17}{res}{space 2} 6.234728{col 29}{space 2} .5410631{col 40}{space 1}   11.52{col 49}{space 3}0.000{col 57}{space 4} 5.174264{col 70}{space 3} 7.295192
{txt}{space 7}_Ihour_9 {c |}{col 17}{res}{space 2}-.4454596{col 29}{space 2} .4376832{col 40}{space 1}   -1.02{col 49}{space 3}0.309{col 57}{space 4}-1.303303{col 70}{space 3} .4123838
{txt}{space 6}_Ihour_10 {c |}{col 17}{res}{space 2} .0910386{col 29}{space 2} .4947581{col 40}{space 1}    0.18{col 49}{space 3}0.854{col 57}{space 4}-.8786694{col 70}{space 3} 1.060747
{txt}{space 6}_Ihour_11 {c |}{col 17}{res}{space 2} 1.239561{col 29}{space 2}  .508621{col 40}{space 1}    2.44{col 49}{space 3}0.015{col 57}{space 4} .2426822{col 70}{space 3}  2.23644
{txt}{space 6}_Ihour_12 {c |}{col 17}{res}{space 2} 4.654835{col 29}{space 2} .9564605{col 40}{space 1}    4.87{col 49}{space 3}0.000{col 57}{space 4} 2.780207{col 70}{space 3} 6.529463
{txt}{space 6}_Ihour_13 {c |}{col 17}{res}{space 2} 2.098807{col 29}{space 2} .5858711{col 40}{space 1}    3.58{col 49}{space 3}0.000{col 57}{space 4} .9505212{col 70}{space 3} 3.247094
{txt}{space 6}_Ihour_14 {c |}{col 17}{res}{space 2} 2.317173{col 29}{space 2} .6093705{col 40}{space 1}    3.80{col 49}{space 3}0.000{col 57}{space 4} 1.122829{col 70}{space 3} 3.511518
{txt}{space 6}_Ihour_15 {c |}{col 17}{res}{space 2} 2.797546{col 29}{space 2} .5607591{col 40}{space 1}    4.99{col 49}{space 3}0.000{col 57}{space 4} 1.698479{col 70}{space 3} 3.896614
{txt}{space 6}_Ihour_16 {c |}{col 17}{res}{space 2} 3.013986{col 29}{space 2} .5344048{col 40}{space 1}    5.64{col 49}{space 3}0.000{col 57}{space 4} 1.966572{col 70}{space 3}   4.0614
{txt}{space 6}_Ihour_17 {c |}{col 17}{res}{space 2} 2.894159{col 29}{space 2} .5019171{col 40}{space 1}    5.77{col 49}{space 3}0.000{col 57}{space 4}  1.91042{col 70}{space 3} 3.877899
{txt}{space 6}_Ihour_18 {c |}{col 17}{res}{space 2} 1.937783{col 29}{space 2} .4932909{col 40}{space 1}    3.93{col 49}{space 3}0.000{col 57}{space 4} .9709509{col 70}{space 3} 2.904616
{txt}{space 6}_Ihour_19 {c |}{col 17}{res}{space 2}  1.56058{col 29}{space 2} .3960041{col 40}{space 1}    3.94{col 49}{space 3}0.000{col 57}{space 4} .7844267{col 70}{space 3} 2.336734
{txt}{space 6}_Ihour_20 {c |}{col 17}{res}{space 2} .8122554{col 29}{space 2} .4582597{col 40}{space 1}    1.77{col 49}{space 3}0.076{col 57}{space 4}-.0859171{col 70}{space 3} 1.710428
{txt}{space 6}_Ihour_21 {c |}{col 17}{res}{space 2} .2408469{col 29}{space 2} .4422352{col 40}{space 1}    0.54{col 49}{space 3}0.586{col 57}{space 4}-.6259181{col 70}{space 3} 1.107612
{txt}{space 10}_cons {c |}{col 17}{res}{space 2}  11.3257{col 29}{space 2} 1.782444{col 40}{space 1}    6.35{col 49}{space 3}0.000{col 57}{space 4} 7.832169{col 70}{space 3} 14.81922
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 93}Instrumented: {res:mg_price_id_max}{p_end}
{p 0 14 93}{space 1}Instruments: {res:_Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 _Ihour_9 _Ihour_10 _Ihour_11 _Ihour_12 _Ihour_13 _Ihour_14 _Ihour_15 _Ihour_16 _Ihour_17 _Ihour_18 _Ihour_19 _Ihour_20 _Ihour_21 lag_load_ACT lag_solar_share lag_wind_share lag_hydro_share lag_co2price lag_gasprice}{p_end}

{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_results.doc, append ctitle(IV 1 Lag) addstat("Chi²", e(chi2))
. 
. *********Appendix
. *****First stage regressions
. reg mg_price_id_max load_ACT solar_share wind_share hydro_share co2price gasprice $fe, vce(cluster yq)

{txt}Linear regression                               Number of obs     = {res}    12,916
                                                {txt}{help j_robustsingular:F(14, 15) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.8898
                                                {txt}Root MSE          =    {res} 4.6311

{txt}{ralign 78:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}mg_price_i~x{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}load_ACT {c |}{col 14}{res}{space 2} .9698904{col 26}{space 2} .0933563{col 37}{space 1}   10.39{col 46}{space 3}0.000{col 54}{space 4} .7709061{col 67}{space 3} 1.168875
{txt}{space 1}solar_share {c |}{col 14}{res}{space 2}-.2794258{col 26}{space 2} .0536137{col 37}{space 1}   -5.21{col 46}{space 3}0.000{col 54}{space 4}-.3937006{col 67}{space 3}-.1651509
{txt}{space 2}wind_share {c |}{col 14}{res}{space 2} -.428762{col 26}{space 2} .0403652{col 37}{space 1}  -10.62{col 46}{space 3}0.000{col 54}{space 4}-.5147983{col 67}{space 3}-.3427256
{txt}{space 1}hydro_share {c |}{col 14}{res}{space 2}-.2519908{col 26}{space 2} .1069206{col 37}{space 1}   -2.36{col 46}{space 3}0.032{col 54}{space 4}-.4798866{col 67}{space 3} -.024095
{txt}{space 4}co2price {c |}{col 14}{res}{space 2}    .4805{col 26}{space 2} .2365157{col 37}{space 1}    2.03{col 46}{space 3}0.060{col 54}{space 4}-.0236213{col 67}{space 3} .9846214
{txt}{space 4}gasprice {c |}{col 14}{res}{space 2} 1.303732{col 26}{space 2} .0844554{col 37}{space 1}   15.44{col 46}{space 3}0.000{col 54}{space 4} 1.123719{col 67}{space 3} 1.483744
{txt}{space 6}_Iyq_2 {c |}{col 14}{res}{space 2}-.6303206{col 26}{space 2}  .618676{col 37}{space 1}   -1.02{col 46}{space 3}0.324{col 54}{space 4}-1.948997{col 67}{space 3}  .688356
{txt}{space 6}_Iyq_3 {c |}{col 14}{res}{space 2} -3.41507{col 26}{space 2} 1.188579{col 37}{space 1}   -2.87{col 46}{space 3}0.012{col 54}{space 4}-5.948466{col 67}{space 3}-.8816753
{txt}{space 6}_Iyq_4 {c |}{col 14}{res}{space 2} 1.760573{col 26}{space 2} .8073598{col 37}{space 1}    2.18{col 46}{space 3}0.046{col 54}{space 4} .0397265{col 67}{space 3}  3.48142
{txt}{space 6}_Iyq_5 {c |}{col 14}{res}{space 2}-5.105183{col 26}{space 2} 1.252019{col 37}{space 1}   -4.08{col 46}{space 3}0.001{col 54}{space 4}-7.773799{col 67}{space 3}-2.436567
{txt}{space 6}_Iyq_6 {c |}{col 14}{res}{space 2}-4.197427{col 26}{space 2} 2.554153{col 37}{space 1}   -1.64{col 46}{space 3}0.121{col 54}{space 4}-9.641476{col 67}{space 3} 1.246622
{txt}{space 6}_Iyq_7 {c |}{col 14}{res}{space 2}-4.573398{col 26}{space 2} 3.199735{col 37}{space 1}   -1.43{col 46}{space 3}0.173{col 54}{space 4}-11.39347{col 67}{space 3} 2.246676
{txt}{space 6}_Iyq_8 {c |}{col 14}{res}{space 2}-2.850815{col 26}{space 2} 3.624319{col 37}{space 1}   -0.79{col 46}{space 3}0.444{col 54}{space 4}-10.57587{col 67}{space 3} 4.874237
{txt}{space 6}_Iyq_9 {c |}{col 14}{res}{space 2} -6.47135{col 26}{space 2} 3.955725{col 37}{space 1}   -1.64{col 46}{space 3}0.123{col 54}{space 4}-14.90278{col 67}{space 3} 1.960078
{txt}{space 5}_Iyq_10 {c |}{col 14}{res}{space 2}  -4.0569{col 26}{space 2} 4.748807{col 37}{space 1}   -0.85{col 46}{space 3}0.406{col 54}{space 4}-14.17874{col 67}{space 3} 6.064943
{txt}{space 5}_Iyq_11 {c |}{col 14}{res}{space 2}-8.464347{col 26}{space 2} 5.081893{col 37}{space 1}   -1.67{col 46}{space 3}0.117{col 54}{space 4}-19.29615{col 67}{space 3} 2.367452
{txt}{space 5}_Iyq_12 {c |}{col 14}{res}{space 2}-5.080259{col 26}{space 2} 4.561028{col 37}{space 1}   -1.11{col 46}{space 3}0.283{col 54}{space 4}-14.80186{col 67}{space 3} 4.641343
{txt}{space 5}_Iyq_13 {c |}{col 14}{res}{space 2}-9.259563{col 26}{space 2}  4.25181{col 37}{space 1}   -2.18{col 46}{space 3}0.046{col 54}{space 4}-18.32208{col 67}{space 3}-.1970448
{txt}{space 5}_Iyq_14 {c |}{col 14}{res}{space 2}-8.637799{col 26}{space 2} 4.023816{col 37}{space 1}   -2.15{col 46}{space 3}0.049{col 54}{space 4}-17.21436{col 67}{space 3}-.0612371
{txt}{space 5}_Iyq_15 {c |}{col 14}{res}{space 2}-9.764105{col 26}{space 2} 5.179229{col 37}{space 1}   -1.89{col 46}{space 3}0.079{col 54}{space 4}-20.80337{col 67}{space 3}  1.27516
{txt}{space 5}_Iyq_16 {c |}{col 14}{res}{space 2}-10.39395{col 26}{space 2}  5.69552{col 37}{space 1}   -1.82{col 46}{space 3}0.088{col 54}{space 4}-22.53366{col 67}{space 3} 1.745761
{txt}{space 4}_Ihour_9 {c |}{col 14}{res}{space 2} .2881471{col 26}{space 2}  .475004{col 37}{space 1}    0.61{col 46}{space 3}0.553{col 54}{space 4}-.7242999{col 67}{space 3} 1.300594
{txt}{space 3}_Ihour_10 {c |}{col 14}{res}{space 2} .4798244{col 26}{space 2} .6488606{col 37}{space 1}    0.74{col 46}{space 3}0.471{col 54}{space 4}-.9031893{col 67}{space 3} 1.862838
{txt}{space 3}_Ihour_11 {c |}{col 14}{res}{space 2}  .038431{col 26}{space 2} .7754609{col 37}{space 1}    0.05{col 46}{space 3}0.961{col 54}{space 4}-1.614425{col 67}{space 3} 1.691287
{txt}{space 3}_Ihour_12 {c |}{col 14}{res}{space 2}-.2229625{col 26}{space 2} 1.014543{col 37}{space 1}   -0.22{col 46}{space 3}0.829{col 54}{space 4}-2.385411{col 67}{space 3} 1.939486
{txt}{space 3}_Ihour_13 {c |}{col 14}{res}{space 2}-.2630562{col 26}{space 2} .8505148{col 37}{space 1}   -0.31{col 46}{space 3}0.761{col 54}{space 4}-2.075886{col 67}{space 3} 1.549773
{txt}{space 3}_Ihour_14 {c |}{col 14}{res}{space 2} -.569832{col 26}{space 2} .8962491{col 37}{space 1}   -0.64{col 46}{space 3}0.534{col 54}{space 4}-2.480142{col 67}{space 3} 1.340478
{txt}{space 3}_Ihour_15 {c |}{col 14}{res}{space 2}-.9435718{col 26}{space 2} .8894802{col 37}{space 1}   -1.06{col 46}{space 3}0.306{col 54}{space 4}-2.839454{col 67}{space 3} .9523103
{txt}{space 3}_Ihour_16 {c |}{col 14}{res}{space 2}   -.9017{col 26}{space 2} .8865575{col 37}{space 1}   -1.02{col 46}{space 3}0.325{col 54}{space 4}-2.791353{col 67}{space 3} .9879526
{txt}{space 3}_Ihour_17 {c |}{col 14}{res}{space 2}-.8904195{col 26}{space 2} .8072226{col 37}{space 1}   -1.10{col 46}{space 3}0.287{col 54}{space 4}-2.610974{col 67}{space 3} .8301347
{txt}{space 3}_Ihour_18 {c |}{col 14}{res}{space 2} .1937658{col 26}{space 2} .6658985{col 37}{space 1}    0.29{col 46}{space 3}0.775{col 54}{space 4}-1.225563{col 67}{space 3} 1.613095
{txt}{space 3}_Ihour_19 {c |}{col 14}{res}{space 2} .7816323{col 26}{space 2} .5586846{col 37}{space 1}    1.40{col 46}{space 3}0.182{col 54}{space 4}-.4091757{col 67}{space 3}  1.97244
{txt}{space 3}_Ihour_20 {c |}{col 14}{res}{space 2} 1.297366{col 26}{space 2}  .618501{col 37}{space 1}    2.10{col 46}{space 3}0.053{col 54}{space 4}-.0209375{col 67}{space 3}  2.61567
{txt}{space 3}_Ihour_21 {c |}{col 14}{res}{space 2} 1.780341{col 26}{space 2} .4002402{col 37}{space 1}    4.45{col 46}{space 3}0.000{col 54}{space 4} .9272497{col 67}{space 3} 2.633433
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  8.46371{col 26}{space 2} 3.448597{col 37}{space 1}    2.45{col 46}{space 3}0.027{col 54}{space 4}   1.1132{col 67}{space 3} 15.81422
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2nd_step_firststage.doc, replace ctitle(IV PF first stage) 
. 
. reg mg_price_id_max $instr_lag $fe, vce(cluster yq)

{txt}Linear regression                               Number of obs     = {res}    12,912
                                                {txt}{help j_robustsingular:F(14, 15) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.7470
                                                {txt}Root MSE          =    {res} 7.0175

{txt}{ralign 81:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}mg_price_id_max{col 17}{c |} Coefficient{col 29}  std. err.{col 41}      t{col 49}   P>|t|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lag_load_ACT {c |}{col 17}{res}{space 2} .4214848{col 29}{space 2}  .072652{col 40}{space 1}    5.80{col 49}{space 3}0.000{col 57}{space 4} .2666306{col 70}{space 3} .5763389
{txt}lag_solar_share {c |}{col 17}{res}{space 2}-.1214674{col 29}{space 2} .0805065{col 40}{space 1}   -1.51{col 49}{space 3}0.152{col 57}{space 4} -.293063{col 70}{space 3} .0501282
{txt}{space 1}lag_wind_share {c |}{col 17}{res}{space 2}-.2306625{col 29}{space 2} .0417456{col 40}{space 1}   -5.53{col 49}{space 3}0.000{col 57}{space 4}-.3196412{col 70}{space 3}-.1416838
{txt}lag_hydro_share {c |}{col 17}{res}{space 2} -.399584{col 29}{space 2} .1542328{col 40}{space 1}   -2.59{col 49}{space 3}0.020{col 57}{space 4}-.7283234{col 70}{space 3}-.0708446
{txt}{space 3}lag_co2price {c |}{col 17}{res}{space 2}   .50141{col 29}{space 2} .3091185{col 40}{space 1}    1.62{col 49}{space 3}0.126{col 57}{space 4}-.1574604{col 70}{space 3}  1.16028
{txt}{space 3}lag_gasprice {c |}{col 17}{res}{space 2} 1.428649{col 29}{space 2} .1047367{col 40}{space 1}   13.64{col 49}{space 3}0.000{col 57}{space 4} 1.205408{col 70}{space 3}  1.65189
{txt}{space 9}_Iyq_2 {c |}{col 17}{res}{space 2}  -.44652{col 29}{space 2} .7785558{col 40}{space 1}   -0.57{col 49}{space 3}0.575{col 57}{space 4}-2.105972{col 70}{space 3} 1.212932
{txt}{space 9}_Iyq_3 {c |}{col 17}{res}{space 2}-1.919812{col 29}{space 2} 1.493615{col 40}{space 1}   -1.29{col 49}{space 3}0.218{col 57}{space 4}-5.103377{col 70}{space 3} 1.263753
{txt}{space 9}_Iyq_4 {c |}{col 17}{res}{space 2} 1.234683{col 29}{space 2} .9986713{col 40}{space 1}    1.24{col 49}{space 3}0.235{col 57}{space 4}-.8939346{col 70}{space 3} 3.363301
{txt}{space 9}_Iyq_5 {c |}{col 17}{res}{space 2}-4.072977{col 29}{space 2}  1.70694{col 40}{space 1}   -2.39{col 49}{space 3}0.031{col 57}{space 4}-7.711233{col 70}{space 3}-.4347217
{txt}{space 9}_Iyq_6 {c |}{col 17}{res}{space 2}-2.988591{col 29}{space 2} 3.643812{col 40}{space 1}   -0.82{col 49}{space 3}0.425{col 57}{space 4}-10.75519{col 70}{space 3} 4.778012
{txt}{space 9}_Iyq_7 {c |}{col 17}{res}{space 2} -2.92508{col 29}{space 2} 4.291378{col 40}{space 1}   -0.68{col 49}{space 3}0.506{col 57}{space 4}-12.07194{col 70}{space 3} 6.221775
{txt}{space 9}_Iyq_8 {c |}{col 17}{res}{space 2}-3.471224{col 29}{space 2} 4.667411{col 40}{space 1}   -0.74{col 49}{space 3}0.469{col 57}{space 4}-13.41958{col 70}{space 3} 6.477128
{txt}{space 9}_Iyq_9 {c |}{col 17}{res}{space 2}-6.455475{col 29}{space 2} 5.167668{col 40}{space 1}   -1.25{col 49}{space 3}0.231{col 57}{space 4} -17.4701{col 70}{space 3}  4.55915
{txt}{space 8}_Iyq_10 {c |}{col 17}{res}{space 2}-5.262262{col 29}{space 2} 6.091341{col 40}{space 1}   -0.86{col 49}{space 3}0.401{col 57}{space 4}-18.24565{col 70}{space 3} 7.721123
{txt}{space 8}_Iyq_11 {c |}{col 17}{res}{space 2}-6.651845{col 29}{space 2} 6.507564{col 40}{space 1}   -1.02{col 49}{space 3}0.323{col 57}{space 4}-20.52239{col 70}{space 3} 7.218701
{txt}{space 8}_Iyq_12 {c |}{col 17}{res}{space 2}-5.131278{col 29}{space 2} 5.835826{col 40}{space 1}   -0.88{col 49}{space 3}0.393{col 57}{space 4}-17.57005{col 70}{space 3} 7.307491
{txt}{space 8}_Iyq_13 {c |}{col 17}{res}{space 2}-7.922813{col 29}{space 2} 5.651981{col 40}{space 1}   -1.40{col 49}{space 3}0.181{col 57}{space 4}-19.96973{col 70}{space 3} 4.124099
{txt}{space 8}_Iyq_14 {c |}{col 17}{res}{space 2}-10.25084{col 29}{space 2} 5.268193{col 40}{space 1}   -1.95{col 49}{space 3}0.071{col 57}{space 4}-21.47973{col 70}{space 3} .9780455
{txt}{space 8}_Iyq_15 {c |}{col 17}{res}{space 2}-8.734659{col 29}{space 2} 6.786681{col 40}{space 1}   -1.29{col 49}{space 3}0.218{col 57}{space 4}-23.20013{col 70}{space 3} 5.730808
{txt}{space 8}_Iyq_16 {c |}{col 17}{res}{space 2}-12.65054{col 29}{space 2} 7.396367{col 40}{space 1}   -1.71{col 49}{space 3}0.108{col 57}{space 4}-28.41552{col 70}{space 3} 3.114444
{txt}{space 7}_Ihour_9 {c |}{col 17}{res}{space 2}   1.4913{col 29}{space 2} .7028935{col 40}{space 1}    2.12{col 49}{space 3}0.051{col 57}{space 4}-.0068822{col 70}{space 3} 2.989482
{txt}{space 6}_Ihour_10 {c |}{col 17}{res}{space 2} 2.411459{col 29}{space 2} 1.014141{col 40}{space 1}    2.38{col 49}{space 3}0.031{col 57}{space 4} .2498693{col 70}{space 3}  4.57305
{txt}{space 6}_Ihour_11 {c |}{col 17}{res}{space 2} 1.971742{col 29}{space 2} 1.219958{col 40}{space 1}    1.62{col 49}{space 3}0.127{col 57}{space 4}-.6285364{col 70}{space 3} 4.572021
{txt}{space 6}_Ihour_12 {c |}{col 17}{res}{space 2}-.0886578{col 29}{space 2} 1.366816{col 40}{space 1}   -0.06{col 49}{space 3}0.949{col 57}{space 4}-3.001956{col 70}{space 3} 2.824641
{txt}{space 6}_Ihour_13 {c |}{col 17}{res}{space 2} 1.129046{col 29}{space 2} 1.239974{col 40}{space 1}    0.91{col 49}{space 3}0.377{col 57}{space 4}-1.513896{col 70}{space 3} 3.771989
{txt}{space 6}_Ihour_14 {c |}{col 17}{res}{space 2} .6051446{col 29}{space 2} 1.229078{col 40}{space 1}    0.49{col 49}{space 3}0.630{col 57}{space 4}-2.014574{col 70}{space 3} 3.224863
{txt}{space 6}_Ihour_15 {c |}{col 17}{res}{space 2}-.5469161{col 29}{space 2} 1.203128{col 40}{space 1}   -0.45{col 49}{space 3}0.656{col 57}{space 4}-3.111323{col 70}{space 3} 2.017491
{txt}{space 6}_Ihour_16 {c |}{col 17}{res}{space 2}-1.228501{col 29}{space 2} 1.233336{col 40}{space 1}   -1.00{col 49}{space 3}0.335{col 57}{space 4}-3.857293{col 70}{space 3} 1.400292
{txt}{space 6}_Ihour_17 {c |}{col 17}{res}{space 2}-1.397871{col 29}{space 2} 1.210078{col 40}{space 1}   -1.16{col 49}{space 3}0.266{col 57}{space 4}-3.977092{col 70}{space 3}  1.18135
{txt}{space 6}_Ihour_18 {c |}{col 17}{res}{space 2} .0012001{col 29}{space 2} 1.177258{col 40}{space 1}    0.00{col 49}{space 3}0.999{col 57}{space 4}-2.508065{col 70}{space 3} 2.510465
{txt}{space 6}_Ihour_19 {c |}{col 17}{res}{space 2} .5040533{col 29}{space 2}  1.07361{col 40}{space 1}    0.47{col 49}{space 3}0.645{col 57}{space 4}-1.784293{col 70}{space 3}   2.7924
{txt}{space 6}_Ihour_20 {c |}{col 17}{res}{space 2} 1.497663{col 29}{space 2} 1.019033{col 40}{space 1}    1.47{col 49}{space 3}0.162{col 57}{space 4}-.6743548{col 70}{space 3} 3.669682
{txt}{space 6}_Ihour_21 {c |}{col 17}{res}{space 2} 2.922417{col 29}{space 2} .5780992{col 40}{space 1}    5.06{col 49}{space 3}0.000{col 57}{space 4} 1.690227{col 70}{space 3} 4.154606
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 18.18245{col 29}{space 2} 4.582822{col 40}{space 1}    3.97{col 49}{space 3}0.001{col 57}{space 4} 8.414393{col 70}{space 3}  27.9505
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. *outreg2 using 2nd_step_firststage.doc, append ctitle(IV 1 Lag first stage) 
. 
. ******Robustness Checks 
. ***Fewer instruments
. ***(1) IV PF
. ivregress 2sls pbid_max (mg_price_id_max=load_ACT wind_share gasprice) $fe, vce(cluster yq)
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}    12,916
{txt}{col 1}{col 51}Wald chi2({res}29{txt}){col 67}= {res}   1000.51
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.7621
{txt}{col 51}Root MSE{col 67}=    {res} 6.1381

{txt}{ralign 81:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}       pbid_max{col 17}{c |} Coefficient{col 29}  std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mg_price_id_max {c |}{col 17}{res}{space 2}  .693062{col 29}{space 2} .0360115{col 40}{space 1}   19.25{col 49}{space 3}0.000{col 57}{space 4} .6224808{col 70}{space 3} .7636431
{txt}{space 9}_Iyq_2 {c |}{col 17}{res}{space 2}-4.765686{col 29}{space 2} .3431776{col 40}{space 1}  -13.89{col 49}{space 3}0.000{col 57}{space 4}-5.438302{col 70}{space 3} -4.09307
{txt}{space 9}_Iyq_3 {c |}{col 17}{res}{space 2}-6.729052{col 29}{space 2} .3142239{col 40}{space 1}  -21.41{col 49}{space 3}0.000{col 57}{space 4}-7.344919{col 70}{space 3}-6.113184
{txt}{space 9}_Iyq_4 {c |}{col 17}{res}{space 2}-2.387081{col 29}{space 2} .1403717{col 40}{space 1}  -17.01{col 49}{space 3}0.000{col 57}{space 4}-2.662205{col 70}{space 3}-2.111958
{txt}{space 9}_Iyq_5 {c |}{col 17}{res}{space 2}-4.166441{col 29}{space 2} .2197107{col 40}{space 1}  -18.96{col 49}{space 3}0.000{col 57}{space 4}-4.597066{col 70}{space 3}-3.735816
{txt}{space 9}_Iyq_6 {c |}{col 17}{res}{space 2}-4.145129{col 29}{space 2} .1952078{col 40}{space 1}  -21.23{col 49}{space 3}0.000{col 57}{space 4}-4.527729{col 70}{space 3}-3.762528
{txt}{space 9}_Iyq_7 {c |}{col 17}{res}{space 2}-1.810057{col 29}{space 2} .3222364{col 40}{space 1}   -5.62{col 49}{space 3}0.000{col 57}{space 4}-2.441629{col 70}{space 3}-1.178486
{txt}{space 9}_Iyq_8 {c |}{col 17}{res}{space 2}-.4933571{col 29}{space 2} .2563538{col 40}{space 1}   -1.92{col 49}{space 3}0.054{col 57}{space 4}-.9958013{col 70}{space 3} .0090871
{txt}{space 9}_Iyq_9 {c |}{col 17}{res}{space 2}-1.757363{col 29}{space 2} .0707319{col 40}{space 1}  -24.85{col 49}{space 3}0.000{col 57}{space 4}-1.895995{col 70}{space 3}-1.618731
{txt}{space 8}_Iyq_10 {c |}{col 17}{res}{space 2}-4.867824{col 29}{space 2} .3236031{col 40}{space 1}  -15.04{col 49}{space 3}0.000{col 57}{space 4}-5.502075{col 70}{space 3}-4.233574
{txt}{space 8}_Iyq_11 {c |}{col 17}{res}{space 2}-3.421783{col 29}{space 2} .3119442{col 40}{space 1}  -10.97{col 49}{space 3}0.000{col 57}{space 4}-4.033182{col 70}{space 3}-2.810384
{txt}{space 8}_Iyq_12 {c |}{col 17}{res}{space 2}-5.894543{col 29}{space 2} .4702076{col 40}{space 1}  -12.54{col 49}{space 3}0.000{col 57}{space 4}-6.816133{col 70}{space 3}-4.972953
{txt}{space 8}_Iyq_13 {c |}{col 17}{res}{space 2}-5.940629{col 29}{space 2} .7779736{col 40}{space 1}   -7.64{col 49}{space 3}0.000{col 57}{space 4}-7.465429{col 70}{space 3}-4.415829
{txt}{space 8}_Iyq_14 {c |}{col 17}{res}{space 2}-9.578765{col 29}{space 2} 1.197557{col 40}{space 1}   -8.00{col 49}{space 3}0.000{col 57}{space 4}-11.92593{col 70}{space 3}-7.231597
{txt}{space 8}_Iyq_15 {c |}{col 17}{res}{space 2}-6.149447{col 29}{space 2} .7609182{col 40}{space 1}   -8.08{col 49}{space 3}0.000{col 57}{space 4}-7.640819{col 70}{space 3}-4.658075
{txt}{space 8}_Iyq_16 {c |}{col 17}{res}{space 2} 4.230805{col 29}{space 2} .5590057{col 40}{space 1}    7.57{col 49}{space 3}0.000{col 57}{space 4} 3.135174{col 70}{space 3} 5.326436
{txt}{space 7}_Ihour_9 {c |}{col 17}{res}{space 2} -.086067{col 29}{space 2} .4444624{col 40}{space 1}   -0.19{col 49}{space 3}0.846{col 57}{space 4}-.9571974{col 70}{space 3} .7850633
{txt}{space 6}_Ihour_10 {c |}{col 17}{res}{space 2} .6288296{col 29}{space 2} .4797903{col 40}{space 1}    1.31{col 49}{space 3}0.190{col 57}{space 4}-.3115421{col 70}{space 3} 1.569201
{txt}{space 6}_Ihour_11 {c |}{col 17}{res}{space 2} 1.761592{col 29}{space 2} .4950543{col 40}{space 1}    3.56{col 49}{space 3}0.000{col 57}{space 4} .7913035{col 70}{space 3} 2.731881
{txt}{space 6}_Ihour_12 {c |}{col 17}{res}{space 2} 4.880275{col 29}{space 2} .9039165{col 40}{space 1}    5.40{col 49}{space 3}0.000{col 57}{space 4} 3.108631{col 70}{space 3} 6.651919
{txt}{space 6}_Ihour_13 {c |}{col 17}{res}{space 2} 2.541282{col 29}{space 2} .5690351{col 40}{space 1}    4.47{col 49}{space 3}0.000{col 57}{space 4} 1.425994{col 70}{space 3}  3.65657
{txt}{space 6}_Ihour_14 {c |}{col 17}{res}{space 2} 2.710184{col 29}{space 2} .5878136{col 40}{space 1}    4.61{col 49}{space 3}0.000{col 57}{space 4}  1.55809{col 70}{space 3} 3.862277
{txt}{space 6}_Ihour_15 {c |}{col 17}{res}{space 2} 3.012435{col 29}{space 2} .5500849{col 40}{space 1}    5.48{col 49}{space 3}0.000{col 57}{space 4} 1.934288{col 70}{space 3} 4.090581
{txt}{space 6}_Ihour_16 {c |}{col 17}{res}{space 2} 3.088949{col 29}{space 2} .5280009{col 40}{space 1}    5.85{col 49}{space 3}0.000{col 57}{space 4} 2.054086{col 70}{space 3} 4.123812
{txt}{space 6}_Ihour_17 {c |}{col 17}{res}{space 2} 2.915181{col 29}{space 2} .5028015{col 40}{space 1}    5.80{col 49}{space 3}0.000{col 57}{space 4} 1.929708{col 70}{space 3} 3.900654
{txt}{space 6}_Ihour_18 {c |}{col 17}{res}{space 2} 2.104731{col 29}{space 2} .4858037{col 40}{space 1}    4.33{col 49}{space 3}0.000{col 57}{space 4} 1.152573{col 70}{space 3} 3.056889
{txt}{space 6}_Ihour_19 {c |}{col 17}{res}{space 2} 1.675801{col 29}{space 2} .4002374{col 40}{space 1}    4.19{col 49}{space 3}0.000{col 57}{space 4} .8913502{col 70}{space 3} 2.460252
{txt}{space 6}_Ihour_20 {c |}{col 17}{res}{space 2} 1.130325{col 29}{space 2} .4590714{col 40}{space 1}    2.46{col 49}{space 3}0.014{col 57}{space 4} .2305613{col 70}{space 3} 2.030088
{txt}{space 6}_Ihour_21 {c |}{col 17}{res}{space 2} .7132674{col 29}{space 2} .4740739{col 40}{space 1}    1.50{col 49}{space 3}0.132{col 57}{space 4}-.2159003{col 70}{space 3} 1.642435
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 18.55095{col 29}{space 2} 2.092972{col 40}{space 1}    8.86{col 49}{space 3}0.000{col 57}{space 4}  14.4488{col 70}{space 3}  22.6531
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 93}Instrumented: {res:mg_price_id_max}{p_end}
{p 0 14 93}{space 1}Instruments: {res:_Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 _Ihour_9 _Ihour_10 _Ihour_11 _Ihour_12 _Ihour_13 _Ihour_14 _Ihour_15 _Ihour_16 _Ihour_17 _Ihour_18 _Ihour_19 _Ihour_20 _Ihour_21 load_ACT wind_share gasprice}{p_end}

{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_robust.doc, replace ctitle(IV PF small) addstat("Chi²", e(chi2))
. 
. ***(2) IV Lags
. ivregress 2sls pbid_max (mg_price_id_max=lag_load_ACT lag_wind_share lag_gasprice) $fe, vce(cluster yq)
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}    12,912
{txt}{col 1}{col 51}Wald chi2({res}29{txt}){col 67}= {res}    773.70
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.7471
{txt}{col 51}Root MSE{col 67}=    {res} 6.3256

{txt}{ralign 81:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}       pbid_max{col 17}{c |} Coefficient{col 29}  std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mg_price_id_max {c |}{col 17}{res}{space 2} .7940626{col 29}{space 2} .0355136{col 40}{space 1}   22.36{col 49}{space 3}0.000{col 57}{space 4} .7244571{col 70}{space 3}  .863668
{txt}{space 9}_Iyq_2 {c |}{col 17}{res}{space 2}-3.796652{col 29}{space 2} .3231366{col 40}{space 1}  -11.75{col 49}{space 3}0.000{col 57}{space 4}-4.429988{col 70}{space 3}-3.163316
{txt}{space 9}_Iyq_3 {c |}{col 17}{res}{space 2}-5.843864{col 29}{space 2} .3001605{col 40}{space 1}  -19.47{col 49}{space 3}0.000{col 57}{space 4}-6.432167{col 70}{space 3} -5.25556
{txt}{space 9}_Iyq_4 {c |}{col 17}{res}{space 2} -2.74471{col 29}{space 2} .1323845{col 40}{space 1}  -20.73{col 49}{space 3}0.000{col 57}{space 4}-3.004179{col 70}{space 3}-2.485241
{txt}{space 9}_Iyq_5 {c |}{col 17}{res}{space 2}-3.521133{col 29}{space 2} .2168417{col 40}{space 1}  -16.24{col 49}{space 3}0.000{col 57}{space 4}-3.946135{col 70}{space 3}-3.096131
{txt}{space 9}_Iyq_6 {c |}{col 17}{res}{space 2}-3.606403{col 29}{space 2} .1781122{col 40}{space 1}  -20.25{col 49}{space 3}0.000{col 57}{space 4}-3.955497{col 70}{space 3} -3.25731
{txt}{space 9}_Iyq_7 {c |}{col 17}{res}{space 2}-2.698623{col 29}{space 2} .3310276{col 40}{space 1}   -8.15{col 49}{space 3}0.000{col 57}{space 4}-3.347426{col 70}{space 3}-2.049821
{txt}{space 9}_Iyq_8 {c |}{col 17}{res}{space 2}-1.172929{col 29}{space 2} .2457193{col 40}{space 1}   -4.77{col 49}{space 3}0.000{col 57}{space 4} -1.65453{col 70}{space 3} -.691328
{txt}{space 9}_Iyq_9 {c |}{col 17}{res}{space 2}-1.531266{col 29}{space 2} .0701617{col 40}{space 1}  -21.82{col 49}{space 3}0.000{col 57}{space 4}-1.668781{col 70}{space 3}-1.393752
{txt}{space 8}_Iyq_10 {c |}{col 17}{res}{space 2}-3.958542{col 29}{space 2} .3055594{col 40}{space 1}  -12.96{col 49}{space 3}0.000{col 57}{space 4}-4.557427{col 70}{space 3}-3.359657
{txt}{space 8}_Iyq_11 {c |}{col 17}{res}{space 2}-2.546178{col 29}{space 2} .2952002{col 40}{space 1}   -8.63{col 49}{space 3}0.000{col 57}{space 4} -3.12476{col 70}{space 3}-1.967596
{txt}{space 8}_Iyq_12 {c |}{col 17}{res}{space 2}-4.544699{col 29}{space 2} .4692048{col 40}{space 1}   -9.69{col 49}{space 3}0.000{col 57}{space 4}-5.464324{col 70}{space 3}-3.625075
{txt}{space 8}_Iyq_13 {c |}{col 17}{res}{space 2}-3.731157{col 29}{space 2} .7683976{col 40}{space 1}   -4.86{col 49}{space 3}0.000{col 57}{space 4}-5.237189{col 70}{space 3}-2.225125
{txt}{space 8}_Iyq_14 {c |}{col 17}{res}{space 2}-6.212457{col 29}{space 2} 1.165837{col 40}{space 1}   -5.33{col 49}{space 3}0.000{col 57}{space 4}-8.497455{col 70}{space 3}-3.927459
{txt}{space 8}_Iyq_15 {c |}{col 17}{res}{space 2}-4.013627{col 29}{space 2} .7333308{col 40}{space 1}   -5.47{col 49}{space 3}0.000{col 57}{space 4}-5.450929{col 70}{space 3}-2.576325
{txt}{space 8}_Iyq_16 {c |}{col 17}{res}{space 2} 5.836423{col 29}{space 2} .5597441{col 40}{space 1}   10.43{col 49}{space 3}0.000{col 57}{space 4} 4.739345{col 70}{space 3} 6.933501
{txt}{space 7}_Ihour_9 {c |}{col 17}{res}{space 2}-.3693891{col 29}{space 2}   .43781{col 40}{space 1}   -0.84{col 49}{space 3}0.399{col 57}{space 4}-1.227481{col 70}{space 3} .4887027
{txt}{space 6}_Ihour_10 {c |}{col 17}{res}{space 2} .2030252{col 29}{space 2}  .487794{col 40}{space 1}    0.42{col 49}{space 3}0.677{col 57}{space 4}-.7530334{col 70}{space 3} 1.159084
{txt}{space 6}_Ihour_11 {c |}{col 17}{res}{space 2} 1.348374{col 29}{space 2} .5022794{col 40}{space 1}    2.68{col 49}{space 3}0.007{col 57}{space 4} .3639249{col 70}{space 3} 2.332824
{txt}{space 6}_Ihour_12 {c |}{col 17}{res}{space 2} 4.703645{col 29}{space 2} .9466194{col 40}{space 1}    4.97{col 49}{space 3}0.000{col 57}{space 4} 2.848305{col 70}{space 3} 6.558985
{txt}{space 6}_Ihour_13 {c |}{col 17}{res}{space 2} 2.191603{col 29}{space 2} .5810786{col 40}{space 1}    3.77{col 49}{space 3}0.000{col 57}{space 4}  1.05271{col 70}{space 3} 3.330496
{txt}{space 6}_Ihour_14 {c |}{col 17}{res}{space 2} 2.400011{col 29}{space 2} .6053146{col 40}{space 1}    3.96{col 49}{space 3}0.000{col 57}{space 4} 1.213617{col 70}{space 3} 3.586406
{txt}{space 6}_Ihour_15 {c |}{col 17}{res}{space 2}  2.84452{col 29}{space 2} .5578364{col 40}{space 1}    5.10{col 49}{space 3}0.000{col 57}{space 4} 1.751181{col 70}{space 3} 3.937859
{txt}{space 6}_Ihour_16 {c |}{col 17}{res}{space 2} 3.032788{col 29}{space 2} .5315925{col 40}{space 1}    5.71{col 49}{space 3}0.000{col 57}{space 4} 1.990886{col 70}{space 3}  4.07469
{txt}{space 6}_Ihour_17 {c |}{col 17}{res}{space 2} 2.902103{col 29}{space 2} .5002813{col 40}{space 1}    5.80{col 49}{space 3}0.000{col 57}{space 4} 1.921569{col 70}{space 3} 3.882636
{txt}{space 6}_Ihour_18 {c |}{col 17}{res}{space 2} 1.975111{col 29}{space 2}  .491518{col 40}{space 1}    4.02{col 49}{space 3}0.000{col 57}{space 4} 1.011753{col 70}{space 3} 2.938468
{txt}{space 6}_Ihour_19 {c |}{col 17}{res}{space 2}  1.58291{col 29}{space 2} .3950904{col 40}{space 1}    4.01{col 49}{space 3}0.000{col 57}{space 4} .8085469{col 70}{space 3} 2.357273
{txt}{space 6}_Ihour_20 {c |}{col 17}{res}{space 2} .8807318{col 29}{space 2} .4593816{col 40}{space 1}    1.92{col 49}{space 3}0.055{col 57}{space 4}-.0196396{col 70}{space 3} 1.781103
{txt}{space 6}_Ihour_21 {c |}{col 17}{res}{space 2} .3436188{col 29}{space 2}   .45332{col 40}{space 1}    0.76{col 49}{space 3}0.448{col 57}{space 4}-.5448721{col 70}{space 3}  1.23211
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 12.77159{col 29}{space 2} 1.911825{col 40}{space 1}    6.68{col 49}{space 3}0.000{col 57}{space 4} 9.024484{col 70}{space 3}  16.5187
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 93}Instrumented: {res:mg_price_id_max}{p_end}
{p 0 14 93}{space 1}Instruments: {res:_Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 _Ihour_9 _Ihour_10 _Ihour_11 _Ihour_12 _Ihour_13 _Ihour_14 _Ihour_15 _Ihour_16 _Ihour_17 _Ihour_18 _Ihour_19 _Ihour_20 _Ihour_21 lag_load_ACT lag_wind_share lag_gasprice}{p_end}

{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_robust.doc, append ctitle(IV 1 Lag large) addstat("Chi²", e(chi2))
. 
. ***To do
. **More instruments
. ***(3) IV PF
. ivregress 2sls pbid_max (mg_price_id_max=load_ACT solar_share wind_share hydro_share co2price gasprice load_fc_error solar_fc_error wind_fc_error) $fe, vce(cluster yq)
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}    12,915
{txt}{col 1}{col 51}Wald chi2({res}29{txt}){col 67}= {res}    996.34
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.7611
{txt}{col 51}Root MSE{col 67}=    {res} 6.1504

{txt}{ralign 81:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}       pbid_max{col 17}{c |} Coefficient{col 29}  std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mg_price_id_max {c |}{col 17}{res}{space 2} .7024599{col 29}{space 2} .0357796{col 40}{space 1}   19.63{col 49}{space 3}0.000{col 57}{space 4} .6323331{col 70}{space 3} .7725867
{txt}{space 9}_Iyq_2 {c |}{col 17}{res}{space 2}-4.678658{col 29}{space 2} .3374518{col 40}{space 1}  -13.86{col 49}{space 3}0.000{col 57}{space 4}-5.340051{col 70}{space 3}-4.017265
{txt}{space 9}_Iyq_3 {c |}{col 17}{res}{space 2}-6.649056{col 29}{space 2} .3096675{col 40}{space 1}  -21.47{col 49}{space 3}0.000{col 57}{space 4}-7.255993{col 70}{space 3}-6.042119
{txt}{space 9}_Iyq_4 {c |}{col 17}{res}{space 2}-2.426636{col 29}{space 2} .1384086{col 40}{space 1}  -17.53{col 49}{space 3}0.000{col 57}{space 4}-2.697912{col 70}{space 3} -2.15536
{txt}{space 9}_Iyq_5 {c |}{col 17}{res}{space 2}-4.108791{col 29}{space 2} .2183438{col 40}{space 1}  -18.82{col 49}{space 3}0.000{col 57}{space 4}-4.536737{col 70}{space 3}-3.680845
{txt}{space 9}_Iyq_6 {c |}{col 17}{res}{space 2}-4.097389{col 29}{space 2}  .190583{col 40}{space 1}  -21.50{col 49}{space 3}0.000{col 57}{space 4}-4.470925{col 70}{space 3}-3.723853
{txt}{space 9}_Iyq_7 {c |}{col 17}{res}{space 2} -1.89512{col 29}{space 2} .3233764{col 40}{space 1}   -5.86{col 49}{space 3}0.000{col 57}{space 4}-2.528926{col 70}{space 3}-1.261314
{txt}{space 9}_Iyq_8 {c |}{col 17}{res}{space 2}-.5588829{col 29}{space 2} .2534953{col 40}{space 1}   -2.20{col 49}{space 3}0.027{col 57}{space 4}-1.055725{col 70}{space 3}-.0620413
{txt}{space 9}_Iyq_9 {c |}{col 17}{res}{space 2} -1.73872{col 29}{space 2} .0703468{col 40}{space 1}  -24.72{col 49}{space 3}0.000{col 57}{space 4}-1.876597{col 70}{space 3}-1.600843
{txt}{space 8}_Iyq_10 {c |}{col 17}{res}{space 2}-4.785606{col 29}{space 2} .3181809{col 40}{space 1}  -15.04{col 49}{space 3}0.000{col 57}{space 4}-5.409229{col 70}{space 3}-4.161983
{txt}{space 8}_Iyq_11 {c |}{col 17}{res}{space 2}-3.342698{col 29}{space 2} .3069576{col 40}{space 1}  -10.89{col 49}{space 3}0.000{col 57}{space 4}-3.944323{col 70}{space 3}-2.741072
{txt}{space 8}_Iyq_12 {c |}{col 17}{res}{space 2}-5.771242{col 29}{space 2} .4682038{col 40}{space 1}  -12.33{col 49}{space 3}0.000{col 57}{space 4}-6.688904{col 70}{space 3}-4.853579
{txt}{space 8}_Iyq_13 {c |}{col 17}{res}{space 2}-5.737421{col 29}{space 2} .7732834{col 40}{space 1}   -7.42{col 49}{space 3}0.000{col 57}{space 4}-7.253029{col 70}{space 3}-4.221813
{txt}{space 8}_Iyq_14 {c |}{col 17}{res}{space 2}-9.267933{col 29}{space 2} 1.186154{col 40}{space 1}   -7.81{col 49}{space 3}0.000{col 57}{space 4}-11.59275{col 70}{space 3}-6.943113
{txt}{space 8}_Iyq_15 {c |}{col 17}{res}{space 2}-5.953089{col 29}{space 2} .7520756{col 40}{space 1}   -7.92{col 49}{space 3}0.000{col 57}{space 4} -7.42713{col 70}{space 3}-4.479048
{txt}{space 8}_Iyq_16 {c |}{col 17}{res}{space 2} 4.377952{col 29}{space 2} .5571651{col 40}{space 1}    7.86{col 49}{space 3}0.000{col 57}{space 4} 3.285928{col 70}{space 3} 5.469975
{txt}{space 7}_Ihour_9 {c |}{col 17}{res}{space 2}-.1137594{col 29}{space 2} .4457812{col 40}{space 1}   -0.26{col 49}{space 3}0.799{col 57}{space 4}-.9874745{col 70}{space 3} .7599558
{txt}{space 6}_Ihour_10 {c |}{col 17}{res}{space 2} .5878894{col 29}{space 2} .4840698{col 40}{space 1}    1.21{col 49}{space 3}0.225{col 57}{space 4}  -.36087{col 70}{space 3} 1.536649
{txt}{space 6}_Ihour_11 {c |}{col 17}{res}{space 2} 1.721823{col 29}{space 2} .4994894{col 40}{space 1}    3.45{col 49}{space 3}0.001{col 57}{space 4} .7428416{col 70}{space 3} 2.700804
{txt}{space 6}_Ihour_12 {c |}{col 17}{res}{space 2} 4.862393{col 29}{space 2} .9061981{col 40}{space 1}    5.37{col 49}{space 3}0.000{col 57}{space 4} 3.086277{col 70}{space 3} 6.638509
{txt}{space 6}_Ihour_13 {c |}{col 17}{res}{space 2} 2.504605{col 29}{space 2} .5719879{col 40}{space 1}    4.38{col 49}{space 3}0.000{col 57}{space 4}  1.38353{col 70}{space 3} 3.625681
{txt}{space 6}_Ihour_14 {c |}{col 17}{res}{space 2} 2.680002{col 29}{space 2} .5898455{col 40}{space 1}    4.54{col 49}{space 3}0.000{col 57}{space 4} 1.523926{col 70}{space 3} 3.836078
{txt}{space 6}_Ihour_15 {c |}{col 17}{res}{space 2}  2.99549{col 29}{space 2}  .551378{col 40}{space 1}    5.43{col 49}{space 3}0.000{col 57}{space 4} 1.914809{col 70}{space 3} 4.076171
{txt}{space 6}_Ihour_16 {c |}{col 17}{res}{space 2} 3.082403{col 29}{space 2} .5278298{col 40}{space 1}    5.84{col 49}{space 3}0.000{col 57}{space 4} 2.047876{col 70}{space 3}  4.11693
{txt}{space 6}_Ihour_17 {c |}{col 17}{res}{space 2} 2.912643{col 29}{space 2}   .50121{col 40}{space 1}    5.81{col 49}{space 3}0.000{col 57}{space 4} 1.930289{col 70}{space 3} 3.894996
{txt}{space 6}_Ihour_18 {c |}{col 17}{res}{space 2} 2.091316{col 29}{space 2} .4847062{col 40}{space 1}    4.31{col 49}{space 3}0.000{col 57}{space 4}  1.14131{col 70}{space 3} 3.041323
{txt}{space 6}_Ihour_19 {c |}{col 17}{res}{space 2} 1.667621{col 29}{space 2} .3987392{col 40}{space 1}    4.18{col 49}{space 3}0.000{col 57}{space 4} .8861067{col 70}{space 3} 2.449135
{txt}{space 6}_Ihour_20 {c |}{col 17}{res}{space 2} 1.105395{col 29}{space 2} .4585861{col 40}{space 1}    2.41{col 49}{space 3}0.016{col 57}{space 4} .2065826{col 70}{space 3} 2.004207
{txt}{space 6}_Ihour_21 {c |}{col 17}{res}{space 2} .6755303{col 29}{space 2} .4710404{col 40}{space 1}    1.43{col 49}{space 3}0.152{col 57}{space 4} -.247692{col 70}{space 3} 1.598753
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 18.01705{col 29}{space 2} 2.052598{col 40}{space 1}    8.78{col 49}{space 3}0.000{col 57}{space 4} 13.99404{col 70}{space 3} 22.04007
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 93}Instrumented: {res:mg_price_id_max}{p_end}
{p 0 14 93}{space 1}Instruments: {res:_Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 _Ihour_9 _Ihour_10 _Ihour_11 _Ihour_12 _Ihour_13 _Ihour_14 _Ihour_15 _Ihour_16 _Ihour_17 _Ihour_18 _Ihour_19 _Ihour_20 _Ihour_21 load_ACT solar_share wind_share hydro_share co2price gasprice load_fc_error solar_fc_error wind_fc_error}{p_end}

{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_robust.doc, append ctitle(IV PF) addstat("Chi²", e(chi2))
. 
. ***(4) IV Lags
. ivregress 2sls pbid_max (mg_price_id_max=lag_load_ACT lag_solar_share lag_wind_share lag_hydro_share lag_co2price lag_gasprice lag_load_fc_error lag_solar_fc_error lag_wind_fc_error) $fe, vce(cluster yq)
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}    12,911
{txt}{col 1}{col 51}Wald chi2({res}29{txt}){col 67}= {res}    741.73
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.7420
{txt}{col 51}Root MSE{col 67}=    {res} 6.3894

{txt}{ralign 81:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}       pbid_max{col 17}{c |} Coefficient{col 29}  std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mg_price_id_max {c |}{col 17}{res}{space 2} .8181184{col 29}{space 2} .0340116{col 40}{space 1}   24.05{col 49}{space 3}0.000{col 57}{space 4} .7514568{col 70}{space 3}   .88478
{txt}{space 9}_Iyq_2 {c |}{col 17}{res}{space 2}-3.574229{col 29}{space 2} .3012894{col 40}{space 1}  -11.86{col 49}{space 3}0.000{col 57}{space 4}-4.164745{col 70}{space 3}-2.983713
{txt}{space 9}_Iyq_3 {c |}{col 17}{res}{space 2}-5.639337{col 29}{space 2} .2808423{col 40}{space 1}  -20.08{col 49}{space 3}0.000{col 57}{space 4}-6.189778{col 70}{space 3}-5.088896
{txt}{space 9}_Iyq_4 {c |}{col 17}{res}{space 2}-2.827773{col 29}{space 2} .1236261{col 40}{space 1}  -22.87{col 49}{space 3}0.000{col 57}{space 4}-3.070075{col 70}{space 3} -2.58547
{txt}{space 9}_Iyq_5 {c |}{col 17}{res}{space 2} -3.37391{col 29}{space 2}  .207511{col 40}{space 1}  -16.26{col 49}{space 3}0.000{col 57}{space 4}-3.780624{col 70}{space 3}-2.967196
{txt}{space 9}_Iyq_6 {c |}{col 17}{res}{space 2}-3.484443{col 29}{space 2} .1626973{col 40}{space 1}  -21.42{col 49}{space 3}0.000{col 57}{space 4}-3.803324{col 70}{space 3}-3.165563
{txt}{space 9}_Iyq_7 {c |}{col 17}{res}{space 2}-2.916598{col 29}{space 2} .3247173{col 40}{space 1}   -8.98{col 49}{space 3}0.000{col 57}{space 4}-3.553033{col 70}{space 3}-2.280164
{txt}{space 9}_Iyq_8 {c |}{col 17}{res}{space 2} -1.34101{col 29}{space 2} .2331186{col 40}{space 1}   -5.75{col 49}{space 3}0.000{col 57}{space 4}-1.797914{col 70}{space 3}-.8841055
{txt}{space 9}_Iyq_9 {c |}{col 17}{res}{space 2}-1.483891{col 29}{space 2} .0669815{col 40}{space 1}  -22.15{col 49}{space 3}0.000{col 57}{space 4}-1.615173{col 70}{space 3} -1.35261
{txt}{space 8}_Iyq_10 {c |}{col 17}{res}{space 2}-3.748326{col 29}{space 2}  .284421{col 40}{space 1}  -13.18{col 49}{space 3}0.000{col 57}{space 4}-4.305781{col 70}{space 3}-3.190871
{txt}{space 8}_Iyq_11 {c |}{col 17}{res}{space 2}-2.343981{col 29}{space 2} .2754048{col 40}{space 1}   -8.51{col 49}{space 3}0.000{col 57}{space 4}-2.883765{col 70}{space 3}-1.804198
{txt}{space 8}_Iyq_12 {c |}{col 17}{res}{space 2} -4.22942{col 29}{space 2} .4511684{col 40}{space 1}   -9.37{col 49}{space 3}0.000{col 57}{space 4}-5.113693{col 70}{space 3}-3.345146
{txt}{space 8}_Iyq_13 {c |}{col 17}{res}{space 2}-3.211374{col 29}{space 2} .7363758{col 40}{space 1}   -4.36{col 49}{space 3}0.000{col 57}{space 4}-4.654644{col 70}{space 3}-1.768104
{txt}{space 8}_Iyq_14 {c |}{col 17}{res}{space 2}-5.417047{col 29}{space 2} 1.107687{col 40}{space 1}   -4.89{col 49}{space 3}0.000{col 57}{space 4}-7.588073{col 70}{space 3}-3.246022
{txt}{space 8}_Iyq_15 {c |}{col 17}{res}{space 2}-3.511248{col 29}{space 2} .6934813{col 40}{space 1}   -5.06{col 49}{space 3}0.000{col 57}{space 4}-4.870447{col 70}{space 3} -2.15205
{txt}{space 8}_Iyq_16 {c |}{col 17}{res}{space 2} 6.212718{col 29}{space 2} .5401851{col 40}{space 1}   11.50{col 49}{space 3}0.000{col 57}{space 4} 5.153975{col 70}{space 3} 7.271462
{txt}{space 7}_Ihour_9 {c |}{col 17}{res}{space 2}-.4418211{col 29}{space 2} .4383775{col 40}{space 1}   -1.01{col 49}{space 3}0.314{col 57}{space 4}-1.301025{col 70}{space 3} .4173829
{txt}{space 6}_Ihour_10 {c |}{col 17}{res}{space 2} .0966408{col 29}{space 2} .4952302{col 40}{space 1}    0.20{col 49}{space 3}0.845{col 57}{space 4}-.8739925{col 70}{space 3} 1.067274
{txt}{space 6}_Ihour_11 {c |}{col 17}{res}{space 2} 1.244989{col 29}{space 2} .5090383{col 40}{space 1}    2.45{col 49}{space 3}0.014{col 57}{space 4} .2472926{col 70}{space 3} 2.242686
{txt}{space 6}_Ihour_12 {c |}{col 17}{res}{space 2} 4.657484{col 29}{space 2} .9555427{col 40}{space 1}    4.87{col 49}{space 3}0.000{col 57}{space 4} 2.784655{col 70}{space 3} 6.530313
{txt}{space 6}_Ihour_13 {c |}{col 17}{res}{space 2} 2.109272{col 29}{space 2} .5860281{col 40}{space 1}    3.60{col 49}{space 3}0.000{col 57}{space 4} .9606782{col 70}{space 3} 3.257866
{txt}{space 6}_Ihour_14 {c |}{col 17}{res}{space 2} 2.321167{col 29}{space 2} .6094497{col 40}{space 1}    3.81{col 49}{space 3}0.000{col 57}{space 4} 1.126668{col 70}{space 3} 3.515667
{txt}{space 6}_Ihour_15 {c |}{col 17}{res}{space 2} 2.799561{col 29}{space 2} .5606749{col 40}{space 1}    4.99{col 49}{space 3}0.000{col 57}{space 4} 1.700658{col 70}{space 3} 3.898464
{txt}{space 6}_Ihour_16 {c |}{col 17}{res}{space 2} 3.014446{col 29}{space 2} .5342163{col 40}{space 1}    5.64{col 49}{space 3}0.000{col 57}{space 4} 1.967401{col 70}{space 3} 4.061491
{txt}{space 6}_Ihour_17 {c |}{col 17}{res}{space 2} 2.894019{col 29}{space 2} .5018356{col 40}{space 1}    5.77{col 49}{space 3}0.000{col 57}{space 4} 1.910439{col 70}{space 3} 3.877599
{txt}{space 6}_Ihour_18 {c |}{col 17}{res}{space 2}  1.93933{col 29}{space 2}  .493301{col 40}{space 1}    3.93{col 49}{space 3}0.000{col 57}{space 4}  .972478{col 70}{space 3} 2.906182
{txt}{space 6}_Ihour_19 {c |}{col 17}{res}{space 2} 1.561562{col 29}{space 2} .3960027{col 40}{space 1}    3.94{col 49}{space 3}0.000{col 57}{space 4} .7854109{col 70}{space 3} 2.337713
{txt}{space 6}_Ihour_20 {c |}{col 17}{res}{space 2} .8158325{col 29}{space 2} .4584306{col 40}{space 1}    1.78{col 49}{space 3}0.075{col 57}{space 4}-.0826749{col 70}{space 3}  1.71434
{txt}{space 6}_Ihour_21 {c |}{col 17}{res}{space 2} .2465487{col 29}{space 2} .4417109{col 40}{space 1}    0.56{col 49}{space 3}0.577{col 57}{space 4}-.6191887{col 70}{space 3} 1.112286
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 11.40545{col 29}{space 2} 1.779797{col 40}{space 1}    6.41{col 49}{space 3}0.000{col 57}{space 4} 7.917113{col 70}{space 3} 14.89379
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 93}Instrumented: {res:mg_price_id_max}{p_end}
{p 0 14 93}{space 1}Instruments: {res:_Iyq_2 _Iyq_3 _Iyq_4 _Iyq_5 _Iyq_6 _Iyq_7 _Iyq_8 _Iyq_9 _Iyq_10 _Iyq_11 _Iyq_12 _Iyq_13 _Iyq_14 _Iyq_15 _Iyq_16 _Ihour_9 _Ihour_10 _Ihour_11 _Ihour_12 _Ihour_13 _Ihour_14 _Ihour_15 _Ihour_16 _Ihour_17 _Ihour_18 _Ihour_19 _Ihour_20 _Ihour_21 lag_load_ACT lag_solar_share lag_wind_share lag_hydro_share lag_co2price lag_gasprice lag_load_fc_error lag_solar_fc_error lag_wind_fc_error}{p_end}

{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_robust.doc, append ctitle(IV 1 Lag) addstat("Chi²", e(chi2))
. 
. ***OLS with controls, different fixed effects and first difference
. ***(1) OLS PF
. reg pbid_max mg_price_id_max  $fe5, vce(cluster yq)

{txt}Linear regression                               Number of obs     = {res}    12,916
                                                {txt}{help j_robustsingular:F(14, 15) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.7313
                                                {txt}Root MSE          =    {res} 6.5268

{txt}{ralign 81:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}       pbid_max{col 17}{c |} Coefficient{col 29}  std. err.{col 41}      t{col 49}   P>|t|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mg_price_id_max {c |}{col 17}{res}{space 2} .7150537{col 29}{space 2} .0207827{col 40}{space 1}   34.41{col 49}{space 3}0.000{col 57}{space 4} .6707565{col 70}{space 3}  .759351
{txt}{space 4}_Iyear_2018 {c |}{col 17}{res}{space 2} .8947379{col 29}{space 2} 1.387225{col 40}{space 1}    0.64{col 49}{space 3}0.529{col 57}{space 4}-2.062063{col 70}{space 3} 3.851539
{txt}{space 4}_Iyear_2019 {c |}{col 17}{res}{space 2}-.2243197{col 29}{space 2} 1.403802{col 40}{space 1}   -0.16{col 49}{space 3}0.875{col 57}{space 4}-3.216453{col 70}{space 3} 2.767814
{txt}{space 4}_Iyear_2020 {c |}{col 17}{res}{space 2}-2.555989{col 29}{space 2} 1.784432{col 40}{space 1}   -1.43{col 49}{space 3}0.173{col 57}{space 4}-6.359416{col 70}{space 3} 1.247438
{txt}{space 7}_Ihour_9 {c |}{col 17}{res}{space 2} .5373641{col 29}{space 2} .5620816{col 40}{space 1}    0.96{col 49}{space 3}0.354{col 57}{space 4}-.6606845{col 70}{space 3} 1.735413
{txt}{space 6}_Ihour_10 {c |}{col 17}{res}{space 2} 1.237458{col 29}{space 2} .5724308{col 40}{space 1}    2.16{col 49}{space 3}0.047{col 57}{space 4} .0173506{col 70}{space 3} 2.457565
{txt}{space 6}_Ihour_11 {c |}{col 17}{res}{space 2} 2.376241{col 29}{space 2} .5901539{col 40}{space 1}    4.03{col 49}{space 3}0.001{col 57}{space 4} 1.118358{col 70}{space 3} 3.634125
{txt}{space 6}_Ihour_12 {c |}{col 17}{res}{space 2} 4.921874{col 29}{space 2} 1.149287{col 40}{space 1}    4.28{col 49}{space 3}0.001{col 57}{space 4} 2.472226{col 70}{space 3} 7.371521
{txt}{space 6}_Ihour_13 {c |}{col 17}{res}{space 2} 3.172668{col 29}{space 2} .6862096{col 40}{space 1}    4.62{col 49}{space 3}0.000{col 57}{space 4} 1.710047{col 70}{space 3} 4.635289
{txt}{space 6}_Ihour_14 {c |}{col 17}{res}{space 2} 3.348685{col 29}{space 2} .7104888{col 40}{space 1}    4.71{col 49}{space 3}0.000{col 57}{space 4} 1.834314{col 70}{space 3} 4.863056
{txt}{space 6}_Ihour_15 {c |}{col 17}{res}{space 2} 3.680961{col 29}{space 2} .6776753{col 40}{space 1}    5.43{col 49}{space 3}0.000{col 57}{space 4} 2.236531{col 70}{space 3} 5.125392
{txt}{space 6}_Ihour_16 {c |}{col 17}{res}{space 2} 3.781809{col 29}{space 2} .6612814{col 40}{space 1}    5.72{col 49}{space 3}0.000{col 57}{space 4} 2.372321{col 70}{space 3} 5.191296
{txt}{space 6}_Ihour_17 {c |}{col 17}{res}{space 2} 3.618371{col 29}{space 2} .6131873{col 40}{space 1}    5.90{col 49}{space 3}0.000{col 57}{space 4} 2.311393{col 70}{space 3} 4.925349
{txt}{space 6}_Ihour_18 {c |}{col 17}{res}{space 2}   2.7689{col 29}{space 2} .5414015{col 40}{space 1}    5.11{col 49}{space 3}0.000{col 57}{space 4}  1.61493{col 70}{space 3} 3.922869
{txt}{space 6}_Ihour_19 {c |}{col 17}{res}{space 2} 1.929719{col 29}{space 2}  .401914{col 40}{space 1}    4.80{col 49}{space 3}0.000{col 57}{space 4}  1.07306{col 70}{space 3} 2.786379
{txt}{space 6}_Ihour_20 {c |}{col 17}{res}{space 2} .7960427{col 29}{space 2} .4263706{col 40}{space 1}    1.87{col 49}{space 3}0.082{col 57}{space 4}-.1127448{col 70}{space 3}  1.70483
{txt}{space 6}_Ihour_21 {c |}{col 17}{res}{space 2} .2198446{col 29}{space 2}  .391758{col 40}{space 1}    0.56{col 49}{space 3}0.583{col 57}{space 4}-.6151678{col 70}{space 3} 1.054857
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 13.14118{col 29}{space 2} 1.568801{col 40}{space 1}    8.38{col 49}{space 3}0.000{col 57}{space 4} 9.797358{col 70}{space 3}   16.485
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_robust2.doc, replace ctitle(OLS PF a) 
. 
. reg pbid_max mg_price_id_max  $fe6, vce(cluster yq)

{txt}Linear regression                               Number of obs     = {res}    12,916
                                                {txt}{help j_robustsingular:F(14, 15) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.7471
                                                {txt}Root MSE          =    {res} 6.3352

{txt}{ralign 81:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}       pbid_max{col 17}{c |} Coefficient{col 29}  std. err.{col 41}      t{col 49}   P>|t|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mg_price_id_max {c |}{col 17}{res}{space 2} .6668349{col 29}{space 2} .0240532{col 40}{space 1}   27.72{col 49}{space 3}0.000{col 57}{space 4} .6155666{col 70}{space 3} .7181031
{txt}{space 4}_Iyear_2018 {c |}{col 17}{res}{space 2} 1.122861{col 29}{space 2} 1.244522{col 40}{space 1}    0.90{col 49}{space 3}0.381{col 57}{space 4}-1.529775{col 70}{space 3} 3.775497
{txt}{space 4}_Iyear_2019 {c |}{col 17}{res}{space 2}-.4385994{col 29}{space 2} 1.278657{col 40}{space 1}   -0.34{col 49}{space 3}0.736{col 57}{space 4}-3.163993{col 70}{space 3} 2.286794
{txt}{space 4}_Iyear_2020 {c |}{col 17}{res}{space 2}-3.545742{col 29}{space 2} 1.664265{col 40}{space 1}   -2.13{col 49}{space 3}0.050{col 57}{space 4} -7.09304{col 70}{space 3} .0015561
{txt}{space 6}_Imonth_2 {c |}{col 17}{res}{space 2}  2.55001{col 29}{space 2} 1.304356{col 40}{space 1}    1.95{col 49}{space 3}0.069{col 57}{space 4} -.230158{col 70}{space 3} 5.330178
{txt}{space 6}_Imonth_3 {c |}{col 17}{res}{space 2}-1.324705{col 29}{space 2} 1.392458{col 40}{space 1}   -0.95{col 49}{space 3}0.357{col 57}{space 4}-4.292658{col 70}{space 3} 1.643249
{txt}{space 6}_Imonth_4 {c |}{col 17}{res}{space 2}-3.450607{col 29}{space 2} 1.583866{col 40}{space 1}   -2.18{col 49}{space 3}0.046{col 57}{space 4}-6.826538{col 70}{space 3}-.0746759
{txt}{space 6}_Imonth_5 {c |}{col 17}{res}{space 2}-3.561407{col 29}{space 2}  1.40154{col 40}{space 1}   -2.54{col 49}{space 3}0.023{col 57}{space 4}-6.548718{col 70}{space 3}-.5740956
{txt}{space 6}_Imonth_6 {c |}{col 17}{res}{space 2}-1.067448{col 29}{space 2} 1.379176{col 40}{space 1}   -0.77{col 49}{space 3}0.451{col 57}{space 4}-4.007093{col 70}{space 3} 1.872196
{txt}{space 6}_Imonth_7 {c |}{col 17}{res}{space 2}-1.227085{col 29}{space 2} 1.468549{col 40}{space 1}   -0.84{col 49}{space 3}0.417{col 57}{space 4}-4.357222{col 70}{space 3} 1.903053
{txt}{space 6}_Imonth_8 {c |}{col 17}{res}{space 2}-1.666892{col 29}{space 2} 2.008382{col 40}{space 1}   -0.83{col 49}{space 3}0.420{col 57}{space 4}-5.947658{col 70}{space 3} 2.613873
{txt}{space 6}_Imonth_9 {c |}{col 17}{res}{space 2}-1.585925{col 29}{space 2} 2.272821{col 40}{space 1}   -0.70{col 49}{space 3}0.496{col 57}{space 4}-6.430329{col 70}{space 3} 3.258479
{txt}{space 5}_Imonth_10 {c |}{col 17}{res}{space 2} .0556067{col 29}{space 2} 2.085234{col 40}{space 1}    0.03{col 49}{space 3}0.979{col 57}{space 4}-4.388963{col 70}{space 3} 4.500177
{txt}{space 5}_Imonth_11 {c |}{col 17}{res}{space 2}-.3609044{col 29}{space 2} 2.032603{col 40}{space 1}   -0.18{col 49}{space 3}0.861{col 57}{space 4}-4.693295{col 70}{space 3} 3.971486
{txt}{space 5}_Imonth_12 {c |}{col 17}{res}{space 2} 1.418668{col 29}{space 2} 2.050567{col 40}{space 1}    0.69{col 49}{space 3}0.500{col 57}{space 4}-2.952011{col 70}{space 3} 5.789347
{txt}{space 7}_Ihour_9 {c |}{col 17}{res}{space 2}-.2545816{col 29}{space 2} .3098927{col 40}{space 1}   -0.82{col 49}{space 3}0.424{col 57}{space 4}-.9151023{col 70}{space 3} .4059391
{txt}{space 6}_Ihour_10 {c |}{col 17}{res}{space 2}  .486457{col 29}{space 2} .3398518{col 40}{space 1}    1.43{col 49}{space 3}0.173{col 57}{space 4}-.2379198{col 70}{space 3} 1.210834
{txt}{space 6}_Ihour_11 {c |}{col 17}{res}{space 2}  1.61847{col 29}{space 2} .3649388{col 40}{space 1}    4.43{col 49}{space 3}0.000{col 57}{space 4} .8406215{col 70}{space 3} 2.396319
{txt}{space 6}_Ihour_12 {c |}{col 17}{res}{space 2} 4.321052{col 29}{space 2} .9309993{col 40}{space 1}    4.64{col 49}{space 3}0.000{col 57}{space 4} 2.336674{col 70}{space 3}  6.30543
{txt}{space 6}_Ihour_13 {c |}{col 17}{res}{space 2} 2.379799{col 29}{space 2} .4462081{col 40}{space 1}    5.33{col 49}{space 3}0.000{col 57}{space 4} 1.428729{col 70}{space 3} 3.330869
{txt}{space 6}_Ihour_14 {c |}{col 17}{res}{space 2} 2.538959{col 29}{space 2} .4546211{col 40}{space 1}    5.58{col 49}{space 3}0.000{col 57}{space 4} 1.569957{col 70}{space 3} 3.507961
{txt}{space 6}_Ihour_15 {c |}{col 17}{res}{space 2} 2.803248{col 29}{space 2} .4613485{col 40}{space 1}    6.08{col 49}{space 3}0.000{col 57}{space 4} 1.819907{col 70}{space 3} 3.786589
{txt}{space 6}_Ihour_16 {c |}{col 17}{res}{space 2} 2.850743{col 29}{space 2} .4712874{col 40}{space 1}    6.05{col 49}{space 3}0.000{col 57}{space 4} 1.846217{col 70}{space 3} 3.855268
{txt}{space 6}_Ihour_17 {c |}{col 17}{res}{space 2} 2.666809{col 29}{space 2} .4422897{col 40}{space 1}    6.03{col 49}{space 3}0.000{col 57}{space 4} 1.724091{col 70}{space 3} 3.609527
{txt}{space 6}_Ihour_18 {c |}{col 17}{res}{space 2} 1.911108{col 29}{space 2} .4300067{col 40}{space 1}    4.44{col 49}{space 3}0.000{col 57}{space 4} .9945707{col 70}{space 3} 2.827646
{txt}{space 6}_Ihour_19 {c |}{col 17}{res}{space 2} 1.427608{col 29}{space 2} .3772494{col 40}{space 1}    3.78{col 49}{space 3}0.002{col 57}{space 4} .6235199{col 70}{space 3} 2.231696
{txt}{space 6}_Ihour_20 {c |}{col 17}{res}{space 2}  .931643{col 29}{space 2} .3667262{col 40}{space 1}    2.54{col 49}{space 3}0.023{col 57}{space 4} .1499846{col 70}{space 3} 1.713301
{txt}{space 6}_Ihour_21 {c |}{col 17}{res}{space 2} .4619304{col 29}{space 2} .3691183{col 40}{space 1}    1.25{col 49}{space 3}0.230{col 57}{space 4}-.3248266{col 70}{space 3} 1.248687
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 17.54769{col 29}{space 2} 2.440604{col 40}{space 1}    7.19{col 49}{space 3}0.000{col 57}{space 4} 12.34566{col 70}{space 3} 22.74971
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_robust2.doc, append ctitle(OLS PF b) 
. 
. reg pbid_max mg_price_id_max solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe, vce(cluster yq)

{txt}Linear regression                               Number of obs     = {res}    12,915
                                                {txt}{help j_robustsingular:F(14, 15) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.7982
                                                {txt}Root MSE          =    {res} 5.6617

{txt}{ralign 81:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}       pbid_max{col 17}{c |} Coefficient{col 29}  std. err.{col 41}      t{col 49}   P>|t|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mg_price_id_max {c |}{col 17}{res}{space 2} .2925489{col 29}{space 2} .0337671{col 40}{space 1}    8.66{col 49}{space 3}0.000{col 57}{space 4} .2205761{col 70}{space 3} .3645217
{txt}{space 4}solar_share {c |}{col 17}{res}{space 2} .0324075{col 29}{space 2} .0397757{col 40}{space 1}    0.81{col 49}{space 3}0.428{col 57}{space 4}-.0523723{col 70}{space 3} .1171873
{txt}{space 5}wind_share {c |}{col 17}{res}{space 2}-.0976417{col 29}{space 2} .0330775{col 40}{space 1}   -2.95{col 49}{space 3}0.010{col 57}{space 4}-.1681448{col 70}{space 3}-.0271386
{txt}{space 4}hydro_share {c |}{col 17}{res}{space 2}-.2832829{col 29}{space 2} .0515346{col 40}{space 1}   -5.50{col 49}{space 3}0.000{col 57}{space 4}-.3931262{col 70}{space 3}-.1734396
{txt}{space 6}gas_share {c |}{col 17}{res}{space 2}-.0030141{col 29}{space 2} .0417914{col 40}{space 1}   -0.07{col 49}{space 3}0.943{col 57}{space 4}-.0920904{col 70}{space 3} .0860621
{txt}{space 5}coal_share {c |}{col 17}{res}{space 2} .3159338{col 29}{space 2} .0757556{col 40}{space 1}    4.17{col 49}{space 3}0.001{col 57}{space 4} .1544645{col 70}{space 3}  .477403
{txt}{space 7}load_ACT {c |}{col 17}{res}{space 2} .3885528{col 29}{space 2}  .067849{col 40}{space 1}    5.73{col 49}{space 3}0.000{col 57}{space 4} .2439361{col 70}{space 3} .5331695
{txt}{space 1}solar_fc_error {c |}{col 17}{res}{space 2} .0067252{col 29}{space 2} .5796123{col 40}{space 1}    0.01{col 49}{space 3}0.991{col 57}{space 4}-1.228689{col 70}{space 3}  1.24214
{txt}{space 2}wind_fc_error {c |}{col 17}{res}{space 2}-1.303561{col 29}{space 2} 1.141756{col 40}{space 1}   -1.14{col 49}{space 3}0.271{col 57}{space 4}-3.737156{col 70}{space 3} 1.130034
{txt}{space 2}load_fc_error {c |}{col 17}{res}{space 2} 32.12978{col 29}{space 2} 13.38007{col 40}{space 1}    2.40{col 49}{space 3}0.030{col 57}{space 4} 3.610827{col 70}{space 3} 60.64874
{txt}{space 7}co2price {c |}{col 17}{res}{space 2}   .20446{col 29}{space 2} .1356226{col 40}{space 1}    1.51{col 49}{space 3}0.152{col 57}{space 4}-.0846128{col 70}{space 3} .4935329
{txt}{space 7}gasprice {c |}{col 17}{res}{space 2} .5079842{col 29}{space 2} .0965272{col 40}{space 1}    5.26{col 49}{space 3}0.000{col 57}{space 4} .3022414{col 70}{space 3} .7137269
{txt}{space 9}_Iyq_2 {c |}{col 17}{res}{space 2}-6.095025{col 29}{space 2} .7218128{col 40}{space 1}   -8.44{col 49}{space 3}0.000{col 57}{space 4}-7.633533{col 70}{space 3}-4.556517
{txt}{space 9}_Iyq_3 {c |}{col 17}{res}{space 2}-9.486844{col 29}{space 2} .8547002{col 40}{space 1}  -11.10{col 49}{space 3}0.000{col 57}{space 4}-11.30859{col 70}{space 3}-7.665093
{txt}{space 9}_Iyq_4 {c |}{col 17}{res}{space 2} -4.28697{col 29}{space 2} .7298904{col 40}{space 1}   -5.87{col 49}{space 3}0.000{col 57}{space 4}-5.842694{col 70}{space 3}-2.731245
{txt}{space 9}_Iyq_5 {c |}{col 17}{res}{space 2}-5.017139{col 29}{space 2}  .644508{col 40}{space 1}   -7.78{col 49}{space 3}0.000{col 57}{space 4}-6.390875{col 70}{space 3}-3.643402
{txt}{space 9}_Iyq_6 {c |}{col 17}{res}{space 2}-3.140819{col 29}{space 2} 1.361102{col 40}{space 1}   -2.31{col 49}{space 3}0.036{col 57}{space 4}-6.041939{col 70}{space 3}-.2396991
{txt}{space 9}_Iyq_7 {c |}{col 17}{res}{space 2}-4.215291{col 29}{space 2} 1.976587{col 40}{space 1}   -2.13{col 49}{space 3}0.050{col 57}{space 4}-8.428287{col 70}{space 3}-.0022949
{txt}{space 9}_Iyq_8 {c |}{col 17}{res}{space 2}-2.154796{col 29}{space 2} 2.140882{col 40}{space 1}   -1.01{col 49}{space 3}0.330{col 57}{space 4}-6.717978{col 70}{space 3} 2.408385
{txt}{space 9}_Iyq_9 {c |}{col 17}{res}{space 2}-3.306114{col 29}{space 2} 2.282139{col 40}{space 1}   -1.45{col 49}{space 3}0.168{col 57}{space 4}-8.170379{col 70}{space 3} 1.558151
{txt}{space 8}_Iyq_10 {c |}{col 17}{res}{space 2}-4.144678{col 29}{space 2} 3.020392{col 40}{space 1}   -1.37{col 49}{space 3}0.190{col 57}{space 4}-10.58249{col 70}{space 3} 2.293134
{txt}{space 8}_Iyq_11 {c |}{col 17}{res}{space 2}-4.525893{col 29}{space 2} 3.393379{col 40}{space 1}   -1.33{col 49}{space 3}0.202{col 57}{space 4}-11.75871{col 70}{space 3} 2.706922
{txt}{space 8}_Iyq_12 {c |}{col 17}{res}{space 2}-4.797346{col 29}{space 2} 2.916771{col 40}{space 1}   -1.64{col 49}{space 3}0.121{col 57}{space 4} -11.0143{col 70}{space 3} 1.419604
{txt}{space 8}_Iyq_13 {c |}{col 17}{res}{space 2}-6.545353{col 29}{space 2} 2.769048{col 40}{space 1}   -2.36{col 49}{space 3}0.032{col 57}{space 4}-12.44744{col 70}{space 3}-.6432664
{txt}{space 8}_Iyq_14 {c |}{col 17}{res}{space 2}-10.52491{col 29}{space 2} 2.919987{col 40}{space 1}   -3.60{col 49}{space 3}0.003{col 57}{space 4}-16.74871{col 70}{space 3}-4.301101
{txt}{space 8}_Iyq_15 {c |}{col 17}{res}{space 2}-8.106227{col 29}{space 2} 3.566458{col 40}{space 1}   -2.27{col 49}{space 3}0.038{col 57}{space 4}-15.70795{col 70}{space 3} -.504501
{txt}{space 8}_Iyq_16 {c |}{col 17}{res}{space 2} 3.346997{col 29}{space 2} 3.145785{col 40}{space 1}    1.06{col 49}{space 3}0.304{col 57}{space 4}-3.358086{col 70}{space 3} 10.05208
{txt}{space 7}_Ihour_9 {c |}{col 17}{res}{space 2}-.2274625{col 29}{space 2} .4081223{col 40}{space 1}   -0.56{col 49}{space 3}0.586{col 57}{space 4}-1.097355{col 70}{space 3} .6424297
{txt}{space 6}_Ihour_10 {c |}{col 17}{res}{space 2} .3473939{col 29}{space 2} .5009988{col 40}{space 1}    0.69{col 49}{space 3}0.499{col 57}{space 4}-.7204598{col 70}{space 3} 1.415248
{txt}{space 6}_Ihour_11 {c |}{col 17}{res}{space 2} .7707988{col 29}{space 2}  .611377{col 40}{space 1}    1.26{col 49}{space 3}0.227{col 57}{space 4}-.5323204{col 70}{space 3} 2.073918
{txt}{space 6}_Ihour_12 {c |}{col 17}{res}{space 2} 3.119713{col 29}{space 2} 1.075106{col 40}{space 1}    2.90{col 49}{space 3}0.011{col 57}{space 4} .8281788{col 70}{space 3} 5.411247
{txt}{space 6}_Ihour_13 {c |}{col 17}{res}{space 2} .6435668{col 29}{space 2} .7237335{col 40}{space 1}    0.89{col 49}{space 3}0.388{col 57}{space 4}-.8990346{col 70}{space 3} 2.186168
{txt}{space 6}_Ihour_14 {c |}{col 17}{res}{space 2} .5023738{col 29}{space 2} .7490478{col 40}{space 1}    0.67{col 49}{space 3}0.513{col 57}{space 4}-1.094184{col 70}{space 3} 2.098931
{txt}{space 6}_Ihour_15 {c |}{col 17}{res}{space 2} .3638068{col 29}{space 2} .6995241{col 40}{space 1}    0.52{col 49}{space 3}0.611{col 57}{space 4}-1.127194{col 70}{space 3} 1.854807
{txt}{space 6}_Ihour_16 {c |}{col 17}{res}{space 2} .2998883{col 29}{space 2} .6678695{col 40}{space 1}    0.45{col 49}{space 3}0.660{col 57}{space 4}-1.123642{col 70}{space 3} 1.723418
{txt}{space 6}_Ihour_17 {c |}{col 17}{res}{space 2} .2282976{col 29}{space 2} .6396048{col 40}{space 1}    0.36{col 49}{space 3}0.726{col 57}{space 4}-1.134988{col 70}{space 3} 1.591583
{txt}{space 6}_Ihour_18 {c |}{col 17}{res}{space 2} .2410993{col 29}{space 2} .6128004{col 40}{space 1}    0.39{col 49}{space 3}0.700{col 57}{space 4}-1.065054{col 70}{space 3} 1.547252
{txt}{space 6}_Ihour_19 {c |}{col 17}{res}{space 2} .3801779{col 29}{space 2} .5483845{col 40}{space 1}    0.69{col 49}{space 3}0.499{col 57}{space 4} -.788676{col 70}{space 3} 1.549032
{txt}{space 6}_Ihour_20 {c |}{col 17}{res}{space 2} .3679911{col 29}{space 2} .4526546{col 40}{space 1}    0.81{col 49}{space 3}0.429{col 57}{space 4}-.5968194{col 70}{space 3} 1.332802
{txt}{space 6}_Ihour_21 {c |}{col 17}{res}{space 2} .7206699{col 29}{space 2} .4089377{col 40}{space 1}    1.76{col 49}{space 3}0.098{col 57}{space 4}-.1509601{col 70}{space 3}   1.5923
{txt}{space 10}_cons {c |}{col 17}{res}{space 2} 18.93019{col 29}{space 2} 3.531846{col 40}{space 1}    5.36{col 49}{space 3}0.000{col 57}{space 4} 11.40224{col 70}{space 3} 26.45814
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_robust2.doc, append ctitle(OLS PF c) 
. 
. reg dpbid_max dmg_price_id_max $fe, vce(cluster yq)

{txt}Linear regression                               Number of obs     = {res}    12,916
                                                {txt}{help j_robustsingular:F(13, 15) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.7718
                                                {txt}Root MSE          =    {res} 7.8653

{txt}{ralign 82:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 18}{c |}{col 30}    Robust
{col 1}       dpbid_max{col 18}{c |} Coefficient{col 30}  std. err.{col 42}      t{col 50}   P>|t|{col 58}     [95% con{col 71}f. interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dmg_price_id_max {c |}{col 18}{res}{space 2}   .24617{col 30}{space 2} .0363511{col 41}{space 1}    6.77{col 50}{space 3}0.000{col 58}{space 4} .1686895{col 71}{space 3} .3236506
{txt}{space 10}_Iyq_2 {c |}{col 18}{res}{space 2}-1.318139{col 30}{space 2} .0682464{col 41}{space 1}  -19.31{col 50}{space 3}0.000{col 58}{space 4}-1.463603{col 71}{space 3}-1.172675
{txt}{space 10}_Iyq_3 {c |}{col 18}{res}{space 2}-1.763768{col 30}{space 2} .0530436{col 41}{space 1}  -33.25{col 50}{space 3}0.000{col 58}{space 4}-1.876827{col 71}{space 3}-1.650708
{txt}{space 10}_Iyq_4 {c |}{col 18}{res}{space 2} .0408503{col 30}{space 2} .0221659{col 41}{space 1}    1.84{col 50}{space 3}0.085{col 58}{space 4}-.0063952{col 71}{space 3} .0880958
{txt}{space 10}_Iyq_5 {c |}{col 18}{res}{space 2}-1.271832{col 30}{space 2} .0038148{col 41}{space 1} -333.39{col 50}{space 3}0.000{col 58}{space 4}-1.279964{col 71}{space 3}-1.263701
{txt}{space 10}_Iyq_6 {c |}{col 18}{res}{space 2}-1.263525{col 30}{space 2} .0681606{col 41}{space 1}  -18.54{col 50}{space 3}0.000{col 58}{space 4}-1.408806{col 71}{space 3}-1.118245
{txt}{space 10}_Iyq_7 {c |}{col 18}{res}{space 2} -.436456{col 30}{space 2} .0609074{col 41}{space 1}   -7.17{col 50}{space 3}0.000{col 58}{space 4} -.566277{col 71}{space 3} -.306635
{txt}{space 10}_Iyq_8 {c |}{col 18}{res}{space 2} -.104652{col 30}{space 2} .0233401{col 41}{space 1}   -4.48{col 50}{space 3}0.000{col 58}{space 4}-.1544002{col 71}{space 3}-.0549038
{txt}{space 10}_Iyq_9 {c |}{col 18}{res}{space 2}-.5344532{col 30}{space 2} .0034941{col 41}{space 1} -152.96{col 50}{space 3}0.000{col 58}{space 4}-.5419006{col 71}{space 3}-.5270057
{txt}{space 9}_Iyq_10 {c |}{col 18}{res}{space 2}-1.514208{col 30}{space 2} .0654941{col 41}{space 1}  -23.12{col 50}{space 3}0.000{col 58}{space 4}-1.653806{col 71}{space 3}-1.374611
{txt}{space 9}_Iyq_11 {c |}{col 18}{res}{space 2}-1.041345{col 30}{space 2} .0599399{col 41}{space 1}  -17.37{col 50}{space 3}0.000{col 58}{space 4}-1.169104{col 71}{space 3}-.9135861
{txt}{space 9}_Iyq_12 {c |}{col 18}{res}{space 2}-1.575472{col 30}{space 2} .0206655{col 41}{space 1}  -76.24{col 50}{space 3}0.000{col 58}{space 4}-1.619519{col 71}{space 3}-1.531425
{txt}{space 9}_Iyq_13 {c |}{col 18}{res}{space 2}-1.663604{col 30}{space 2} .0141446{col 41}{space 1} -117.61{col 50}{space 3}0.000{col 58}{space 4}-1.693752{col 71}{space 3}-1.633455
{txt}{space 9}_Iyq_14 {c |}{col 18}{res}{space 2}-3.055287{col 30}{space 2} .0706917{col 41}{space 1}  -43.22{col 50}{space 3}0.000{col 58}{space 4}-3.205962{col 71}{space 3}-2.904611
{txt}{space 9}_Iyq_15 {c |}{col 18}{res}{space 2}-1.514992{col 30}{space 2} .0743438{col 41}{space 1}  -20.38{col 50}{space 3}0.000{col 58}{space 4}-1.673453{col 71}{space 3}-1.356532
{txt}{space 9}_Iyq_16 {c |}{col 18}{res}{space 2} 2.819536{col 30}{space 2} .0312321{col 41}{space 1}   90.28{col 50}{space 3}0.000{col 58}{space 4} 2.752967{col 71}{space 3} 2.886106
{txt}{space 8}_Ihour_9 {c |}{col 18}{res}{space 2}  .924643{col 30}{space 2} .7101634{col 41}{space 1}    1.30{col 50}{space 3}0.213{col 58}{space 4}-.5890344{col 71}{space 3} 2.438321
{txt}{space 7}_Ihour_10 {c |}{col 18}{res}{space 2} .1979748{col 30}{space 2} .6148497{col 41}{space 1}    0.32{col 50}{space 3}0.752{col 58}{space 4}-1.112546{col 71}{space 3} 1.508496
{txt}{space 7}_Ihour_11 {c |}{col 18}{res}{space 2}-.5302082{col 30}{space 2} .5350202{col 41}{space 1}   -0.99{col 50}{space 3}0.337{col 58}{space 4}-1.670577{col 71}{space 3} .6101604
{txt}{space 7}_Ihour_12 {c |}{col 18}{res}{space 2}-.4287528{col 30}{space 2} .5589537{col 41}{space 1}   -0.77{col 50}{space 3}0.455{col 58}{space 4}-1.620134{col 71}{space 3} .7626289
{txt}{space 7}_Ihour_13 {c |}{col 18}{res}{space 2}  48.9523{col 30}{space 2} 2.665493{col 41}{space 1}   18.37{col 50}{space 3}0.000{col 58}{space 4} 43.27094{col 71}{space 3} 54.63367
{txt}{space 7}_Ihour_14 {c |}{col 18}{res}{space 2}-1.658024{col 30}{space 2}  .532314{col 41}{space 1}   -3.11{col 50}{space 3}0.007{col 58}{space 4}-2.792625{col 71}{space 3} -.523424
{txt}{space 7}_Ihour_15 {c |}{col 18}{res}{space 2}-1.944572{col 30}{space 2} .5169713{col 41}{space 1}   -3.76{col 50}{space 3}0.002{col 58}{space 4} -3.04647{col 71}{space 3}-.8426738
{txt}{space 7}_Ihour_16 {c |}{col 18}{res}{space 2}-2.081061{col 30}{space 2} .5510839{col 41}{space 1}   -3.78{col 50}{space 3}0.002{col 58}{space 4}-3.255668{col 71}{space 3}-.9064532
{txt}{space 7}_Ihour_17 {c |}{col 18}{res}{space 2}-2.023938{col 30}{space 2} .5470879{col 41}{space 1}   -3.70{col 50}{space 3}0.002{col 58}{space 4}-3.190028{col 71}{space 3}-.8578476
{txt}{space 7}_Ihour_18 {c |}{col 18}{res}{space 2}-1.895443{col 30}{space 2} .5491957{col 41}{space 1}   -3.45{col 50}{space 3}0.004{col 58}{space 4}-3.066026{col 71}{space 3}-.7248598
{txt}{space 7}_Ihour_19 {c |}{col 18}{res}{space 2} -1.69459{col 30}{space 2} .5180792{col 41}{space 1}   -3.27{col 50}{space 3}0.005{col 58}{space 4}-2.798849{col 71}{space 3}-.5903299
{txt}{space 7}_Ihour_20 {c |}{col 18}{res}{space 2}-1.532206{col 30}{space 2} .5150587{col 41}{space 1}   -2.97{col 50}{space 3}0.009{col 58}{space 4}-2.630028{col 71}{space 3}-.4343846
{txt}{space 7}_Ihour_21 {c |}{col 18}{res}{space 2}-1.408875{col 30}{space 2} .5546811{col 41}{space 1}   -2.54{col 50}{space 3}0.023{col 58}{space 4} -2.59115{col 71}{space 3}-.2266006
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} 2.668098{col 30}{space 2} .6080698{col 41}{space 1}    4.39{col 50}{space 3}0.001{col 58}{space 4} 1.372028{col 71}{space 3} 3.964169
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. *outreg2 using 2ndstep_robust2.doc, append ctitle(OLS PF d) 
. 
. ***OLS Lag with controls and different fixed effects
. reg pbid_max mg_price_id_max_lag*  $fe5, vce(cluster yq)

{txt}Linear regression                               Number of obs     = {res}    12,860
                                                {txt}{help j_robustsingular:F(14, 15) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.6996
                                                {txt}Root MSE          =    {res} 6.8921

{txt}{ralign 86:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34}    Robust
{col 1}            pbid_max{col 22}{c |} Coefficient{col 34}  std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}mg_price_id_max_lag {c |}{col 22}{res}{space 2} .3898248{col 34}{space 2} .0289821{col 45}{space 1}   13.45{col 54}{space 3}0.000{col 62}{space 4} .3280509{col 75}{space 3} .4515987
{txt}mg_price_id_max_lag2 {c |}{col 22}{res}{space 2} .0376828{col 34}{space 2} .0316466{col 45}{space 1}    1.19{col 54}{space 3}0.252{col 62}{space 4}-.0297702{col 75}{space 3} .1051359
{txt}mg_price_id_max_lag3 {c |}{col 22}{res}{space 2} .1222682{col 34}{space 2} .0171494{col 45}{space 1}    7.13{col 54}{space 3}0.000{col 62}{space 4} .0857151{col 75}{space 3} .1588212
{txt}mg_price_id_max_lag4 {c |}{col 22}{res}{space 2} .0927229{col 34}{space 2} .0205027{col 45}{space 1}    4.52{col 54}{space 3}0.000{col 62}{space 4} .0490225{col 75}{space 3} .1364233
{txt}mg_price_id_max_lag5 {c |}{col 22}{res}{space 2} .1506005{col 34}{space 2} .0260761{col 45}{space 1}    5.78{col 54}{space 3}0.000{col 62}{space 4} .0950205{col 75}{space 3} .2061804
{txt}{space 9}_Iyear_2018 {c |}{col 22}{res}{space 2} .7444916{col 34}{space 2}    .9355{col 45}{space 1}    0.80{col 54}{space 3}0.439{col 62}{space 4} -1.24948{col 75}{space 3} 2.738463
{txt}{space 9}_Iyear_2019 {c |}{col 22}{res}{space 2} .1264405{col 34}{space 2} 1.045128{col 45}{space 1}    0.12{col 54}{space 3}0.905{col 62}{space 4}-2.101196{col 75}{space 3} 2.354077
{txt}{space 9}_Iyear_2020 {c |}{col 22}{res}{space 2}-.4388011{col 34}{space 2} 1.463552{col 45}{space 1}   -0.30{col 54}{space 3}0.768{col 62}{space 4}-3.558289{col 75}{space 3} 2.680686
{txt}{space 12}_Ihour_9 {c |}{col 22}{res}{space 2} .1441665{col 34}{space 2}  .532785{col 45}{space 1}    0.27{col 54}{space 3}0.790{col 62}{space 4}-.9914379{col 75}{space 3} 1.279771
{txt}{space 11}_Ihour_10 {c |}{col 22}{res}{space 2} .7055662{col 34}{space 2} .5467399{col 45}{space 1}    1.29{col 54}{space 3}0.216{col 62}{space 4}-.4597823{col 75}{space 3} 1.870915
{txt}{space 11}_Ihour_11 {c |}{col 22}{res}{space 2} 1.832941{col 34}{space 2}  .565023{col 45}{space 1}    3.24{col 54}{space 3}0.005{col 62}{space 4} .6286227{col 75}{space 3} 3.037259
{txt}{space 11}_Ihour_12 {c |}{col 22}{res}{space 2}  3.79192{col 34}{space 2} .8863358{col 45}{space 1}    4.28{col 54}{space 3}0.001{col 62}{space 4}  1.90274{col 75}{space 3}   5.6811
{txt}{space 11}_Ihour_13 {c |}{col 22}{res}{space 2} 2.635509{col 34}{space 2} .6626048{col 45}{space 1}    3.98{col 54}{space 3}0.001{col 62}{space 4} 1.223201{col 75}{space 3} 4.047818
{txt}{space 11}_Ihour_14 {c |}{col 22}{res}{space 2} 2.846105{col 34}{space 2}  .694365{col 45}{space 1}    4.10{col 54}{space 3}0.001{col 62}{space 4} 1.366101{col 75}{space 3}  4.32611
{txt}{space 11}_Ihour_15 {c |}{col 22}{res}{space 2} 3.274502{col 34}{space 2} .6776226{col 45}{space 1}    4.83{col 54}{space 3}0.000{col 62}{space 4} 1.830184{col 75}{space 3}  4.71882
{txt}{space 11}_Ihour_16 {c |}{col 22}{res}{space 2} 3.475948{col 34}{space 2} .6839081{col 45}{space 1}    5.08{col 54}{space 3}0.000{col 62}{space 4} 2.018233{col 75}{space 3} 4.933664
{txt}{space 11}_Ihour_17 {c |}{col 22}{res}{space 2}  3.37784{col 34}{space 2} .6466699{col 45}{space 1}    5.22{col 54}{space 3}0.000{col 62}{space 4} 1.999495{col 75}{space 3} 4.756184
{txt}{space 11}_Ihour_18 {c |}{col 22}{res}{space 2}  2.43784{col 34}{space 2} .5606027{col 45}{space 1}    4.35{col 54}{space 3}0.001{col 62}{space 4} 1.242944{col 75}{space 3} 3.632737
{txt}{space 11}_Ihour_19 {c |}{col 22}{res}{space 2} 1.644415{col 34}{space 2} .4083588{col 45}{space 1}    4.03{col 54}{space 3}0.001{col 62}{space 4} .7740185{col 75}{space 3} 2.514811
{txt}{space 11}_Ihour_20 {c |}{col 22}{res}{space 2} .5912345{col 34}{space 2} .4717776{col 45}{space 1}    1.25{col 54}{space 3}0.229{col 62}{space 4}-.4143357{col 75}{space 3} 1.596805
{txt}{space 11}_Ihour_21 {c |}{col 22}{res}{space 2}-.1367636{col 34}{space 2} .4389269{col 45}{space 1}   -0.31{col 54}{space 3}0.760{col 62}{space 4}-1.072314{col 75}{space 3} .7987869
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 9.147933{col 34}{space 2} 1.586646{col 45}{space 1}    5.77{col 54}{space 3}0.000{col 62}{space 4} 5.766077{col 75}{space 3} 12.52979
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_robust3.doc, replace ctitle(OLS 5 Lags a) 
. 
. reg pbid_max mg_price_id_max_lag*  $fe6, vce(cluster yq)

{txt}Linear regression                               Number of obs     = {res}    12,860
                                                {txt}{help j_robustsingular:F(14, 15) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.7059
                                                {txt}Root MSE          =    {res} 6.8229

{txt}{ralign 86:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34}    Robust
{col 1}            pbid_max{col 22}{c |} Coefficient{col 34}  std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}mg_price_id_max_lag {c |}{col 22}{res}{space 2} .3788937{col 34}{space 2} .0288856{col 45}{space 1}   13.12{col 54}{space 3}0.000{col 62}{space 4} .3173256{col 75}{space 3} .4404618
{txt}mg_price_id_max_lag2 {c |}{col 22}{res}{space 2} .0316108{col 34}{space 2} .0312835{col 45}{space 1}    1.01{col 54}{space 3}0.328{col 62}{space 4}-.0350684{col 75}{space 3}   .09829
{txt}mg_price_id_max_lag3 {c |}{col 22}{res}{space 2} .1135638{col 34}{space 2} .0173318{col 45}{space 1}    6.55{col 54}{space 3}0.000{col 62}{space 4}  .076622{col 75}{space 3} .1505055
{txt}mg_price_id_max_lag4 {c |}{col 22}{res}{space 2} .0837264{col 34}{space 2} .0208082{col 45}{space 1}    4.02{col 54}{space 3}0.001{col 62}{space 4} .0393749{col 75}{space 3}  .128078
{txt}mg_price_id_max_lag5 {c |}{col 22}{res}{space 2} .1369452{col 34}{space 2} .0268792{col 45}{space 1}    5.09{col 54}{space 3}0.000{col 62}{space 4} .0796535{col 75}{space 3} .1942369
{txt}{space 9}_Iyear_2018 {c |}{col 22}{res}{space 2} .9714803{col 34}{space 2} .9629249{col 45}{space 1}    1.01{col 54}{space 3}0.329{col 62}{space 4}-1.080946{col 75}{space 3} 3.023906
{txt}{space 9}_Iyear_2019 {c |}{col 22}{res}{space 2}-.0803258{col 34}{space 2} 1.020203{col 45}{space 1}   -0.08{col 54}{space 3}0.938{col 62}{space 4}-2.254836{col 75}{space 3} 2.094185
{txt}{space 9}_Iyear_2020 {c |}{col 22}{res}{space 2}-1.489386{col 34}{space 2} 1.615523{col 45}{space 1}   -0.92{col 54}{space 3}0.371{col 62}{space 4}-4.932792{col 75}{space 3}  1.95402
{txt}{space 11}_Imonth_2 {c |}{col 22}{res}{space 2} 2.167698{col 34}{space 2} 1.308815{col 45}{space 1}    1.66{col 54}{space 3}0.118{col 62}{space 4}-.6219757{col 75}{space 3} 4.957372
{txt}{space 11}_Imonth_3 {c |}{col 22}{res}{space 2}-.9509836{col 34}{space 2} 1.435887{col 45}{space 1}   -0.66{col 54}{space 3}0.518{col 62}{space 4}-4.011505{col 75}{space 3} 2.109538
{txt}{space 11}_Imonth_4 {c |}{col 22}{res}{space 2}-2.191333{col 34}{space 2} 1.260146{col 45}{space 1}   -1.74{col 54}{space 3}0.103{col 62}{space 4}-4.877272{col 75}{space 3} .4946048
{txt}{space 11}_Imonth_5 {c |}{col 22}{res}{space 2}-1.642014{col 34}{space 2} 1.247789{col 45}{space 1}   -1.32{col 54}{space 3}0.208{col 62}{space 4}-4.301613{col 75}{space 3} 1.017585
{txt}{space 11}_Imonth_6 {c |}{col 22}{res}{space 2}-.5324969{col 34}{space 2} 1.114501{col 45}{space 1}   -0.48{col 54}{space 3}0.640{col 62}{space 4}   -2.908{col 75}{space 3} 1.843006
{txt}{space 11}_Imonth_7 {c |}{col 22}{res}{space 2}-.5808794{col 34}{space 2} 1.167753{col 45}{space 1}   -0.50{col 54}{space 3}0.626{col 62}{space 4}-3.069885{col 75}{space 3} 1.908126
{txt}{space 11}_Imonth_8 {c |}{col 22}{res}{space 2}-.8784733{col 34}{space 2} 1.694267{col 45}{space 1}   -0.52{col 54}{space 3}0.612{col 62}{space 4}-4.489718{col 75}{space 3} 2.732772
{txt}{space 11}_Imonth_9 {c |}{col 22}{res}{space 2}-.8298875{col 34}{space 2} 1.716398{col 45}{space 1}   -0.48{col 54}{space 3}0.636{col 62}{space 4}-4.488304{col 75}{space 3} 2.828529
{txt}{space 10}_Imonth_10 {c |}{col 22}{res}{space 2} .3864554{col 34}{space 2} 1.656324{col 45}{space 1}    0.23{col 54}{space 3}0.819{col 62}{space 4}-3.143917{col 75}{space 3} 3.916827
{txt}{space 10}_Imonth_11 {c |}{col 22}{res}{space 2}  .068972{col 34}{space 2} 1.762656{col 45}{space 1}    0.04{col 54}{space 3}0.969{col 62}{space 4} -3.68804{col 75}{space 3} 3.825984
{txt}{space 10}_Imonth_12 {c |}{col 22}{res}{space 2} .9122358{col 34}{space 2} 1.376945{col 45}{space 1}    0.66{col 54}{space 3}0.518{col 62}{space 4}-2.022653{col 75}{space 3} 3.847124
{txt}{space 12}_Ihour_9 {c |}{col 22}{res}{space 2}-.2739219{col 34}{space 2} .3986222{col 45}{space 1}   -0.69{col 54}{space 3}0.502{col 62}{space 4}-1.123565{col 75}{space 3} .5757212
{txt}{space 11}_Ihour_10 {c |}{col 22}{res}{space 2} .3456359{col 34}{space 2}  .422891{col 45}{space 1}    0.82{col 54}{space 3}0.427{col 62}{space 4}-.5557349{col 75}{space 3} 1.247007
{txt}{space 11}_Ihour_11 {c |}{col 22}{res}{space 2} 1.467708{col 34}{space 2} .4466082{col 45}{space 1}    3.29{col 54}{space 3}0.005{col 62}{space 4} .5157856{col 75}{space 3} 2.419631
{txt}{space 11}_Ihour_12 {c |}{col 22}{res}{space 2} 3.510384{col 34}{space 2} .8100508{col 45}{space 1}    4.33{col 54}{space 3}0.001{col 62}{space 4} 1.783801{col 75}{space 3} 5.236966
{txt}{space 11}_Ihour_13 {c |}{col 22}{res}{space 2} 2.239598{col 34}{space 2} .5267971{col 45}{space 1}    4.25{col 54}{space 3}0.001{col 62}{space 4} 1.116757{col 75}{space 3} 3.362439
{txt}{space 11}_Ihour_14 {c |}{col 22}{res}{space 2} 2.432538{col 34}{space 2}  .542175{col 45}{space 1}    4.49{col 54}{space 3}0.000{col 62}{space 4}  1.27692{col 75}{space 3} 3.588157
{txt}{space 11}_Ihour_15 {c |}{col 22}{res}{space 2} 2.793492{col 34}{space 2} .5452795{col 45}{space 1}    5.12{col 54}{space 3}0.000{col 62}{space 4} 1.631256{col 75}{space 3} 3.955728
{txt}{space 11}_Ihour_16 {c |}{col 22}{res}{space 2} 2.940009{col 34}{space 2} .5625242{col 45}{space 1}    5.23{col 54}{space 3}0.000{col 62}{space 4} 1.741018{col 75}{space 3} 4.139001
{txt}{space 11}_Ihour_17 {c |}{col 22}{res}{space 2}   2.8194{col 34}{space 2} .5258505{col 45}{space 1}    5.36{col 54}{space 3}0.000{col 62}{space 4} 1.698576{col 75}{space 3} 3.940224
{txt}{space 11}_Ihour_18 {c |}{col 22}{res}{space 2}  1.95534{col 34}{space 2} .4725763{col 45}{space 1}    4.14{col 54}{space 3}0.001{col 62}{space 4} .9480678{col 75}{space 3} 2.962613
{txt}{space 11}_Ihour_19 {c |}{col 22}{res}{space 2} 1.353042{col 34}{space 2} .3727987{col 45}{space 1}    3.63{col 54}{space 3}0.002{col 62}{space 4} .5584409{col 75}{space 3} 2.147644
{txt}{space 11}_Ihour_20 {c |}{col 22}{res}{space 2} .6982699{col 34}{space 2} .4077926{col 45}{space 1}    1.71{col 54}{space 3}0.107{col 62}{space 4}-.1709196{col 75}{space 3} 1.567459
{txt}{space 11}_Ihour_21 {c |}{col 22}{res}{space 2} .0110219{col 34}{space 2} .3743307{col 45}{space 1}    0.03{col 54}{space 3}0.977{col 62}{space 4} -.786845{col 75}{space 3} .8088888
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 12.64333{col 34}{space 2} 2.688523{col 45}{space 1}    4.70{col 54}{space 3}0.000{col 62}{space 4} 6.912881{col 75}{space 3} 18.37378
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_robust3.doc, append ctitle(OLS 5 Lags b) 
. 
. reg pbid_max mg_price_id_max_lag* solar_share wind_share hydro_share gas_share coal_share load_ACT solar_fc_error wind_fc_error load_fc_error co2price gasprice $fe, vce(cluster yq)

{txt}Linear regression                               Number of obs     = {res}    12,859
                                                {txt}{help j_robustsingular:F(14, 15) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.8013
                                                {txt}Root MSE          =    {res} 5.6106

{txt}{ralign 86:(Std. err. adjusted for {res:16} clusters in {res:yq})}
{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34}    Robust
{col 1}            pbid_max{col 22}{c |} Coefficient{col 34}  std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}mg_price_id_max_lag {c |}{col 22}{res}{space 2} .1211174{col 34}{space 2}  .024181{col 45}{space 1}    5.01{col 54}{space 3}0.000{col 62}{space 4} .0695769{col 75}{space 3} .1726579
{txt}mg_price_id_max_lag2 {c |}{col 22}{res}{space 2} .0323587{col 34}{space 2} .0199468{col 45}{space 1}    1.62{col 54}{space 3}0.126{col 62}{space 4} -.010157{col 75}{space 3} .0748744
{txt}mg_price_id_max_lag3 {c |}{col 22}{res}{space 2} .0740464{col 34}{space 2} .0122698{col 45}{space 1}    6.03{col 54}{space 3}0.000{col 62}{space 4} .0478941{col 75}{space 3} .1001988
{txt}mg_price_id_max_lag4 {c |}{col 22}{res}{space 2} .0542176{col 34}{space 2} .0197295{col 45}{space 1}    2.75{col 54}{space 3}0.015{col 62}{space 4} .0121652{col 75}{space 3} .0962699
{txt}mg_price_id_max_lag5 {c |}{col 22}{res}{space 2} .0584204{col 34}{space 2} .0254182{col 45}{space 1}    2.30{col 54}{space 3}0.036{col 62}{space 4} .0042427{col 75}{space 3} .1125981
{txt}{space 9}solar_share {c |}{col 22}{res}{space 2} .0261025{col 34}{space 2} .0369581{col 45}{space 1}    0.71{col 54}{space 3}0.491{col 62}{space 4}-.0526719{col 75}{space 3} .1048769
{txt}{space 10}wind_share {c |}{col 22}{res}{space 2}-.1858355{col 34}{space 2} .0403792{col 45}{space 1}   -4.60{col 54}{space 3}0.000{col 62}{space 4}-.2719018{col 75}{space 3}-.0997692
{txt}{space 9}hydro_share {c |}{col 22}{res}{space 2}-.1818209{col 34}{space 2} .0675202{col 45}{space 1}   -2.69{col 54}{space 3}0.017{col 62}{space 4}-.3257367{col 75}{space 3}-.0379051
{txt}{space 11}gas_share {c |}{col 22}{res}{space 2} .0092167{col 34}{space 2} .0512551{col 45}{space 1}    0.18{col 54}{space 3}0.860{col 62}{space 4}-.1000308{col 75}{space 3} .1184643
{txt}{space 10}coal_share {c |}{col 22}{res}{space 2} .2418969{col 34}{space 2} .0800034{col 45}{space 1}    3.02{col 54}{space 3}0.009{col 62}{space 4} .0713736{col 75}{space 3} .4124202
{txt}{space 12}load_ACT {c |}{col 22}{res}{space 2} .6633045{col 34}{space 2} .0827953{col 45}{space 1}    8.01{col 54}{space 3}0.000{col 62}{space 4} .4868305{col 75}{space 3} .8397785
{txt}{space 6}solar_fc_error {c |}{col 22}{res}{space 2}-.1427178{col 34}{space 2} .5224886{col 45}{space 1}   -0.27{col 54}{space 3}0.788{col 62}{space 4}-1.256376{col 75}{space 3} .9709402
{txt}{space 7}wind_fc_error {c |}{col 22}{res}{space 2}-1.206276{col 34}{space 2} 1.095534{col 45}{space 1}   -1.10{col 54}{space 3}0.288{col 62}{space 4}-3.541352{col 75}{space 3}   1.1288
{txt}{space 7}load_fc_error {c |}{col 22}{res}{space 2} 42.25819{col 34}{space 2} 12.55619{col 45}{space 1}    3.37{col 54}{space 3}0.004{col 62}{space 4} 15.49531{col 75}{space 3} 69.02107
{txt}{space 12}co2price {c |}{col 22}{res}{space 2}  .095529{col 34}{space 2} .1413558{col 45}{space 1}    0.68{col 54}{space 3}0.509{col 62}{space 4}-.2057638{col 75}{space 3} .3968218
{txt}{space 12}gasprice {c |}{col 22}{res}{space 2} .4667115{col 34}{space 2} .1095466{col 45}{space 1}    4.26{col 54}{space 3}0.001{col 62}{space 4} .2332183{col 75}{space 3} .7002046
{txt}{space 14}_Iyq_2 {c |}{col 22}{res}{space 2}-5.361275{col 34}{space 2}  .639264{col 45}{space 1}   -8.39{col 54}{space 3}0.000{col 62}{space 4}-6.723834{col 75}{space 3}-3.998716
{txt}{space 14}_Iyq_3 {c |}{col 22}{res}{space 2}-9.114264{col 34}{space 2} .6676888{col 45}{space 1}  -13.65{col 54}{space 3}0.000{col 62}{space 4}-10.53741{col 75}{space 3}-7.691119
{txt}{space 14}_Iyq_4 {c |}{col 22}{res}{space 2}-3.204932{col 34}{space 2} .5647687{col 45}{space 1}   -5.67{col 54}{space 3}0.000{col 62}{space 4}-4.408708{col 75}{space 3}-2.001155
{txt}{space 14}_Iyq_5 {c |}{col 22}{res}{space 2}-4.761877{col 34}{space 2} .6684124{col 45}{space 1}   -7.12{col 54}{space 3}0.000{col 62}{space 4}-6.186564{col 75}{space 3}-3.337189
{txt}{space 14}_Iyq_6 {c |}{col 22}{res}{space 2}-2.524778{col 34}{space 2} 1.477318{col 45}{space 1}   -1.71{col 54}{space 3}0.108{col 62}{space 4}-5.673606{col 75}{space 3} .6240498
{txt}{space 14}_Iyq_7 {c |}{col 22}{res}{space 2}-3.644891{col 34}{space 2} 2.042009{col 45}{space 1}   -1.78{col 54}{space 3}0.095{col 62}{space 4} -7.99733{col 75}{space 3} .7075477
{txt}{space 14}_Iyq_8 {c |}{col 22}{res}{space 2}-.2961248{col 34}{space 2} 2.181083{col 45}{space 1}   -0.14{col 54}{space 3}0.894{col 62}{space 4}-4.944994{col 75}{space 3} 4.352744
{txt}{space 14}_Iyq_9 {c |}{col 22}{res}{space 2}-1.895358{col 34}{space 2} 2.276471{col 45}{space 1}   -0.83{col 54}{space 3}0.418{col 62}{space 4}-6.747541{col 75}{space 3} 2.956825
{txt}{space 13}_Iyq_10 {c |}{col 22}{res}{space 2}-1.986791{col 34}{space 2} 2.804248{col 45}{space 1}   -0.71{col 54}{space 3}0.490{col 62}{space 4}-7.963905{col 75}{space 3} 3.990323
{txt}{space 13}_Iyq_11 {c |}{col 22}{res}{space 2}-3.433802{col 34}{space 2} 3.030051{col 45}{space 1}   -1.13{col 54}{space 3}0.275{col 62}{space 4}-9.892202{col 75}{space 3} 3.024598
{txt}{space 13}_Iyq_12 {c |}{col 22}{res}{space 2}-2.700414{col 34}{space 2} 2.699734{col 45}{space 1}   -1.00{col 54}{space 3}0.333{col 62}{space 4}-8.454761{col 75}{space 3} 3.053932
{txt}{space 13}_Iyq_13 {c |}{col 22}{res}{space 2}-5.183042{col 34}{space 2} 2.635027{col 45}{space 1}   -1.97{col 54}{space 3}0.068{col 62}{space 4}-10.79947{col 75}{space 3} .4333852
{txt}{space 13}_Iyq_14 {c |}{col 22}{res}{space 2}-7.193521{col 34}{space 2} 2.605502{col 45}{space 1}   -2.76{col 54}{space 3}0.015{col 62}{space 4}-12.74702{col 75}{space 3}-1.640025
{txt}{space 13}_Iyq_15 {c |}{col 22}{res}{space 2}-6.318162{col 34}{space 2} 3.111978{col 45}{space 1}   -2.03{col 54}{space 3}0.060{col 62}{space 4}-12.95119{col 75}{space 3} .3148631
{txt}{space 13}_Iyq_16 {c |}{col 22}{res}{space 2} 5.963714{col 34}{space 2} 3.146663{col 45}{space 1}    1.90{col 54}{space 3}0.077{col 62}{space 4}-.7432401{col 75}{space 3} 12.67067
{txt}{space 12}_Ihour_9 {c |}{col 22}{res}{space 2} -1.08013{col 34}{space 2} .4506419{col 45}{space 1}   -2.40{col 54}{space 3}0.030{col 62}{space 4}-2.040651{col 75}{space 3}-.1196097
{txt}{space 11}_Ihour_10 {c |}{col 22}{res}{space 2}-1.246997{col 34}{space 2} .5746917{col 45}{space 1}   -2.17{col 54}{space 3}0.046{col 62}{space 4}-2.471923{col 75}{space 3}-.0220701
{txt}{space 11}_Ihour_11 {c |}{col 22}{res}{space 2}-1.100586{col 34}{space 2} .6658934{col 45}{space 1}   -1.65{col 54}{space 3}0.119{col 62}{space 4}-2.519904{col 75}{space 3} .3187324
{txt}{space 11}_Ihour_12 {c |}{col 22}{res}{space 2} 1.340093{col 34}{space 2} 1.138751{col 45}{space 1}    1.18{col 54}{space 3}0.258{col 62}{space 4}-1.087097{col 75}{space 3} 3.767283
{txt}{space 11}_Ihour_13 {c |}{col 22}{res}{space 2}-1.175752{col 34}{space 2} .7637792{col 45}{space 1}   -1.54{col 54}{space 3}0.145{col 62}{space 4}-2.803709{col 75}{space 3} .4522052
{txt}{space 11}_Ihour_14 {c |}{col 22}{res}{space 2}-1.196394{col 34}{space 2} .7903193{col 45}{space 1}   -1.51{col 54}{space 3}0.151{col 62}{space 4} -2.88092{col 75}{space 3} .4881315
{txt}{space 11}_Ihour_15 {c |}{col 22}{res}{space 2}-.8879516{col 34}{space 2} .7611808{col 45}{space 1}   -1.17{col 54}{space 3}0.262{col 62}{space 4} -2.51037{col 75}{space 3} .7344669
{txt}{space 11}_Ihour_16 {c |}{col 22}{res}{space 2}-.5118001{col 34}{space 2} .7366189{col 45}{space 1}   -0.69{col 54}{space 3}0.498{col 62}{space 4}-2.081866{col 75}{space 3} 1.058266
{txt}{space 11}_Ihour_17 {c |}{col 22}{res}{space 2}-.3807196{col 34}{space 2} .7264363{col 45}{space 1}   -0.52{col 54}{space 3}0.608{col 62}{space 4}-1.929082{col 75}{space 3} 1.167643
{txt}{space 11}_Ihour_18 {c |}{col 22}{res}{space 2}-.4529125{col 34}{space 2} .7098702{col 45}{space 1}   -0.64{col 54}{space 3}0.533{col 62}{space 4}-1.965965{col 75}{space 3}  1.06014
{txt}{space 11}_Ihour_19 {c |}{col 22}{res}{space 2}-.3190287{col 34}{space 2} .5830363{col 45}{space 1}   -0.55{col 54}{space 3}0.592{col 62}{space 4}-1.561741{col 75}{space 3} .9236837
{txt}{space 11}_Ihour_20 {c |}{col 22}{res}{space 2}-.4057571{col 34}{space 2}  .601119{col 45}{space 1}   -0.68{col 54}{space 3}0.510{col 62}{space 4}-1.687012{col 75}{space 3} .8754977
{txt}{space 11}_Ihour_21 {c |}{col 22}{res}{space 2}-.4443696{col 34}{space 2} .4735063{col 45}{space 1}   -0.94{col 54}{space 3}0.363{col 62}{space 4}-1.453624{col 75}{space 3} .5648852
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 11.52393{col 34}{space 2} 4.342353{col 45}{space 1}    2.65{col 54}{space 3}0.018{col 62}{space 4} 2.268421{col 75}{space 3} 20.77944
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. cd "$dirpath/Final/RegressionResults"
{res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\RegressionResults
{txt}
{com}. *outreg2 using 2ndstep_robust3.doc, append ctitle(OLS 5 Lags c) 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\JOHANNS\EnBW AG\C-UE C-UM - Dokumente\Team\Silke\Stata\Spain\Data\Final\regressions_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}18 Nov 2022, 13:28:55
{txt}{.-}
{smcl}
{txt}{sf}{ul off}